{"id":"whats-new#about-aws-whats-new-2022-11-amazon-sagemaker-data-wrangler-over-40-third-party-applications-data-sources","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/amazon-sagemaker-data-wrangler-over-40-third-party-applications-data-sources/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-30T18:26:12+0000","dateUpdated":"2022-11-30T22:07:16+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2022","whats-new_marketing-marchitecture":"application-services","whats-new_general-products":"amazon-sagemaker-data-wrangler","postBody":"<p><a href=\"/content/aws.amazon.com/live/en_US/appflow.html\" target=\"_blank\" rel=\"noopener\">Amazon AppFlow</a> is a fully managed service that enables customers to securely transfer data from third-party applications to AWS services such as Amazon S3, and catalog the data in the AWS Glue Data Catalog in just a few clicks. Once the data sources are set up in AppFlow, you can browse tables and schemas from these data sources using Data Wrangler SQL explorer. You can write Athena queries to preview data to ensure that it is relevant for your use cases, and import data to prepare for ML model training. You can also join data from multiple sources after import to create the right data set for ML. Once the data is imported, you can quickly understand data quality, clean the data, and create features with 300+ built in analysis and data transformation. You can also train and deploy model with SageMaker Autopilot, and operationalize data preparation process in a feature engineering, training or or deployment pipeline using integration with SageMaker Pipeline from Data Wrangler.</p>\r\n<p>Data Wrangler supports 40+ third-party data sources in <a href=\"https://docs.aws.amazon.com/general/latest/gr/appflow.html\" target=\"_blank\" rel=\"noopener\">all the regions currently supported by AppFlow</a>. This feature is available at no additional charge beside Data Wrangler and AppFlow cost.</p>\r\n<p>To get started, see the following resources:</p>\r\n<ul>\r\n<li>New — <a href=\"http://aws.amazon.com/blogs/aws/new-amazon-sagemaker-data-wrangler-supports-saas-applications-as-data-sources/\" target=\"_blank\" rel=\"noopener\">Amazon SageMaker Data Wrangler supports SaaS applications as data sources</a></li>\r\n<li><a href=\"https://docs.aws.amazon.com/sagemaker/latest/dg/data-wrangler-import.html#data-wrangler-import-saas\" target=\"_blank\" rel=\"noopener\">Import data from third-party applications</a> in the AWS technical documentation</li>\r\n</ul>\r\n","modifiedDate":"2022-11-30T22:06:26Z","headlineUrl":"/about-aws/whats-new/2022/11/amazon-sagemaker-data-wrangler-over-40-third-party-applications-data-sources/","postDateTime":"2022-11-30T13:00:00Z","postSummary":"<p>Today, AWS announces the general availability of Amazon SageMaker Data Wrangler support for over 40 third party applications as data sources for machine learning (ML) through the integration with Amazon&nbsp;AppFlow. <a href=\"/content/aws.amazon.com/live/en_US/sagemaker/data-wrangler.html\" target=\"_blank\" rel=\"noopener\">Amazon SageMaker Data Wrangler</a> reduces the time it takes to aggregate and prepare data for machine learning (ML) from weeks to minutes. Preparing high quality data for ML is often complex and time consuming as it requires aggregating data across various sources and formats using different tools. With SageMaker Data Wrangler, you can explore and import data from a variety of popular sources, such as Amazon S3, Amazon Athena, Amazon Redshift, Snowflake, Databricks and Salesforce Customer Data Platform. Starting today, we are making it easier for customers to aggregate data for ML from over 40 third-party application data sources, including Salesforce Marketing, SAP, Google Analytics, LinkedIn and more via Amazon AppFlow.&nbsp;</p>\r\n","contentType":"Launch Announcement","headline":"Amazon SageMaker Data Wrangler now supports over 40 third-party applications as data sources"}
{"id":"whats-new#about-aws-whats-new-2022-11-new-ml-governance-tools-amazon-sagemaker","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/new-ml-governance-tools-amazon-sagemaker/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-30T17:55:20+0000","dateUpdated":"2022-11-30T22:07:05+0000","GLOBAL_content-type":"Launch Announcement","postBody":"<p>With Amazon SageMaker Model Cards, you can create a single source of truth for model information by centralizing and standardizing documentation throughout the model lifecycle. You can record details such as purpose and performance goals while SageMaker Model Cards autopopulates training details to accelerate the process. Once the models are deployed, Amazon SageMaker Model Dashboard gives you unified monitoring across all your models by providing deviations from expected behavior, automated alerts, and troubleshooting to improve model performance. </p>\r\n<p>All three features are now available in all <a href=\"/content/aws.amazon.com/live/en_US/about-aws/global-infrastructure/regional-product-services.html\" target=\"_blank\" rel=\"noopener\">AWS Regions</a> where Amazon SageMaker is currently available, excluding China. </p>\r\n<p>To get started, refer to the ML governance with Amazon SageMaker <a href=\"/content/aws.amazon.com/live/en_US/sagemaker/ml-governance.html\" target=\"_blank\" rel=\"noopener\">webpage</a> and technical <a href=\"https://docs.aws.amazon.com/sagemaker/latest/dg/governance.html\" target=\"_blank\" rel=\"noopener\">documentation</a>. To learn more, read our <a href=\"https://aws.amazon.com/blogs/aws/new-ml-governance-tools-for-amazon-sagemaker-simplify-access-control-and-enhance-transparency-over-your-ml-projects\" target=\"_blank\" rel=\"noopener\">blog post</a>.</p>\r\n","modifiedDate":"2022-11-30T22:06:16Z","headlineUrl":"/about-aws/whats-new/2022/11/new-ml-governance-tools-amazon-sagemaker/","postDateTime":"2022-11-30T13:00:00Z","postSummary":"<p>Today, we are excited to announce three new purpose-built tools for Amazon SageMaker to improve governance of your machine learning (ML) projects with simplified access control and enhanced transparency across your ML model’s lifecycle. With Amazon SageMaker Role Manager, you can define minimum permissions for users in minutes and onboard new users faster. SageMaker Role Manager simplifies the permission setting for ML activities and automatically generates a custom policy based on your specific needs.</p>\r\n","contentType":"Launch Announcement","headline":"Introducing new ML governance tools for Amazon SageMaker"}
{"id":"whats-new#about-aws-whats-new-2022-11-amazon-athena-now-supports-apache-spark","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/amazon-athena-now-supports-apache-spark/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-30T17:00:53+0000","dateUpdated":"2022-11-30T22:07:34+0000","whats-new_general-products":"amazon-athena","whats-new_year":"2022","whats-new_marketing-marchitecture":"analytics","GLOBAL_content-type":"Launch Announcement","postBody":"<p>You can build interactive Apache PySpark applications using a simplified notebook experience in the Athena console or through Athena APIs. With Athena,&nbsp;interactive Spark applications start in under a second and run faster with our optimized Spark runtime, so you spend more time on insights, not waiting for results. As Athena takes care of managing the infrastructure and configuring Spark settings, you can focus on your business applications.</p>\r\n<p>You can use Athena for Apache Spark in the following 5 <a href=\"/content/aws.amazon.com/live/en_US/about-aws/global-infrastructure/regional-product-services.html\" target=\"_blank\" rel=\"noopener\">AWS Regions</a>: US East (Ohio), US East (N. Virginia), US West (Oregon), Asia Pacific (Tokyo), and Europe (Ireland), with availability in additional Regions in the coming months.</p>\r\n<p>To learn more and get started, visit the <a href=\"/content/aws.amazon.com/live/en_US/athena/spark.html\" target=\"_blank\" rel=\"noopener\">Amazon Athena for Apache Spark webpage</a>.</p>\r\n","modifiedDate":"2022-11-30T22:06:41Z","headlineUrl":"/about-aws/whats-new/2022/11/amazon-athena-now-supports-apache-spark/","postDateTime":"2022-11-30T13:00:00Z","postSummary":"<p>Amazon Athena now supports Apache Spark, a popular open-source distributed processing system that is optimized for fast analytics workloads against data of any size. Athena is an interactive query service that helps you query petabytes of data wherever it lives, such as in data lakes, databases, or other data stores. With Amazon Athena for Apache Spark, you get the streamlined, interactive, serverless experience of Athena with Spark, in addition to SQL. </p>\r\n","contentType":"Launch Announcement","headline":"Amazon Athena now supports Apache Spark"}
{"id":"whats-new#about-aws-whats-new-2022-11-amazon-sagemaker-data-wrangler-built-in-data-preparation-notebooks","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/amazon-sagemaker-data-wrangler-built-in-data-preparation-notebooks/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-30T18:43:25+0000","dateUpdated":"2022-11-30T22:07:06+0000","whats-new_marketing-marchitecture":"artificial-intelligence","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2022","whats-new_general-products":"amazon-sagemaker-studio","postBody":"<p>Starting today, Data Wrangler offers a built-in data preparation capability in Amazon SageMaker Studio notebooks that allows ML practitioners to visually review data characteristics, identify issues, and remediate data-quality problems—in just a few clicks directly within the notebooks. When users display a data frame (a tabular representation of data) in their notebooks, SageMaker Studio notebooks automatically generate charts to help users understand their data distribution patterns, identify potential issues such as incorrect data, missing data, or outliers, and suggests data transformations to fix these issues. The new capability also enables users to identify target column data quality issues that will affect the ML model performance such as imbalanced data or mixed data types, and suggests data transformations to fix these issues. Once the ML practitioner selects a data transformation, SageMaker Studio notebooks generates the corresponding codes within the notebook so the data transformation can be repeatedly applied every time the notebook is run.</p>\r\n<p>This feature is generally available in all the regions currently supported by SageMaker Studio notebooks at no additional charge.&nbsp;</p>\r\n<p>To get started, see the following resources:</p>\r\n<ul>\r\n<li><a href=\"https://aws.amazon.com/blogs/aws/next-generation-sagemaker-notebooks-now-with-built-in-data-preparation-real-time-collaboration-and-notebook-automation/\" target=\"_blank\" rel=\"noopener\">Next Generation SageMaker Notebooks – Now with Built-in Data Preparation, Real-Time Collaboration, and Notebook Automation</a></li>\r\n<li><a href=\"https://docs.aws.amazon.com/sagemaker/latest/dg/data-wrangler-notebook-dataprep-assistant.html\" target=\"_blank\" rel=\"noopener\">Data Wrangler data prepration capability for SageMaker Studio Notebook</a> in the AWS developer guide.</li>\r\n</ul>\r\n","modifiedDate":"2022-11-30T22:06:16Z","headlineUrl":"/about-aws/whats-new/2022/11/amazon-sagemaker-data-wrangler-built-in-data-preparation-notebooks/","postDateTime":"2022-11-30T13:00:00Z","postSummary":"<p><a href=\"/content/aws.amazon.com/live/en_US/sagemaker/data-wrangler.html\" target=\"_blank\" rel=\"noopener\">Amazon SageMaker Data Wrangler</a> reduces the time it takes to aggregate and prepare data for ML from weeks to minutes With Data Wrangler, you can simplify the process of data preparation and feature engineering, and complete each step of the data preparation workflow, including data selection, visualization, cleansing, and preparation from a low-code visual interface. Many ML practitioners want to explore datasets directly in notebooks to spot potential data-quality issues, like missing information, extreme values, skewed datasets, or biases, so they can correct those issues to prepare data for training ML model faster. ML practitioners can spend weeks writing boilerplate code to visualize and examine different parts of their dataset to identify and fix potential issues.</p>\r\n","contentType":"Launch Announcement","headline":"Amazon SageMaker Data Wrangler now provides built-in data preparation in notebooks "}
{"id":"whats-new#about-aws-whats-new-2022-11-amazon-ec2-spot-ready-software-products","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/amazon-ec2-spot-ready-software-products/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-30T23:15:01+0000","dateUpdated":"2022-12-01T01:04:17+0000","whats-new_marketing-marchitecture":"partner-network","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2022","postBody":"<p>Amazon EC2 Spot Ready software products are vetted by AWS Partner Solutions Architects through use cases so that customers can deploy on Spot with confidence. Customers can easily find top-tier software products knowing that each partner offering adheres to Spot best practices and has demonstrated customer success. </p>\r\n<p>Amazon EC2 Spot Ready Partners makes it easy for customers to take advantage of Spot optimizations with a catalog of software products that support Spot. Learn more about <a href=\"/content/aws.amazon.com/live/en_US/ec2/spot/partners.html\" target=\"_blank\" rel=\"noopener\">Amazon EC2 Spot Ready Partner Software Products</a>. </p>\r\n","modifiedDate":"2022-12-01T01:03:26Z","headlineUrl":"/about-aws/whats-new/2022/11/amazon-ec2-spot-ready-software-products/","postDateTime":"2022-11-30T13:00:00Z","postSummary":"<p>The new <a href=\"/content/aws.amazon.com/live/en_US/ec2/spot/partners.html\" target=\"_blank\" rel=\"noopener\">Amazon EC2 Spot Ready</a> specialization helps customers identify validated AWS Partner software products that support Amazon EC2 Spot Instances, a compute purchase option that allows customers to utilize spare EC2 capacity at a discounted price from on demand (up to 90%). Amazon EC2 Spot Ready ensures that customers have a well-architected and cost-optimized solution to help them benefit from EC2 Spot savings for their workloads. </p>\r\n","contentType":"Launch Announcement","headline":"Introducing the Amazon EC2 Spot Ready Software Products"}
{"id":"whats-new#about-aws-whats-new-2022-11-introducing-aws-glue-delivery","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/introducing-aws-glue-delivery/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-30T23:15:16+0000","dateUpdated":"2022-12-01T01:04:06+0000","whats-new_general-products":"aws-glue","whats-new_year":"2022","GLOBAL_content-type":"Launch Announcement","whats-new_marketing-marchitecture":"partner-network","postBody":"<p>The AWS Glue Delivery specialization recognizes AWS Partners that pass an exceptionally high technical bar and have a track record of success in serverless data integration with AWS Glue. AWS Glue Delivery Partners are vetted by AWS Partner Solutions Architects and demonstrate customer success through case studies. Learn more about <a href=\"/content/aws.amazon.com/live/en_US/glue/partners.html\" target=\"_blank\" rel=\"noopener\">AWS Glue Delivery Partners</a>.</p>\r\n","modifiedDate":"2022-12-01T01:03:17Z","headlineUrl":"/about-aws/whats-new/2022/11/introducing-aws-glue-delivery/","postDateTime":"2022-11-30T13:00:00Z","postSummary":"<p>We are excited to announce the new <a href=\"/content/aws.amazon.com/live/en_US/glue/partners.html\" target=\"_blank\" rel=\"noopener\">AWS Glue Delivery</a> specialization, which validates AWS Partners with deep expertise and proven success delivering AWS Glue for data integration, data pipeline, and data catalogue use cases. <a href=\"https://docs.aws.amazon.com/glue/?id=docs_gateway\" target=\"_blank\" rel=\"noopener\">AWS Glue</a> is a scalable, serverless data integration service that makes it easy to discover, prepare, and combine data for analytics, machine learning, and application development. With the ability to scale on demand, AWS Glue helps customers focus on high-value activities that maximize the value of their data.</p>\r\n","contentType":"Launch Announcement","headline":"Introducing AWS Glue Delivery"}
{"id":"whats-new#about-aws-whats-new-2022-11-aws-graviton-delivery-partners","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/aws-graviton-delivery-partners/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-30T23:15:10+0000","dateUpdated":"2022-12-01T01:03:55+0000","whats-new_marketing-marchitecture":"partner-network","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2022","postBody":"<p>AWS Graviton Delivery Partners offer customers world-class services to implement workloads on AWS Graviton-based EC2 instances. From pilots to production deployment, our verified partners are able to recommend a transition strategy to Graviton and guide the customer throughout the entire process. This partnership enables a seamless transition to working with Graviton-based instances for optimal performance and cost.</p>\r\n<p>AWS Graviton Delivery Partners make the adoption of Graviton simple and effective through their tested and verified experience. Learn more about <a href=\"/content/aws.amazon.com/live/en_US/ec2/graviton/partners.html\" target=\"_blank\" rel=\"noopener\">AWS Graviton Delivery Partners</a>.</p>\r\n","modifiedDate":"2022-12-01T01:03:06Z","headlineUrl":"/about-aws/whats-new/2022/11/aws-graviton-delivery-partners/","postDateTime":"2022-11-30T13:00:00Z","postSummary":"<p>We are thrilled to announce the new AWS Graviton Delivery specialization for AWS partners that excel in enabling the best price performance for workloads in Amazon Elastic Compute Cloud (Amazon EC2). This specialization validates AWS Partners that help customers accelerate and scale their adoption of AWS Graviton to achieve better workload performance and cost savings.</p>\r\n","contentType":"Launch Announcement","headline":"Introducing AWS Graviton Delivery Partners"}
{"id":"whats-new#about-aws-whats-new-2022-11-trusted-language-extensions-postgresql-amazon-aurora-rds","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/trusted-language-extensions-postgresql-amazon-aurora-rds/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-30T17:38:19+0000","dateUpdated":"2022-11-30T22:07:12+0000","whats-new_marketing-marchitecture":"databases","whats-new_general-products":"aws-govcloud-us","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2022","postBody":"<p>Trusted Language Extensions for PostgreSQL allows developers to more productively create high performance database extensions using popular trusted languages, like JavaScript, Perl, and PL/pgSQL. Trusted Language Extensions provides database administrators control over who can install extensions and a permissions model for running them, letting application developers deliver new functionality as soon as an extension meets their needs.</p>\r\n<p>Trusted Language Extensions for PostgreSQL is an open source project, available on <a href=\"https://github.com/aws/pg_tle/blob/main/README.md\" target=\"_blank\" rel=\"noopener\">Github</a>, licensed under the Apache 2.0 license. You can learn more about Trusted Language Extensions in the <a href=\"https://aws.amazon.com/blogs/aws/new-trusted-language-extensions-for-postgresql-on-amazon-aurora-and-amazon-rds\" target=\"_blank\" rel=\"noopener\">AWS News blog</a>.</p>\r\n<p>You can get started by launching a new Amazon RDS DB instance directly from the <a href=\"https://console.aws.amazon.com/rds/home\" target=\"_blank\" rel=\"noopener\">AWS Console</a>. Trusted Language Extensions for PostgreSQL is available in all <a href=\"/content/aws.amazon.com/live/en_US/about-aws/global-infrastructure/regional-product-services.html\" target=\"_blank\" rel=\"noopener\">AWS Regions</a>, except the AWS China Regions. Trusted Language Extensions are available at no additional charge.</p>\r\n<p>Learn how to use Trusted Language Extensions for PostgreSQL in <a href=\"https://docs.aws.amazon.com/AmazonRDS/latest/AuroraUserGuide/PostgreSQL_trusted_language_extension.html\" target=\"_blank\" rel=\"noopener\">Amazon Aurora</a> and <a href=\"https://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/PostgreSQL_trusted_language_extension.html\" target=\"_blank\" rel=\"noopener\">Amazon RDS</a>.</p>\r\n","modifiedDate":"2022-11-30T22:06:21Z","headlineUrl":"/about-aws/whats-new/2022/11/trusted-language-extensions-postgresql-amazon-aurora-rds/","postDateTime":"2022-11-30T13:00:00Z","postSummary":"<p>Trusted Language Extensions for PostgreSQL is a new open source development kit to help you build high performance extensions that run safely on PostgreSQL. With Trusted Language Extensions, developers can install extensions written in a trusted language on <a href=\"/content/aws.amazon.com/live/en_US/rds/aurora.html\" target=\"_blank\" rel=\"noopener\">Amazon Aurora PostgreSQL-Compatible Edition</a> and <a href=\"/content/aws.amazon.com/live/en_US/rds/postgresql.html\" target=\"_blank\" rel=\"noopener\">Amazon Relational Database Service (RDS) for PostgreSQL</a>.</p>\r\n","contentType":"Launch Announcement","headline":"Announcing Trusted Language Extensions for PostgreSQL on Amazon Aurora and Amazon RDS"}
{"id":"whats-new#about-aws-whats-new-2022-11-amazon-appflow-supports-over-50-connectors","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/amazon-appflow-supports-over-50-connectors/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-30T18:26:19+0000","dateUpdated":"2022-11-30T22:07:13+0000","whats-new_marketing-marchitecture":"application-services","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2022","whats-new_general-products":"amazon-appflow","postBody":"<p>Highlights include new marketing connectors such as Facebook Ads, Google Ads, Instagram Ads, and LinkedIn Ads; customer service and engagement connectors such as MailChimp, SendGrid, Zendesk Sell, Freshdesk, Okta and Typeform; as well as business operations solutions such as Microsoft Teams, Zoom Meetings, Stripe, QuickBooks Online, Jira Cloud and GitHub. Using the updated Amazon Redshift connector, you can connect to Redshift clusters in a private subnet or Redshift Serverless. Additionally, you can now view run metrics for your flows using Amazon CloudWatch Metrics.</p>\r\n<p>To learn more about how to use Amazon AppFlow please visit the <a href=\"https://docs.aws.amazon.com/appflow/latest/userguide/salesforce.html\" target=\"_blank\" rel=\"noopener\">Amazon AppFlow user guide</a>. To get started, see the following resources:</p>\r\n<ul>\r\n<li><a href=\"/content/aws.amazon.com/live/en_US/appflow/getting-started.html\" target=\"_blank\" rel=\"noopener\">Getting started with Amazon AppFlow</a> videos and demos.</li>\r\n<li><a href=\"/content/aws.amazon.com/live/en_US/appflow/integrations.html\" target=\"_blank\" rel=\"noopener\">Amazon AppFlow integrations</a>.</li>\r\n</ul>\r\n","modifiedDate":"2022-11-30T22:06:21Z","headlineUrl":"/about-aws/whats-new/2022/11/amazon-appflow-supports-over-50-connectors/","postDateTime":"2022-11-30T13:00:00Z","postSummary":"<p>Amazon AppFlow announces the release of 22 new data connectors. With this launch, Amazon AppFlow now supports data connectivity to over 50 applications.  Amazon AppFlow is a fully managed integration service that enables you to securely transfer data between Software-as-a-Service (SaaS) applications and AWS services like Amazon S3 and Amazon Redshift. As enterprises increasingly rely on SaaS services for mission-critical workflows, they face the challenge of collecting data from a growing ecosystem of services into a centralized location to derive business insights using analytics and machine learning. With Amazon AppFlow, you can easily set up data flows in minutes without writing code.</p>\r\n","contentType":"Launch Announcement","headline":"Amazon AppFlow now supports over 50 Connectors"}
{"id":"whats-new#about-aws-whats-new-2022-11-introducing-aws-ai-service-cards-new-resource-responsible-ai","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/introducing-aws-ai-service-cards-new-resource-responsible-ai/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-30T17:55:31+0000","dateUpdated":"2022-11-30T22:07:27+0000","whats-new_year":"2022","whats-new_marketing-marchitecture":"artificial-intelligence","GLOBAL_content-type":"Launch Announcement","postBody":"<p>Today we are launching three AI Service Cards: Amazon Rekognition — Face Matching, Amazon Textract — AnalyzeID, and Amazon Transcribe — Batch (English-US).  Our AI Service Cards will continue to evolve and expand as we engage with our customers and the broader community to gather feedback and continually iterate on our approach.</p>\r\n<p>You can learn more about AI Service Cards, as well as our broader approach to building AI and machine learning (ML) in a responsible way, on our <a href=\"/content/aws.amazon.com/live/en_US/machine-learning/responsible-machine-learning.html\" target=\"_blank\" rel=\"noopener\">webpage</a>. For more information see the AI Service Cards for <a href=\"/content/aws.amazon.com/live/en_US/machine-learning/responsible-machine-learning/rekognition-face-matching.html\" target=\"_blank\" rel=\"noopener\">Amazon Rekognition — Face Matching</a>, <a href=\"/content/aws.amazon.com/live/en_US/machine-learning/responsible-machine-learning/textract-analyzeid.html\" target=\"_blank\" rel=\"noopener\">Amazon Textract — AnalyzeID</a>, and <a href=\"https://aws.amazon.com/machine-learning/responsible-machine-learning/transcribe-speech-recognition/\" target=\"_blank\" rel=\"noopener\">Amazon Transcribe — Batch (English-US)</a>.</p>\r\n","modifiedDate":"2022-11-30T22:06:36Z","headlineUrl":"/about-aws/whats-new/2022/11/introducing-aws-ai-service-cards-new-resource-responsible-ai/","postDateTime":"2022-11-30T13:00:00Z","postSummary":"<p>We are excited to announce AWS AI Service Cards, a new resource to increase transparency and help customers better understand our AWS AI services, including how to use them in a responsible way. AI service cards are a form of responsible AI documentation that provides customers with a single place to find information on the intended use cases and limitations, responsible AI design choices, and best deployment and operation practices for our AI Services. They are part of a comprehensive development process we undertake to build our services in a responsible way with fairness and bias, robustness, explainability, governance, transparency, privacy, and security in mind.</p>\r\n","contentType":"Launch Announcement","headline":"Introducing AWS AI Service Cards - a new resource for responsible AI"}
{"id":"whats-new#about-aws-whats-new-2022-11-amazon-sagemaker-studio-supports-real-time-collaboration","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/amazon-sagemaker-studio-supports-real-time-collaboration/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-30T18:43:14+0000","dateUpdated":"2022-11-30T22:06:54+0000","whats-new_general-products":"amazon-sagemaker-studio","whats-new_year":"2022","GLOBAL_content-type":"Launch Announcement","whats-new_marketing-marchitecture":"artificial-intelligence","postBody":"<p>By creating shared spaces in SageMaker Studio, users can now access, read, edit, and share the same notebooks in real time. All resources in a shared space are filtered and tagged, making it easier to focus on ML projects and manage costs. Further, administrators now can provision multiple SageMaker domains in a region in order to separate different lines of business within a single AWS account. Finally, users can now configure a list of suggested Git repository URLs at the SageMaker domain or user profile level to aid collaboration using version control. </p>\r\n<p>All new capabilities are now available in all AWS regions where SageMaker Studio is <a href=\"https://docs.aws.amazon.com/sagemaker/latest/dg/regions-quotas.html\" target=\"_blank\" rel=\"noopener\">available</a>. To learn more, please see the <a href=\"http://aws.amazon.com/blogs/aws/next-generation-sagemaker-notebooks-now-with-built-in-data-preparation-real-time-collaboration-and-notebook-automation\" target=\"_blank\" rel=\"noopener\">blog post</a> and developer documentation for <a href=\"https://docs.aws.amazon.com/sagemaker/latest/dg/domain-space.html\" target=\"_blank\" rel=\"noopener\">shared spaces</a> and <a href=\"https://docs.aws.amazon.com/sagemaker/latest/dg/domain-multiple.html\" target=\"_blank\" rel=\"noopener\">multiple domains</a>.</p>\r\n","modifiedDate":"2022-11-30T22:06:01Z","headlineUrl":"/about-aws/whats-new/2022/11/amazon-sagemaker-studio-supports-real-time-collaboration/","postDateTime":"2022-11-30T13:00:00Z","postSummary":"<p><a href=\"/content/aws.amazon.com/live/en_US/sagemaker/studio.html\" target=\"_blank\" rel=\"noopener\">Amazon SageMaker Studio</a> is a fully integrated development environment (IDE) for machine learning (ML) that enables ML practitioners to perform every step of the machine learning workflow, from preparing data to building, training, tuning, and deploying models. Today, we are announcing new capabilities in SageMaker Studio to accelerate real time collaboration across ML teams. </p>\r\n","contentType":"Launch Announcement","headline":"Amazon SageMaker Studio now supports real time collaboration"}
{"id":"whats-new#about-aws-whats-new-2022-11-amazon-managed-streaming-apache-kafka-msk-delivery-partners","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/amazon-managed-streaming-apache-kafka-msk-delivery-partners/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-30T23:15:01+0000","dateUpdated":"2022-12-01T01:04:06+0000","whats-new_marketing-marchitecture":"partner-network","whats-new_year":"2022","GLOBAL_content-type":"Launch Announcement","postBody":"<p>The Amazon MSK Service Delivery specialization provides customers with a vetted list of AWS Partners with proven success in delivering Amazon MSK Service solutions. With Amazon MSK Delivery Partners, customers can migrate and build data streaming solutions on Amazon MSK with confidence and realize cost benefits. Learn more on the&nbsp;<a href=\"/content/aws.amazon.com/live/en_US/msk/partners.html\" target=\"_blank\" rel=\"noopener\">Amazon MSK Service Delivery Partners page</a>.</p>\r\n","modifiedDate":"2022-12-01T01:03:17Z","headlineUrl":"/about-aws/whats-new/2022/11/amazon-managed-streaming-apache-kafka-msk-delivery-partners/","postDateTime":"2022-11-30T13:00:00Z","postSummary":"<p>Amazon Web Services (AWS) is incredibly excited to announce the new Amazon MSK Service Delivery specialization for AWS partners that help customers migrate and build real-time streaming analytics solutions with fully managed Apache Kafka. <a href=\"/content/aws.amazon.com/live/en_US/msk.html\" target=\"_blank\" rel=\"noopener\">Amazon MSK</a> provisions your servers, configures your Apache Kafka clusters, replaces servers when they fail, orchestrates server patches and upgrades, architects clusters for high availability, ensures data is durably stored and secured, sets up monitoring and alarms, and runs scaling to support load changes. With <a href=\"/content/aws.amazon.com/live/en_US/msk/features/msk-serverless.html\" target=\"_blank\" rel=\"noopener\">MSK Serverless</a>, getting started with Apache Kafka is even easier. It automatically provisions and scales compute and storage resources and offers throughput-based pricing, so you can use Apache Kafka on demand and pay for the data you stream and retain. </p>\r\n","contentType":"Launch Announcement","headline":"Introducing Amazon Managed Streaming for Apache Kafka (MSK) Delivery Partners"}
{"id":"whats-new#about-aws-whats-new-2022-11-aws-machine-learning-university-educator-enablement-program-higher-education","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/aws-machine-learning-university-educator-enablement-program-higher-education/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-30T18:32:32+0000","dateUpdated":"2022-11-30T22:06:45+0000","whats-new_year":"2022","GLOBAL_content-type":"Launch Announcement","whats-new_marketing-marchitecture":"artificial-intelligence","whats-new_marketing-industry":"education","postBody":"<p>AWS Machine Learning University strives to diversify DM/AI/ML graduate pipelines by providing free curriculum, computing development environment, and year-round educator enablement to faculty at all colleges and universities. The new educator enablement program includes comprehensive courses supported by a suite of professional development engagements, giving educators pre-packaged options to launch their own stand-alone courses, certificates, or full degrees. Faculty, students, and life-long learners may access instructional material through AWS Academy as well as Amazon SageMaker Studio Lab, AWS' free AI/ML development environment that provides computing, storage, and security for anybody to learn and experiment with DM/AI/ML. Faculty at participating institutions will have access to instructor guides, datasets, and MLU support to implement their programs.<br>\r\n</p>\r\n<p>Educators get classroom-ready through a community of practice including MLU instructors, Amazon Scholars, and peer faculty. First, they onboard in cohorts via virtual classes to learn the material and deep dive into how to teach it. Next, they select from a menu of year-round professional development opportunities such as a dedicated channel to promote sharing of teaching best practices, a DM/AI/ML education topic series with Amazon Scholars to help stay current on the state of the art in AI/ML education, virtual study sessions moderated by MLU instructors to promote on-going faculty success, and regional events to continue growing and connecting with the community. For institutions wanting to offer full degree programs, AWS Machine Learning University also provides small group consultations with Amazon’s AI/ML education experts. To learn more about the program and express interest in attending an upcoming bootcamp <a href=\"/content/aws.amazon.com/live/en_US/machine-learning/educators.html\" target=\"_blank\" rel=\"noopener\">visit here</a>.<br>\r\n</p>\r\n","modifiedDate":"2022-11-30T22:05:55Z","headlineUrl":"/about-aws/whats-new/2022/11/aws-machine-learning-university-educator-enablement-program-higher-education/","postDateTime":"2022-11-30T13:00:00Z","postSummary":"<p>AWS Machine Learning University is now providing a free educator enablement program that prioritizes U.S. community colleges, Minority Serving Institutions (MSIs), and Historically Black Colleges and Universities (HBCUs). Educators can leverage these tools to launch stand-alone courses, certificates, or full degrees in data management (DM), artificial intelligence (AI), and machine learning (ML). The goal is to make early-career DM/AI/ML jobs more accessible to a broader and more diverse student population. The program offers a suite of ready-to-use tools to faculty, including a library of ready-to-teach DM/AI/ML educational materials, free computing capacity, and comprehensive faculty professional development built around MLU, Amazon's own internal training program for ML practitioners.<br>\r\n</p>\r\n","contentType":"Launch Announcement","headline":"AWS Machine Learning University announces educator enablement program for higher education"}
{"id":"whats-new#about-aws-whats-new-2022-11-amazon-guardduty-rds-protection-preview","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/amazon-guardduty-rds-protection-preview/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-30T17:44:58+0000","dateUpdated":"2022-12-01T00:11:09+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2022","whats-new_general-products":"amazon-aurora","whats-new_marketing-marchitecture":"security-identity-and-compliance","postBody":"<p>Amazon GuardDuty RDS Protection can be enabled with a single click in the GuardDuty console. Utilizing AWS Organizations for multi-account management, Amazon GuardDuty makes it easy for security teams to turn on and manage GuardDuty RDS Protection across all accounts in an organization. Once enabled, GuardDuty RDS Protection begins analyzing and profiling access to Aurora databases, and when suspicious behaviors or attempts by known malicious actors are identified, GuardDuty issues actionable security findings to the GuardDuty console, <a href=\"/content/aws.amazon.com/live/en_US/security-hub.html\" target=\"_blank\" rel=\"noopener\">AWS Security Hub</a>, <a href=\"/content/aws.amazon.com/live/en_US/detective.html\" target=\"_blank\" rel=\"noopener\">Amazon Detective</a>, and <a href=\"/content/aws.amazon.com/live/en_US/eventbridge.html\" target=\"_blank\" rel=\"noopener\">Amazon EventBridge</a>, allowing for integration with existing security event management or workflow systems.<br>\r\n</p>\r\n<p>During the preview period, Amazon GuardDuty RDS Protection is available to customers in five AWS Regions: US East (N. Virginia), US East (Ohio), US West (Oregon), Asia Pacific (Tokyo), and Europe (Ireland). Also, in the preview period, Amazon GuardDuty RDS Protection is available to customers at no additional cost. If you are not using Amazon GuardDuty already, you can enable your <a href=\"/content/aws.amazon.com/live/en_US/guardduty/pricing.html\" target=\"_blank\" rel=\"noopener\">30-day GuardDuty free trial</a> with a single-click in the AWS Management console. To learn more, see <a href=\"https://docs.aws.amazon.com/guardduty/latest/ug/guardduty_finding-types-active.html\" target=\"_blank\" rel=\"noopener\">Amazon GuardDuty Findings</a>, and to receive programmatic updates on new Amazon GuardDuty features and threat detections, please subscribe to the <a href=\"https://docs.aws.amazon.com/guardduty/latest/ug/guardduty_sns.html\" target=\"_blank\" rel=\"noopener\">Amazon GuardDuty SNS topic</a>.</p>\r\n<p>Amazon Aurora is designed for high performance and availability at global scale with full MySQL and PostgreSQL compatibility. It provides built-in security, continuous backups, serverless compute, up to 15 read replicas, automated multi-Region replication, and integrations with other AWS services. To get started with Amazon Aurora, take a look at our <a href=\"https://docs.aws.amazon.com/AmazonRDS/latest/AuroraUserGuide/CHAP_GettingStartedAurora.html\" target=\"_blank\" rel=\"noopener\">getting started page</a>.</p>\r\n<p>To get started, see the following resources:</p>\r\n<ul>\r\n<li><a href=\"https://docs.aws.amazon.com/guardduty/latest/ug/rds-protection.html\" target=\"_blank\" rel=\"noopener\">Amazon GuardDuty RDS Protection User Guide documentation</a></li>\r\n<li><a href=\"https://docs.aws.amazon.com/AmazonRDS/latest/AuroraUserGuide/guard-duty-rds-protection.html\" target=\"_blank\" rel=\"noopener\">Monitoring threats with GuardDuty RDS Protection documentation</a></li>\r\n</ul>\r\n","modifiedDate":"2022-12-01T00:08:25Z","headlineUrl":"/about-aws/whats-new/2022/11/amazon-guardduty-rds-protection-preview/","postDateTime":"2022-11-30T13:00:00Z","postSummary":"<p><a href=\"/content/aws.amazon.com/live/en_US/guardduty.html\" target=\"_blank\" rel=\"noopener\">Amazon GuardDuty</a> now offers threat detection for <a href=\"/content/aws.amazon.com/live/en_US/rds/aurora.html\" target=\"_blank\" rel=\"noopener\">Amazon Aurora</a> to identify potential threats to data stored in Aurora databases. Amazon GuardDuty RDS Protection profiles and monitors access activity to existing and new databases in your account, and uses tailored machine learning models to accurately detect suspicious logins to Aurora databases. Once a potential threat is detected, GuardDuty generates a security finding that includes database details and rich contextual information on the suspicious activity, is integrated with Aurora for direct access to database events without requiring you to modify your databases, and is designed to not affect database performance. </p>\r\n","contentType":"Launch Announcement","headline":"Amazon GuardDuty RDS Protection now in preview"}
{"id":"whats-new#about-aws-whats-new-2022-11-amazon-sagemaker-jumpstart-enables-share-ml-artifacts-within-organization","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/amazon-sagemaker-jumpstart-enables-share-ml-artifacts-within-organization/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-30T18:42:32+0000","dateUpdated":"2022-11-30T22:07:34+0000","whats-new_general-products":"amazon-sagemaker-jumpstart","whats-new_year":"2022","whats-new_marketing-marchitecture":"artificial-intelligence","GLOBAL_content-type":"Launch Announcement","postBody":"<p>Many enterprises have multiple data science teams who build ML models and Jupyter notebooks and many artifacts could be leveraged by other science and operations teams to increase productivity; however, it is often challenging to share ML artifacts internally or setup the execution environment to take the models and notebooks into production. Starting today, Amazon SageMaker JumpStart helps you to more easily share ML artifacts, including notebooks and models, within your enterprise. You can add ML artifacts developed from SageMaker as well as those developed outside of SageMaker. Users within your organization can browse and select shared models to fine-tune, deploy endpoints, or execute notebooks directly in SageMaker JumpStart.</p>\r\n<p>The new ML artifact sharing capability within Amazon SageMaker JumpStart is available in all AWS regions where SageMaker JumpStart is supported. To learn more, refer to the <a href=\"https://aws.amazon.com/blogs/aws/new-share-ml-models-and-notebooks-more-easily-within-your-organization-with-amazon-sagemaker-jumpstart/\" target=\"_blank\" rel=\"noopener\">AWS News Blog</a> and <a href=\"https://docs.aws.amazon.com/sagemaker/latest/dg/studio-jumpstart.html\" target=\"_blank\" rel=\"noopener\">SageMaker JumpStart product documentation</a>.</p>\r\n","modifiedDate":"2022-11-30T22:06:41Z","headlineUrl":"/about-aws/whats-new/2022/11/amazon-sagemaker-jumpstart-enables-share-ml-artifacts-within-organization/","postDateTime":"2022-11-30T13:00:00Z","postSummary":"<p>Amazon SageMaker JumpStart now enables you to more easily share machine learning (ML) artifacts, including notebooks and models, across your organization to accelerate model building and deployment. Amazon SageMaker JumpStart is an ML hub that accelerates your ML journey with built-in algorithms and pretrained models from popular model hubs, such as Hugging Face, and end-to-end solutions that solve common use cases.</p>\r\n","contentType":"Launch Announcement","headline":"Amazon SageMaker JumpStart now enables you to more easily share ML artifacts within your organization"}
{"id":"whats-new#about-aws-whats-new-2022-11-aws-data-exchange-aws-lake-formation-preview","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/aws-data-exchange-aws-lake-formation-preview/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-12-01T00:13:20+0000","dateUpdated":"2022-12-01T01:33:34+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2022","whats-new_general-products":"aws-data-exchange","whats-new_marketing-marchitecture":"analytics","postBody":"<p>Once data subscribers are entitled to an AWS Data Exchange for AWS Lake Formation data set, they can quickly query, transform, and share access to the data within their AWS account using AWS Lake Formation or across their AWS Organization using AWS License Manager. Because the data appears within the Lake Formation catalog, subscribers can handle the discovery, access, and usage of third-party data in the same way they handle first-party data. By using AWS Data Exchange for AWS Lake Formation, data engineering teams can spend less time building and managing data pipelines, allowing them to get data to end users faster, helping to speed up time to insight for all data-dependent teams.&nbsp;</p>\r\n<p>AWS Data Exchange for AWS Lake Formation is available in the following <a href=\"/content/aws.amazon.com/live/en_US/about-aws/global-infrastructure/regional-product-services.html\" target=\"_blank\" rel=\"noopener\">AWS Regions</a>: US East (N. Virginia), US East (Ohio), US West (Northern California), US West (Oregon), Asia Pacific (Seoul), Asia Pacific (Singapore), Asia Pacific (Sydney), Asia Pacific (Tokyo), Europe (Frankfurt), Europe (Ireland), and Europe (London).</p>\r\n<p>To get started using AWS Data Exchange for AWS Lake Formation, subscribe to any of the products <a href=\"https://aws.amazon.com/marketplace/search/results?ref_=header_nav_dm_aws_data_exchange&amp;FULFILLMENT_OPTION_TYPE=DATA_EXCHANGE&amp;DATA_AVAILABLE_THROUGH=LAKE_FORMATION_DATA_PERMISSIONS&amp;filters=FULFILLMENT_OPTION_TYPE%2CDATA_AVAILABLE_THROUGH\" target=\"_blank\" rel=\"noopener\">here</a>. Learn more about how this feature can help expedite your time-to-value for third-party data <a href=\"/content/aws.amazon.com/live/en_US/data-exchange/why-aws-data-exchange/lake-formation.html\" target=\"_blank\" rel=\"noopener\">here</a>. To become a registered AWS Data Exchange data provider, please read <a href=\"https://docs.aws.amazon.com/data-exchange/latest/userguide/provider-getting-started.html\" target=\"_blank\" rel=\"noopener\">how to become a data provider</a>.&nbsp;<br>\r\n</p>\r\n","modifiedDate":"2022-12-01T01:32:41Z","headlineUrl":"/about-aws/whats-new/2022/11/aws-data-exchange-aws-lake-formation-preview/","postDateTime":"2022-11-30T08:00:00Z","postSummary":"<p>We are announcing the preview of AWS Data Exchange for AWS Lake Formation, a new feature that enables data subscribers to find and subscribe to third-party data sets that are managed directly through AWS Lake Formation. This feature is intended for data subscribers who want to easily integrate third-party data directly into their data lake as well as data providers who want to use AWS Lake Formation and AWS Data Exchange  to help streamline their data licensing operations.&nbsp;</p>\r\n","contentType":"Launch Announcement","headline":"Announcing AWS Data Exchange for AWS Lake Formation (Preview)"}
{"id":"whats-new#about-aws-whats-new-2022-11-amazon-sagemaker-studio-redesigned-user-interface","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/amazon-sagemaker-studio-redesigned-user-interface/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-30T17:36:40+0000","dateUpdated":"2022-11-30T22:07:24+0000","whats-new_year":"2022","whats-new_marketing-marchitecture":"artificial-intelligence","whats-new_general-products":"amazon-sagemaker-studio","GLOBAL_content-type":"Launch Announcement","postBody":"<p>This redesign includes a new navigation menu that highlights clear points of entry into each of SageMaker’s capabilities. The navigation experience is backed by an information architecture that mirrors the typical machine learning workflow to help users identify the right tools for the job. The navigation bar is collapsible at any time for users who want to take advantage of the full screen. The navigation menu items lead to new dynamic landing pages that provide handy links to tutorials and help content to get users started and a more expansive view of resources. Finally, the user interface also introduces a newly designed home page experience that includes one click access to common tasks and workflows, along with a redesigned launcher.</p>\r\n<p>This redesigned SageMaker Studio experience is now available in all AWS regions where Amazon SageMaker Studio is <a href=\"https://docs.aws.amazon.com/sagemaker/latest/dg/regions-quotas.html\" target=\"_blank\" rel=\"noopener\">available</a>. To learn more about SageMaker Studio, visit the <a href=\"https://docs.aws.amazon.com/sagemaker/latest/dg/studio-ui.html\" target=\"_blank\" rel=\"noopener\">SageMaker user guide</a>.</p>\r\n","modifiedDate":"2022-11-30T22:06:31Z","headlineUrl":"/about-aws/whats-new/2022/11/amazon-sagemaker-studio-redesigned-user-interface/","postDateTime":"2022-11-30T08:00:00Z","postSummary":"<p><a href=\"/content/aws.amazon.com/live/en_US/sagemaker/studio.html\" target=\"_blank\" rel=\"noopener\">Amazon SageMaker Studio</a> is an integrated development environment (IDE) that provides a single, web-based visual interface where users can access purpose-built tools to perform all machine learning (ML) development steps, from preparing data to building, training, and deploying ML models. Today, we are excited to announce a redesign that enhances the user experience by improving navigation, discoverability, and overall look and feel for SageMaker Studio.</p>\r\n","contentType":"Launch Announcement","headline":"Amazon SageMaker Studio launches redesigned user interface"}
{"id":"whats-new#about-aws-whats-new-2022-11-amazon-sagemaker-ready-software-products","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/amazon-sagemaker-ready-software-products/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-30T23:15:00+0000","dateUpdated":"2022-12-01T01:03:55+0000","whats-new_marketing-marchitecture":"artificial-intelligence","whats-new_general-products":"amazon-machine-learning","whats-new_year":"2022","GLOBAL_content-type":"Launch Announcement","postBody":"<p>Through the Amazon SageMaker Ready specialization, customers can confidently identify partner products that integrate with Amazon SageMaker and allow them to seamlessly execute use cases across the machine learning development lifecycle. The Amazon SageMaker Ready specialization recognizes AWS Partners that pass a high technical bar for their product integration with Amazon SageMaker with proven customer success.</p>\r\n<p>We are excited to introduce the AWS Partners who collaborated to develop and launch the new AWS specialization for Amazon SageMaker. Read our blog post here&nbsp;and learn more about <a href=\"/content/aws.amazon.com/live/en_US/sagemaker/partners.html\" target=\"_blank\" rel=\"noopener\">Amazon SageMaker Ready Products</a>.&nbsp;</p>\r\n","modifiedDate":"2022-12-01T01:03:06Z","headlineUrl":"/about-aws/whats-new/2022/11/amazon-sagemaker-ready-software-products/","postDateTime":"2022-11-30T08:00:00Z","postSummary":"<p>We are thrilled to announce the new <a href=\"/content/aws.amazon.com/live/en_US/sagemaker/partners.html\" target=\"_blank\" rel=\"noopener\">Amazon SageMaker Ready</a> specialization, which validates world-class AWS Partner software products that integrate with Amazon SageMaker and help customers build machine learning solutions. AWS Partners offerings in the specialization include Data Platforms, Data Pre-Processing &amp; Feature Stores, ML Frameworks, MLOps tools, and Business Decisions &amp; Applications. <a href=\"/content/aws.amazon.com/live/en_US/sagemaker.html\" target=\"_blank\" rel=\"noopener\">Amazon SageMake</a>r is a fully managed machine learning (ML) service that enables data scientists and developers to quickly build, train, and deploy ML models for any use case into a production-ready hosted environment.</p>\r\n","contentType":"Launch Announcement","headline":"Introducing Amazon SageMaker Ready Software Products"}
{"id":"whats-new#about-aws-whats-new-2022-11-aws-data-exchange-amazon-s3-preview","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/aws-data-exchange-amazon-s3-preview/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-12-01T00:13:20+0000","dateUpdated":"2022-12-01T01:40:47+0000","whats-new_marketing-marchitecture":"analytics","whats-new_general-products":"aws-data-exchange","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2022","postBody":"<p>Once data subscribers are entitled to an AWS Data Exchange for Amazon S3 data set, they can start their data analysis without having to set up their own S3 buckets, copy data files into those S3 buckets, or pay associated storage fees. Data analysis can be done with AWS services such as Amazon Athena, Amazon SageMaker Feature Store, or Amazon EMR. Subscribers access the same S3 objects that the data provider maintains and are therefore always using the most up-to-date data available, without additional engineering or operational work. Data providers can easily set up AWS Data Exchange for Amazon S3 (Preview) on top of their existing S3 buckets to share direct access to an entire S3 bucket or specific prefixes and S3 objects. After setup, AWS Data Exchange automatically manages subscriptions, entitlements, billing, and payment.<br>\r\n</p>\r\n<p>AWS Data Exchange for Amazon S3 (Preview) is available in all <a href=\"/content/aws.amazon.com/live/en_US/about-aws/global-infrastructure/regional-product-services.html\" target=\"_blank\" rel=\"noopener\">AWS Regions</a> where AWS Data Exchange is available today: US East (Ohio), US East (N. Virginia), US West (N. California), US West (Oregon), Asia Pacific (Seoul), Asia Pacific (Singapore), Asia Pacific (Sydney), Asia Pacific (Tokyo), Europe (Frankfurt), Europe (Ireland), and Europe (London).</p>\r\n<p>To get started, visit <a href=\"https://aws.amazon.com/marketplace/search/results?ref_=header_nav_dm_aws_data_exchange&amp;FULFILLMENT_OPTION_TYPE=DATA_EXCHANGE&amp;DATA_AVAILABLE_THROUGH=S3_DATA_ACCESSES&amp;filters=FULFILLMENT_OPTION_TYPE%2CDATA_AVAILABLE_THROUGH\" target=\"_blank\" rel=\"noopener\">AWS Data Exchange</a> to find AWS Data Exchange for Amazon S3 data products. Learn more about how customers can now find, subscribe to, and use third-party data files in a few clicks and without needing to create or manage copies <a href=\"/content/aws.amazon.com/live/en_US/data-exchange/why-aws-data-exchange/s3.html\" target=\"_blank\" rel=\"noopener\">here</a>. If you’re a registered data provider, you can learn more about offering in-place access to your S3 buckets in our <a href=\"https://docs.aws.amazon.com/data-exchange/latest/userguide/publishing-products.html#publish-s3-data-access-product\" target=\"_blank\" rel=\"noopener\">documentation</a>.&nbsp;If you’re not a registered data provider, you can become an AWS Data Exchange provider following these&nbsp;<a href=\"https://docs.aws.amazon.com/data-exchange/latest/userguide/provider-getting-started.html\" target=\"_blank\" rel=\"noopener\">steps</a>.<br>\r\n</p>\r\n","modifiedDate":"2022-12-01T01:39:06Z","headlineUrl":"/about-aws/whats-new/2022/11/aws-data-exchange-amazon-s3-preview/","postDateTime":"2022-11-30T08:00:00Z","postSummary":"<p>We are announcing the preview of AWS Data Exchange for Amazon S3, a new feature that enables data subscribers to access third-party data files directly from data providers’ Amazon Simple Storage Service (Amazon S3) buckets. This feature is intended for subscribers who want to easily use third-party data files for their data analysis with AWS services without needing to create or manage data copies, as well as data providers who want to offer in-place access to data hosted in their Amazon S3 buckets.<br>\r\n</p>\r\n","contentType":"Launch Announcement","headline":"Announcing AWS Data Exchange for Amazon S3 (Preview)"}
{"id":"whats-new#about-aws-whats-new-2022-11-aws-glue-data-quality-preview","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/aws-glue-data-quality-preview/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-30T17:55:10+0000","dateUpdated":"2022-11-30T22:07:24+0000","GLOBAL_content-type":"Launch Announcement","whats-new_general-products":"aws-glue","whats-new_marketing-marchitecture":"analytics","whats-new_year":"2022","postBody":"<p>AWS Glue Data Quality automatically analyzes your data to gather data statistics. It then recommends data quality rules to get started. You can update recommended rules or add new rules using provided data quality rules. If data quality deteriorates, you can then configure actions to alert users. Data quality rules and actions can also be configured on AWS Glue extract, transform, and load (ETL) jobs on data pipelines. These guidelines can prevent “bad” data from entering data lakes and data warehouses. AWS Glue is serverless, so there is no infrastructure to manage, and AWS Glue Data Quality uses open-source Deequ to evaluate rules. AWS uses Deequ to measure and monitor data quality of petabyte-scale data lakes.&nbsp;&nbsp;</p>\r\n<p>AWS Glue Data Quality is available in preview in the following <a href=\"/content/aws.amazon.com/live/en_US/about-aws/global-infrastructure/regional-product-services.html\" target=\"_blank\" rel=\"noopener\">AWS Regions</a>: US East (Ohio), US East (N. Virginia), US West (Oregon), Asia Pacific (Tokyo), and Europe (Ireland).</p>\r\n<p>To learn more, review the <a href=\"https://docs.aws.amazon.com/glue/latest/dg/glue-data-quality.html\" target=\"_blank\" rel=\"noopener\">AWS Glue Data Quality documentation</a> for data quality on data at rest, for <a href=\"https://docs.aws.amazon.com/glue/latest/ug/gs-data-quality-chapter.html\" target=\"_blank\" rel=\"noopener\">data quality in data pipelines</a>.<br>\r\n</p>\r\n","modifiedDate":"2022-11-30T22:06:36Z","headlineUrl":"/about-aws/whats-new/2022/11/aws-glue-data-quality-preview/","postDateTime":"2022-11-30T08:00:00Z","postSummary":"<p><a href=\"/content/aws.amazon.com/live/en_US/glue.html\" target=\"_blank\" rel=\"noopener\">AWS Glue&nbsp;</a>announces the preview of&nbsp;AWS Glue Data Quality, a new capability that automatically measures and monitors data lake and data pipeline quality. AWS Glue is a serverless, scalable data integration service that makes it more efficient to discover, prepare, move, and&nbsp;integrate data from multiple sources. Managing data quality is manual and time-consuming. You must set up data quality rules and validate your data against these rules on a recurring basis, also writing code to set up alerts when quality deteriorates. Analysts must manually analyze data, write rules,&nbsp;and then write code to implement these rules.&nbsp;</p>\r\n","contentType":"Launch Announcement","headline":"AWS Glue announces AWS Glue Data Quality (Preview)"}
{"id":"whats-new#about-aws-whats-new-2022-11-amazon-redshift-multi-az-preview-ra3-clusters","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/amazon-redshift-multi-az-preview-ra3-clusters/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-30T17:38:08+0000","dateUpdated":"2022-11-30T22:07:02+0000","GLOBAL_content-type":"Launch Announcement","postBody":"<p>A Redshift Multi-AZ deployment allows you to recover in case of AZ failures without any user intervention. A Redshift Multi-AZ deployment is accessed as a single data warehouse with one endpoint and helps you maximize your data warehouse performance by distributing workload processing across multiple AZs automatically. You are not required to make any application changes to maintain business continuity during unforeseen outages.&nbsp;</p>\r\n<p>Multi-AZ deployment for Amazon Redshift RA3 clusters is available in Preview, and you can use it in the following AWS Regions: US East (N. Virginia), US East (Ohio), US West (Oregon), Asia Pacific (Tokyo), Europe (Ireland) and Europe (Stockholm). To get started, you can provision an Amazon Redshift Multi-AZ deployment which will be automatically created on the PREVIEW_2022 track. Please note preview features are provided primarily for evaluation and testing purposes, and should not be used in production systems or with production data. For preview terms and conditions, see Beta Service Participation in <a href=\"/content/aws.amazon.com/live/en_US/service-terms.html\" target=\"_blank\" rel=\"noopener\">AWS Service Terms</a>.&nbsp;To learn more about Amazon Redshift Multi-AZ, see the <a href=\"/content/aws.amazon.com/live/en_US/redshift/reliability.html\" target=\"_blank\" rel=\"noopener\">Amazon Redshift Reliability page</a> and <a href=\"https://docs.aws.amazon.com/redshift/latest/mgmt/managing-cluster-multi-az.html\" target=\"_blank\" rel=\"noopener\">Amazon Multi-AZ documentation page</a>.</p>\r\n","modifiedDate":"2022-11-30T22:06:11Z","headlineUrl":"/about-aws/whats-new/2022/11/amazon-redshift-multi-az-preview-ra3-clusters/","postDateTime":"2022-11-30T08:00:00Z","postSummary":"<p>Amazon Redshift is introducing Multi-AZ deployments (Preview) that support running your data warehouse in multiple AWS Availability Zones (AZ) simultaneously and continue operating in unforeseen failure scenarios. A Multi-AZ deployment is intended for customers with business critical analytics applications that require the highest levels of availability and resiliency to AZ failures.&nbsp;</p>\r\n","contentType":"Launch Announcement","headline":"Amazon Redshift now supports Multi-AZ (Preview) for RA3 clusters "}
{"id":"whats-new#about-aws-whats-new-2022-11-sagemaker-data-wrangler-real-time-batch-inference-configurations-jobs","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/sagemaker-data-wrangler-real-time-batch-inference-configurations-jobs/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-30T18:26:12+0000","dateUpdated":"2022-11-30T22:07:16+0000","whats-new_year":"2022","GLOBAL_content-type":"Launch Announcement","whats-new_general-products":"amazon-machine-learning","postBody":"<p>Amazon SageMaker Data Wrangler reduces the time to rapidly prototype and deploy data processing workloads to production and easily integrates with CI/CD pipelines and MLOps production environments through SageMaker Processing APIs. When running and scheduling data processing workloads with Data Wrangler to prepare data to train ML models, customers asked to customize Spark memory and output partition settings for their data preparation workloads at scale. Next, once customers process their data and train a ML model, they need to deploy both the data transformation pipeline and ML model behind a SageMaker Endpoint for real-time inference and batch inference use-cases.  Customers then need to create data processing scripts from scratch to run the same data processing steps at inference that were applied when training the model, and once their model is deployed they need to ensure their training and deployment scripts are kept in sync.&nbsp;</p>\r\n<p>With this release, you can now easily configure Spark memory configurations and output partition format when running a Data Wrangler processing job to process data at scale. After preparing your data and training an ML model, you can now easily deploy your data transformation pipeline (also called a “data flow”) together with an ML model as part of a serial inference pipeline for both batch and real-time inference applications. You can also now register your Data Wrangler data flows with SageMaker Model Registry. You can begin deploying your Data Wrangler flow for real-time inference by clicking on “Export to &gt; Inference Pipeline (via Jupyter Notebook)&quot; from the Data Flow view in Data Wrangler. Spark memory settings can now be configured as part of the Create job workflow and partitions can be configured as part of the destination node settings.&nbsp;</p>\r\n<p>This feature is generally available in all <a href=\"/content/aws.amazon.com/live/en_US/about-aws/global-infrastructure/regional-product-services.html\" target=\"_blank\" rel=\"noopener\">AWS Regions</a> that Data Wrangler currently supports at no additional charge. To get started with SageMaker Data Wrangler read the <a href=\"http://aws.amazon.com/blogs/aws/new-introducing-support-for-real-time-and-batch-inference-in-amazon-sagemaker-data-wrangler\" target=\"_blank\" rel=\"noopener\">blog</a> and <a href=\"https://docs.aws.amazon.com/sagemaker/latest/dg/data-wrangler-data-export.html#data-wrangler-data-export-fit-transform\" target=\"_blank\" rel=\"noopener\">AWS documentation</a>.</p>\r\n","modifiedDate":"2022-11-30T22:06:26Z","headlineUrl":"/about-aws/whats-new/2022/11/sagemaker-data-wrangler-real-time-batch-inference-configurations-jobs/","postDateTime":"2022-11-30T08:00:00Z","postSummary":"<p>Today, we are excited to announce support for deploying data preparation flows created in Data Wrangler to real-time and batch serial inference pipelines, and additional configurations for Data Wrangler processing jobs in <a href=\"/content/aws.amazon.com/live/en_US/sagemaker/data-wrangler.html\" target=\"_blank\" rel=\"noopener\">Amazon SageMaker Data Wrangler</a>.&nbsp;</p>\r\n","contentType":"Launch Announcement","headline":"Deploy SageMaker Data Wrangler for real-time and batch inference and additional configurations to processing jobs"}
{"id":"whats-new#about-aws-whats-new-2022-11-amazon-sagemaker-shadow-testing","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/amazon-sagemaker-shadow-testing/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-30T18:42:54+0000","dateUpdated":"2022-11-30T22:07:02+0000","whats-new_general-products":"amazon-sagemaker","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2022","whats-new_marketing-marchitecture":"artificial-intelligence","postBody":"<p>Testing model updates involves sending a copy of the inference requests received by the production model to the new model and tracking how it performs. However, it can take several weeks of your time to build your own testing infrastructure, mirror inference requests, and compare how models perform. Amazon SageMaker enables you to evaluate a new ML model by testing its performance against the current deployed production model. Simply select the production model you want to test against, and SageMaker automatically deploys the new model for inference. SageMaker then routes a copy of the inference requests received by the production model to the new model and creates a live dashboard that shows performance differences across key metrics including latency and error rate in real time. Once you have reviewed the performance metrics and validated the model performance, you can quickly deploy the model in production.&nbsp;<br>\r\n</p>\r\n<p>To learn more, see <a href=\"/content/aws.amazon.com/live/en_US/sagemaker/shadow-testing.html\" target=\"_blank\" rel=\"noopener\">Amazon SageMaker shadow testing web page</a>. For pricing information, see <a href=\"/content/aws.amazon.com/live/en_US/sagemaker/pricing.html\" target=\"_blank\" rel=\"noopener\">Amazon SageMaker Pricing</a>. SageMaker support for shadow testing is generally available in all AWS regions where SageMaker inference is available except&nbsp;China (Beijing, operated by Sinnet), and China (Ningxia, operated by NWCD) and AWS GovCloud (US) Regions.<br>\r\n</p>\r\n<p>To get started, see the following list of resources:</p>\r\n<ul>\r\n<li><a href=\"/content/aws.amazon.com/live/en_US/sagemaker/shadow-testing.html\" target=\"_blank\" rel=\"noopener\">Amazon SageMaker shadow testing product detail page</a><br>\r\n</li>\r\n<li><a href=\"http://aws.amazon.com/blogs/aws/new-for-amazon-sagemaker-perform-shadow-tests-to-compare-inference-performance-between-ml-model-variants/\" target=\"_blank\" rel=\"noopener\">AWS news blog post</a></li>\r\n<li><a href=\"https://docs.aws.amazon.com/sagemaker/latest/dg/shadow-tests.html\" target=\"_blank\" rel=\"noopener\">Amazon SageMaker developer guide</a><br>\r\n</li>\r\n</ul>\r\n","modifiedDate":"2022-11-30T22:06:11Z","headlineUrl":"/about-aws/whats-new/2022/11/amazon-sagemaker-shadow-testing/","postDateTime":"2022-11-30T08:00:00Z","postSummary":"<p>Amazon SageMaker supports shadow testing to help you validate performance of new machine learning (ML) models by comparing them to production models. With shadow testing, you can spot potential configuration errors and performance issues before they impact end users. SageMaker eliminates weeks of time spent building infrastructure for shadow testing, so you can release models to production faster.<br>\r\n</p>\r\n","contentType":"Launch Announcement","headline":"Introducing Amazon SageMaker support for shadow testing"}
{"id":"whats-new#about-aws-whats-new-2022-11-launch-amazon-sagemaker-autopilot-experiments-sagemaker-pipelines-automate-mlops","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/launch-amazon-sagemaker-autopilot-experiments-sagemaker-pipelines-automate-mlops/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-30T18:42:43+0000","dateUpdated":"2022-11-30T22:07:45+0000","whats-new_year":"2022","GLOBAL_content-type":"Launch Announcement","whats-new_general-products":"amazon-sagemaker","whats-new_marketing-marchitecture":"compute","postBody":"<p>Starting today, you can add an automated training step (AutoMLStep) in SageMaker Pipelines and invoke a SageMaker Autopilot experiment&nbsp;with <a href=\"https://docs.aws.amazon.com/sagemaker/latest/dg/autopilot-model-support-validation.html\" target=\"_blank\" rel=\"noopener\">Ensemble training mode</a>.&nbsp;As an example, let’s consider building a training and evaluation ML workflow for a fraud detection use case with SageMaker Pipelines. You can now launch a SageMaker Autopilot experiment using the AutoML Step which will automatically run multiple trials to find the best model on a given input dataset. After the model package for the best model is created using the CreateModel step, its performance can be evaluated on test data using the Transform step within SageMaker Pipelines. Eventually, the model can be registered into the SageMaker Model Registry using the RegisterModel step.&nbsp;</p>\r\n<p>Native support for SageMaker Autopilot as a step within SageMaker Pipelines is now available in all regions where SageMaker Pipelines is available except Amazon Web Services China (Beijing) Region and Amazon Web Services China (Ningxia) Region. To learn more about SageMaker Pipelines and SageMaker Autopilot, visit the <a href=\"/content/aws.amazon.com/live/en_US/sagemaker/pipelines.html\" target=\"_blank\" rel=\"noopener\">SageMaker Pipelines product page</a> and <a href=\"/content/aws.amazon.com/live/en_US/sagemaker/autopilot.html\" target=\"_blank\" rel=\"noopener\">SageMaker Autopilot product page</a>.</p>\r\n","modifiedDate":"2022-11-30T22:06:51Z","headlineUrl":"/about-aws/whats-new/2022/11/launch-amazon-sagemaker-autopilot-experiments-sagemaker-pipelines-automate-mlops/","postDateTime":"2022-11-30T08:00:00Z","postSummary":"<p><a href=\"/content/aws.amazon.com/live/en_US/sagemaker/autopilot.html\" target=\"_blank\" rel=\"noopener\">Amazon SageMaker Autopilot</a>, a low-code machine learning (ML) service which automatically builds, trains, and tunes the best ML models based on your data, is now integrated with <a href=\"/content/aws.amazon.com/live/en_US/sagemaker/pipelines.html\" target=\"_blank\" rel=\"noopener\">Amazon SageMaker Pipelines</a>, the first purpose-built continuous integration and continuous delivery (CI/CD) service for ML. This enables the automation of an end-to-end flow of building ML models using SageMaker Autopilot and integrating models into subsequent CI/CD steps.</p>\r\n","contentType":"Launch Announcement","headline":"Launch Amazon SageMaker Autopilot experiments from Amazon SageMaker Pipelines to easily automate MLOps workflows"}
{"id":"whats-new#about-aws-whats-new-2022-11-amazon-sagemaker-studio-automatic-conversion-notebook-code-production-jobs","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/amazon-sagemaker-studio-automatic-conversion-notebook-code-production-jobs/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-30T18:43:45+0000","dateUpdated":"2022-11-30T22:07:35+0000","whats-new_general-products":"amazon-sagemaker-studio","whats-new_year":"2022","whats-new_marketing-industry":"artificial-intelligence","GLOBAL_content-type":"Launch Announcement","postBody":"<p>When data scientists and developers move their notebooks into production, they manually copy the snippets of code from notebook into a script, package the script with all its dependencies into a container, and then schedule the container to run as a job. In addition, if the job needs to be run on a schedule, they must set up, configure, and manage a continuous integration and continuous delivery (CI/CD) pipeline to automate their deployments. It can take weeks to get all the necessary infrastructure set up, which takes time away from core ML development activities. SageMaker Studio now lets ML practitioners select a notebook and automate it to run as a job in production with just few simple clicks, right from the Studio visual interface. Once a job is scheduled, SageMaker Studio automatically takes the snapshot of entire notebook, packages it along with its dependencies in a container, builds the infrastructure, runs the notebook as an automated job, and de-provisions the infrastructure upon job completion–reducing the time it takes to move a notebook to production from weeks to hours.  <br>\r\n</p>\r\n<p>This feature is generally available all AWS commercial regions where SageMaker Studio is available. To learn more, see this <a href=\"http://aws.amazon.com/blogs/aws/next-generation-sagemaker-notebooks-now-with-built-in-data-preparation-real-time-collaboration-and-notebook-automation\" target=\"_blank\" rel=\"noopener\">blog</a> and SageMaker Studio <a href=\"https://docs.aws.amazon.com/sagemaker/latest/dg/notebook-auto-run.html\" target=\"_blank\" rel=\"noopener\">developer guide</a>.<br>\r\n</p>\r\n","modifiedDate":"2022-11-30T22:06:41Z","headlineUrl":"/about-aws/whats-new/2022/11/amazon-sagemaker-studio-automatic-conversion-notebook-code-production-jobs/","postDateTime":"2022-11-30T08:00:00Z","postSummary":"<p><a href=\"/content/aws.amazon.com/live/en_US/sagemaker/studio.html\" target=\"_blank\" rel=\"noopener\">Amazon SageMaker Studio</a> is a fully integrated development environment (IDE) for machine learning (ML) that enables ML practitioners to perform every step of the machine learning workflow, from preparing data to building, training, tuning, and deploying models. Today, we're excited to announce a new capability in SageMaker Studio notebooks that enables automatic conversion of notebook code to production-ready jobs.<br>\r\n</p>\r\n","contentType":"Launch Announcement","headline":"Amazon SageMaker Studio now supports automatic conversion of notebook code to production-ready jobs"}
{"id":"whats-new#about-aws-whats-new-2022-11-amazon-s3-access-points-securely-delegate-permissions-datasets-aws-accounts","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/amazon-s3-access-points-securely-delegate-permissions-datasets-aws-accounts/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-30T23:14:26+0000","dateUpdated":"2022-12-01T01:04:06+0000","whats-new_marketing-marchitecture":"storage","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2022","whats-new_general-products":"amazon-s3","postBody":"<p>S3 Access Points help you more easily configure the right access controls for shared datasets, simplifying access management for multiple applications. Each access point has its own policy that defines which requests and VPCs are allowed to use the access point, customized for each application or use case. With cross-account access points, you can allow trusted accounts, such as the account administrator of a different team or a partner organization, to self-serve permissions for datasets. Additionally, you don't have to make continuous changes to a bucket policy for every permission change for applications or roles within these trusted accounts.&nbsp;</p>\r\n<p>Cross-account access points are available in all commercial <a href=\"/content/aws.amazon.com/live/en_US/about-aws/global-infrastructure/regional-product-services.html\" target=\"_blank\" rel=\"noopener\">AWS Regions</a> and the <a href=\"/content/aws.amazon.com/live/en_US/about-aws/global-infrastructure/regional-product-services.html\" target=\"_blank\" rel=\"noopener\">AWS GovCloud (US) Regions</a> via the AWS Command Line Interface (CLI) and AWS SDKs. To learn more about S3 Access Points, visit the <a href=\"https://docs.aws.amazon.com/AmazonS3/latest/userguide/access-points.html\" target=\"_blank\" rel=\"noopener\">S3 documentation,</a> <a href=\"/content/aws.amazon.com/live/en_US/s3/features/access-points.html\" target=\"_blank\" rel=\"noopener\">S3 Access Points product page</a>, and <a href=\"/content/aws.amazon.com/live/en_US/s3/faqs.html\" target=\"_blank\" rel=\"noopener\">S3 FAQs</a>.</p>\r\n","modifiedDate":"2022-12-01T01:03:17Z","headlineUrl":"/about-aws/whats-new/2022/11/amazon-s3-access-points-securely-delegate-permissions-datasets-aws-accounts/","postDateTime":"2022-11-30T08:00:00Z","postSummary":"<p>Amazon S3 Access Points simplify data access for any AWS service or customer application that stores data in S3 buckets. With S3 Access Points, you create unique access control policies for each access point to more easily control access to shared datasets. Now, bucket owners are able to authorize access via access points created in other accounts. In doing so, bucket owners always retain ultimate control over data access, but can delegate responsibility for more specific IAM-based access control decisions to the access point owner. This allows you to securely and easily share datasets with thousands of applications and users, and at no additional cost.</p>\r\n","contentType":"Launch Announcement","headline":"Amazon S3 Access Points can now be used to securely delegate access permissions for shared datasets to other AWS accounts"}
{"id":"whats-new#about-aws-whats-new-2022-11-amazon-redshift-data-sharing-centralized-access-control-lake-formation-preview","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/amazon-redshift-data-sharing-centralized-access-control-lake-formation-preview/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-30T17:55:10+0000","dateUpdated":"2022-11-30T22:06:54+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2022","whats-new_general-products":"amazon-redshift","whats-new_marketing-marchitecture":"analytics","postBody":"<p>With Lake Formation managed data sharing, you now have better visibility and control of data shared within and across accounts in your organization. Help improve the security of your data by enabling security administrators to use Lake Formation to manage granular entitlements such as table-level, column-level, or row-level access to tables being shared in Redshift data sharing and Redshift external tables. With AWS Lake Formation managed data sharing, you can define policies once and enforce those consistently for multiple consumers.<br>\r\n</p>\r\n<p>This feature is available as a preview in the following <a href=\"/content/aws.amazon.com/live/en_US/about-aws/global-infrastructure/regional-product-services.html\" target=\"_blank\" rel=\"noopener\">AWS Regions</a>: Asia Pacific (Tokyo), US East (Ohio), US East (N. Virginia), US West (Oregon), Europe (Ireland), Europe (Stockholm). To learn more, visit the Amazon Redshift database <a href=\"https://docs.aws.amazon.com/redshift/latest/dg/welcome.html\" target=\"_blank\" rel=\"noopener\">developer guide</a> and <a href=\"https://aws.amazon.com/blogs/big-data/centrally-manage-access-and-permissions-for-amazon-redshift-data-sharing-with-aws-lake-formation/\" target=\"_blank\" rel=\"noopener\">blog</a>.</p>\r\n","modifiedDate":"2022-11-30T22:06:01Z","headlineUrl":"/about-aws/whats-new/2022/11/amazon-redshift-data-sharing-centralized-access-control-lake-formation-preview/","postDateTime":"2022-11-30T08:00:00Z","postSummary":"<p>Amazon Redshift data sharing enables you to efficiently share live data across Amazon Redshift data&nbsp;warehouses. <a href=\"/content/aws.amazon.com/live/en_US/redshift.html\" target=\"_blank\" rel=\"noopener\">Amazon Redshift</a> now supports simplified governance of Amazon Redshift data sharing by enabling you to use <a href=\"/content/aws.amazon.com/live/en_US/lake-formation.html\" target=\"_blank\" rel=\"noopener\">AWS Lake Formation</a> to centrally manage permissions on data being shared across your organization. With the new Amazon Redshift data sharing managed by AWS Lake Formation, you can view, modify, and audit permissions on the tables and views in the Redshift datashares using Lake Formation APIs and the AWS Console, and allow the Redshift datashares to be discovered and consumed by other Redshift data warehouses.</p>\r\n","contentType":"Launch Announcement","headline":"Amazon Redshift data sharing now supports centralized access control with AWS Lake formation (Preview)"}
{"id":"whats-new#about-aws-whats-new-2022-11-amazon-sagemaker-geospatial-ml-preview","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/amazon-sagemaker-geospatial-ml-preview/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-30T17:37:58+0000","dateUpdated":"2022-11-30T22:07:16+0000","whats-new_year":"2022","whats-new_general-products":"amazon-sagemaker","whats-new_marketing-marchitecture":"artificial-intelligence","GLOBAL_content-type":"Launch Announcement","postBody":"<p>SageMaker’s new geospatial capabilities simplify the process of building, training, and deploying models with geospatial data. You can now access readily available geospatial data sources, efficiently process or enrich large-scale geospatial datasets with purpose-built operations, and accelerate model building by selecting pretrained ML models. You can then analyze and explore the generated predictions on an interactive map within SageMaker and share and collaborate on results. You can use SageMaker geospatial capabilities for a wide range of use cases, such as supporting sustainable urban development, maximizing harvest yield and food security, assessing risk and insurance claims, and predicting retail demand.</p>\r\n<p>Amazon SageMaker support for geospatial ML is now available in preview in the US West (Oregon) <a href=\"/content/aws.amazon.com/live/en_US/about-aws/global-infrastructure/regional-product-services.html\" target=\"_blank\" rel=\"noopener\">Region</a>.</p>\r\n<p>To learn more about geospatial ML capabilities, visit the <a href=\"/content/aws.amazon.com/live/en_US/sagemaker/geospatial.html\" target=\"_blank\" rel=\"noopener\">webpage</a>, view our <a href=\"https://docs.aws.amazon.com/sagemaker/latest/dg/geospatial.html\" target=\"_blank\" rel=\"noopener\">documentation</a>, or read our <a href=\"https://aws.amazon.com/blogs/aws/preview-use-amazon-sagemaker-to-build-train-and-deploy-ml-models-using-geospatial-data\" target=\"_blank\" rel=\"noopener\">blog post</a>.</p>\r\n","modifiedDate":"2022-11-30T22:06:26Z","headlineUrl":"/about-aws/whats-new/2022/11/amazon-sagemaker-geospatial-ml-preview/","postDateTime":"2022-11-30T08:00:00Z","postSummary":"<p>Amazon SageMaker now supports geospatial machine learning (ML),&nbsp;making it easier for data scientists and ML engineers to build, train, and deploy models using geospatial data.&nbsp;Today, the majority of all data generated contains geospatial information, but only a small fraction of it is used for ML because accessing, processing, and visualizing the data is complex, time consuming, and expensive.</p>\r\n","contentType":"Launch Announcement","headline":"Amazon SageMaker now supports geospatial ML (preview)"}
{"id":"whats-new#about-aws-whats-new-2022-11-amazon-redshift-supports-auto-copy-amazon-s3","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/amazon-redshift-supports-auto-copy-amazon-s3/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-30T18:26:29+0000","dateUpdated":"2022-11-30T22:07:05+0000","GLOBAL_content-type":"Launch Announcement","whats-new_marketing-marchitecture":"analytics","whats-new_year":"2022","whats-new_general-products":"amazon-redshift","postBody":"<p>Amazon Redshift customers run COPY statements to load data into their local tables from various data sources including Amazon S3. You can now store a COPY statement into a Copy Job, which automatically loads the new files detected in the specified Amazon S3 path. Copy Jobs track previously loaded files and exclude them from the ingestion process. Their activity can be monitored using the system tables. Copy Jobs can also be executed manually to reuse copy statements and prevent data duplication when automated loading is not needed.<br>\r\n</p>\r\n<p>The Redshift auto-copy support from Amazon S3 is available as a preview for provisioned clusters in the following <a href=\"/content/aws.amazon.com/live/en_US/about-aws/global-infrastructure/regional-product-services.html\" target=\"_blank\" rel=\"noopener\">AWS Regions</a>: US East (N. Virginia), US East (Ohio), US West (Oregon), Asia Pacific (Tokyo), Europe (Ireland) and Europe (Stockholm).&nbsp;</p>\r\n<p>To get started with this feature, visit the preview <a href=\"https://docs.aws.amazon.com/redshift/latest/dg/loading-data-copy-job.html\" target=\"_blank\" rel=\"noopener\">documentation</a>.</p>\r\n","modifiedDate":"2022-11-30T22:06:16Z","headlineUrl":"/about-aws/whats-new/2022/11/amazon-redshift-supports-auto-copy-amazon-s3/","postDateTime":"2022-11-30T08:00:00Z","postSummary":"<p><a href=\"/content/aws.amazon.com/live/en_US/redshift.html\" target=\"_blank\" rel=\"noopener\">Amazon Redshift</a> launches&nbsp;the preview of auto-copy support to simplify data loading from Amazon S3 into Amazon Redshift. You can now setup continuous file ingestion rules to track your Amazon S3 paths and automatically load new files without the need for additional tools or custom solutions.&nbsp;</p>\r\n","contentType":"Launch Announcement","headline":"Amazon Redshift now supports auto-copy from Amazon S3"}
{"id":"whats-new#about-aws-whats-new-2022-11-amazon-documentdb-mongodb-elastic-clusters-available","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/amazon-documentdb-mongodb-elastic-clusters-available/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-30T17:04:54+0000","dateUpdated":"2022-11-30T22:06:45+0000","GLOBAL_content-type":"Launch Announcement","whats-new_general-products":"aws-mongodb","whats-new_marketing-marchitecture":"databases","whats-new_year":"2022","postBody":"<p>With Amazon DocumentDB Elastic Clusters, you can leverage the MongoDB Sharding API to create scalable collections that can be petabytes in size. You can start with Amazon DocumentDB Elastic Clusters for their small applications and scale their clusters to handle millions of reads and writes per second, and PBs of storage capacity as their applications grow. Scaling Amazon DocumentDB Elastic Clusters is as simple as changing the number of cluster shards in the console and the rest is handled by the Amazon DocumentDB service, and can be as fast as minutes compared to hours when done manually. You can also scale down to save on cost at anytime.&nbsp;<br>\r\n</p>\r\n<p>Amazon DocumentDB Elastic Clusters provides many of the same management capabilities as Amazon DocumentDB instance-based clusters including Multi-AZ support, AWS CloudWatch integration, automated patching and snapshot back-ups.&nbsp;You can continue to use existing MongoDB tools and application drivers to work with Amazon DocumentDB Elastic Clusters. In addition to simple queries, you can also leverage powerful aggregation pipelines in Amazon DocumentDB Elastic Clusters to filter, group, process, and sort data across shards.<br>\r\n</p>\r\n<p>To learn more, read the <a href=\"https://docs.aws.amazon.com/documentdb/latest/developerguide/docdb-using-elastic-clusters.html\" target=\"_blank\" rel=\"noopener\">documentation</a>, and get started by creating an Amazon DocumentDB Elastic Clusters using only a few steps in the <a href=\"https://console.aws.amazon.com/console/home.\" target=\"_blank\" rel=\"noopener\">AWS Management Console</a>. For pricing and region availability, visit the <a href=\"/content/aws.amazon.com/live/en_US/documentdb/pricing.html\" target=\"_blank\" rel=\"noopener\">pricing page</a>.</p>\r\n","modifiedDate":"2022-11-30T22:05:55Z","headlineUrl":"/about-aws/whats-new/2022/11/amazon-documentdb-mongodb-elastic-clusters-available/","postDateTime":"2022-11-30T08:00:00Z","postSummary":"<p><a href=\"/content/aws.amazon.com/live/en_US/documentdb.html\" target=\"_blank\" rel=\"noopener\">Amazon DocumentDB (with MongoDB compatibility)</a> is announcing the general availability of Amazon DocumentDB Elastic Clusters, a new type of Amazon DocumentDB cluster that let’s you elastically scale your document database to handle millions of reads and writes per second with petabytes of storage.</p>\r\n","contentType":"Launch Announcement","headline":"Amazon DocumentDB (with MongoDB compatibility) Elastic Clusters is now generally available"}
{"id":"whats-new#about-aws-whats-new-2022-11-aws-marketplace-vendor-insights-streamline-vendor-risk-assessments","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/aws-marketplace-vendor-insights-streamline-vendor-risk-assessments/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-12-01T00:05:19+0000","dateUpdated":"2022-12-01T01:05:08+0000","whats-new_general-products":"aws-marketplace","GLOBAL_content-type":"Launch Announcement","whats-new_marketing-marchitecture":"management-and-governance","whats-new_year":"2022","postBody":"<p>After creating a security profile, sellers can grant customers access to an up-to-date dashboard with 125 common controls, which include automated updates of AWS-sourced evidence directly from the seller’s SaaS environments. Evidence in the dashboard includes AWS Config and AWS Audit Manager assessments, external audit reports like ISO27001 and SOC2 Type 2 stored in AWS Artifact third-party reports (Preview), and software vendor self-assessments. Buyers can review the dashboards within AWS Marketplace or download data and seller certificates to ingest into their own vendor management tools. </p>\r\n<p>Using Vendor Insights can help buyers reduce assessment lead time by allowing buyers to access the vendor’s validated security profile, saving months of effort from questionnaires and back-and-forth with vendors. Using Vendor Insights notifications also helps buyers remove the need for periodic reassessments. Vendor Insights provides ongoing visibility and alerts about the vendor’s security hygiene, such as if a compliance certification expires.</p>\r\n<p>Vendor Insights is available in all public AWS <a href=\"/content/aws.amazon.com/live/en_US/about-aws/global-infrastructure/regional-product-services.html\" target=\"_blank\" rel=\"noopener\">Regions where AWS Marketplace is available</a>.</p>\r\n<p>There is no charge for buyers to use Vendor Insights. You can access Vendor Insights during the procurement phase and for products procured in AWS Marketplace, however you lose access to Vendor Insights profiles if you have not procured the product after 60 days. For sellers, AWS Marketplace doesn’t charge to activate and use Vendor Insights. You will incur fees for using Audit Manager and AWS Config. For more pricing information, please visit the Vendor Insights <a href=\"/content/aws.amazon.com/live/en_US/marketplace/features/vendor-insights/pricing.html\" target=\"_blank\" rel=\"noopener\">pricing page</a>.</p>\r\n<p>Discover products with Vendor Insights profiles in <a href=\"https://aws.amazon.com/marketplace/search?VENDOR_INSIGHTS=SECURITY_PROFILES&amp;filters=VENDOR_INSIGHTS\" target=\"_blank\" rel=\"noopener\">AWS Marketplace</a>. To learn more, visit the <a href=\"/content/aws.amazon.com/live/en_US/marketplace/features/vendor-insights.html\" target=\"_blank\" rel=\"noopener\">AWS Marketplace Vendor Insights webpage</a>.</p>\r\n","modifiedDate":"2022-12-01T01:04:11Z","headlineUrl":"/about-aws/whats-new/2022/11/aws-marketplace-vendor-insights-streamline-vendor-risk-assessments/","postDateTime":"2022-11-30T06:00:00Z","postSummary":"<p>AWS Marketplace Vendor Insights is now generally available, helping customers and sellers streamline the complex third-party software risk assessment process by enabling sellers to make security and compliance information available in AWS Marketplace. A unified web-based dashboard gives governance, risk, and compliance (GRC) teams access to security and compliance information, such as data privacy and residency, application security, and access control. Vendor Insights serves buyers who need help to efficiently validate that third-party software meets their business compliance needs. Vendor Insights also serves sellers who want to showcase their strong security posture, while reducing the operational burden from responding to buyer requests for risk assessment information.</p>\r\n","contentType":"Launch Announcement","headline":"Announcing AWS Marketplace Vendor Insights to help streamline vendor risk assessments"}
