{"id":"whats-new#about-aws-whats-new-2022-12-announcing-amazon-codecatalyst-preview","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/12/announcing-amazon-codecatalyst-preview/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-12-01T17:34:24+0000","dateUpdated":"2022-12-01T19:18:22+0000","GLOBAL_content-type":"Launch Announcement","whats-new_marketing-marchitecture":"developer-tools","whats-new_year":"2022","postBody":"<p>You can use CodeCatalyst to browse a collection of project blueprints. Choose one to quickly set up your project using the right combination of technologies, architecture, infrastructure, and services. A project blueprint automatically provisions and configures your project tools—like an issue tracker or source repository—sets up CI/CD workflows that run on managed build infrastructure, and defines the architecture and configuration of AWS services used by the project. You can also replace the built-in source repository and issue tracker with GitHub or Jira Software while maintaining an integrated experience. Teams can automate consistent creation and configuration of shared deployment environments and individual cloud-based development environments. Team members can quickly access the same tools, resources, environments, and project state to collaborate more efficiently.</p>\r\n<p>Amazon CodeCatalyst is available in preview today in the <a href=\"/content/aws.amazon.com/live/en_US/about-aws/global-infrastructure/regional-product-services.html\" target=\"_blank\" rel=\"noopener\">AWS Region</a> of US West (Oregon), and you can use it to automate deployments to any AWS account and Region. </p>\r\n<p>To get started for free, see the following list of resources:</p>\r\n<ul>\r\n<li><a href=\"https://codecatalyst.aws/login\" target=\"_blank\" rel=\"noopener\">Amazon CodeCatalyst signup page</a></li>\r\n<li><a href=\"https://codecatalyst.aws/explore/pricing\" target=\"_blank\" rel=\"noopener\">Amazon CodeCatalyst pricing page</a></li>\r\n<li><a href=\"https://aws.amazon.com/blogs/aws/announcing-amazon-codecatalyst-preview-a-unified-software-development-service\" target=\"_blank\" rel=\"noopener\">Announcing CodeCatalyst (Preview) blog</a></li>\r\n<li><a href=\"https://codecatalyst.aws/explore?trk=78af2aee-7c28-4143-8481-8416bae5886f&amp;sc_channel=newsletter\" target=\"_blank\" rel=\"noopener\">Amazon CodeCatalyst overview</a></li>\r\n<li><a href=\"https://docs.aws.amazon.com/codecatalyst\" target=\"_blank\" rel=\"noopener\">Amazon CodeCatalyst documentation</a></li>\r\n</ul>\r\n","modifiedDate":"2022-12-01T19:17:26Z","headlineUrl":"/about-aws/whats-new/2022/12/announcing-amazon-codecatalyst-preview/","postDateTime":"2022-12-01T13:00:00Z","postSummary":"<p>Today, AWS is launching a preview of Amazon CodeCatalyst, a unified software development service that makes it faster to build and deliver software on AWS. CodeCatalyst provides software development teams with an integrated project experience that brings together the tools needed to plan, code, build, test, and deploy applications on AWS. Software teams spend significant time and resources on collaborating effectively and setting up tools, development and deployment environments, and continuous integration and delivery (CI/CD) automation. These activities can detract from their ability to quickly deliver new features or software updates to customers. With CodeCatalyst, teams can automate many of these complex activities, so they can focus on quickly enhancing their applications and deploying them to AWS. </p>\r\n","contentType":"Launch Announcement","headline":"Announcing Amazon CodeCatalyst (Preview)"}
{"id":"whats-new#about-aws-whats-new-2022-12-amazon-eventbridge-pipes-generally-available","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/12/amazon-eventbridge-pipes-generally-available/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-12-01T17:17:02+0000","dateUpdated":"2022-12-01T19:16:41+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2022","whats-new_general-products":"amazon-eventBridge","whats-new_marketing-marchitecture":"application-services","postBody":"<p>Creating a pipe is as simple as selecting a source and a target, and you can customize batching, starting position, concurrency, and more, if desired. An optional filtering step allows only specific source events to flow into the pipe and an optional enrichment step using AWS Lambda, AWS Step Functions, API Destinations, or Amazon API Gateway can be used to enrich or transform events before they reach the target. By removing the need to write, manage, and scale undifferentiated integration code, EventBridge Pipes allows you spend your time building your services rather than connecting them.</p>\r\n<p>Amazon EventBridge Pipes is available in the following regions: US East (Ohio and N. Virginia), US West (Oregon and N. California), Canada (Central), Europe (Paris, Stockholm, Ireland, Frankfurt, London, and Milan), Asia Pacific (Mumbai, Tokyo, Seoul, Singapore, Hong Kong, Osaka, Sydney and Jakarta), Middle East (Bahrain and UAE), Africa (Cape Town) and South America (São Paulo). </p>\r\n<p>To get started, read the <a href=\"https://aws.amazon.com/blogs/aws/new-create-point-to-point-integrations-between-event-producers-and-consumers-with-amazon-eventbridge-pipes/?trk=d0c467f8-ee69-4b7d-8e81-bc02ae25d111&amp;sc_channel=el\" target=\"_blank\" rel=\"noopener\">AWS News Blog post</a> on Pipes or click &quot;Pipes” in the <a href=\"https://console.aws.amazon.com/events/home?#/pipes\" target=\"_blank\" rel=\"noopener\">Amazon EventBridge console</a>.</p>\r\n","modifiedDate":"2022-12-01T19:15:36Z","headlineUrl":"/about-aws/whats-new/2022/12/amazon-eventbridge-pipes-generally-available/","postDateTime":"2022-12-01T13:00:00Z","postSummary":"<p>EventBridge Pipes provides a simpler, consistent, and cost-effective way to create point-to-point integrations between event producers and consumers, expanding the EventBridge offering beyond event buses and scheduling. EventBridge Pipes makes it easy to connect your applications with data from sources including Amazon SQS, Amazon Kinesis, Amazon DynamoDB, Amazon Managed Streaming Kafka, self-managed Kafka, and Amazon MQ. EventBridge Pipes supports the same target services as event buses, such as Amazon SQS, AWS Step Functions, Amazon Kinesis Data Streams, Amazon Kinesis Data Firehose, Amazon SNS, Amazon ECS, and event buses themselves.<br>\r\n</p>\r\n","contentType":"Launch Announcement","headline":"Amazon EventBridge Pipes is now generally available"}
{"id":"whats-new#about-aws-whats-new-2022-12-amazon-comprehend-support-classification-entity-exctraction-document-formats","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/12/amazon-comprehend-support-classification-entity-exctraction-document-formats/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-12-02T00:45:28+0000","dateUpdated":"2022-12-02T00:45:29+0000","whats-new_year":"2022","whats-new_marketing-marchitecture":"artificial-intelligence","whats-new_general-products":"amazon-comprehend","GLOBAL_content-type":"Launch Announcement","postBody":"<p>Amazon Comprehend is a Natural Language Processing (NLP) service that provides pre-trained and custom APIs to derive insights from textual data. The new capability simplifies document processing by adding support for common document types like PDF documents, Microsoft Word and images, in Amazon Comprehend Custom Classification and Custom Entity Recognition APIs. Previously, to process such documents, customers were required to pre-process and flatten documents into machine-readable text, which can reduce the quality of the document context. Now, with a single API call, customers can process both scanned or digital semi-structured documents (like PDFs, Microsoft Word documents, and images in their native format), and plain-text documents, eliminating pre-processing overhead. Customers can use the new capability to simplify document processing for batch processing or real-time use cases.</p>\r\n<p>Customer can process documents in the English language for contextual entity recognition and German (de), English (en), Spanish (es), French (fr), Italian (it), and Portuguese (pt) languages for document classification. These capabilities are available in all AWS regions where Amazon Comprehend is available. To learn more and get started, visit the <a href=\"/content/aws.amazon.com/live/en_US/comprehend/idp.html\" target=\"_blank\" rel=\"noopener\">Amazon Comprehend Intelligent Document Processing page,</a> <a href=\"http://aws.amazon.com/blogs/aws/now-process-pdfs-word-documents-and-images-with-amazon-comprehend-for-idp\" target=\"_blank\" rel=\"noopener\">AWS News Blog</a>, and our <a href=\"https://docs.aws.amazon.com/comprehend/latest/dg/idp.html\" target=\"_blank\" rel=\"noopener\">documentation</a>.</p>\r\n","modifiedDate":"2022-12-02T00:44:36Z","headlineUrl":"/about-aws/whats-new/2022/12/amazon-comprehend-support-classification-entity-exctraction-document-formats/","postDateTime":"2022-12-01T13:00:00Z","postSummary":"<p>Amazon Comprehend announced single-step APIs that customers can now use to classify and extract entities of interest from  PDF documents, Microsoft Word files, and images.</p>\r\n","contentType":"Launch Announcement","headline":"Amazon Comprehend announces support for classification and entity extraction directly from a variety of document formats"}
{"id":"whats-new#about-aws-whats-new-2022-12-aws-step-functions-large-scale-parallel-workflows-data-processing-serverless-applications","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/12/aws-step-functions-large-scale-parallel-workflows-data-processing-serverless-applications/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-12-01T17:17:13+0000","dateUpdated":"2022-12-01T19:57:52+0000","whats-new_general-products":"aws-step-functions","whats-new_marketing-marchitecture":"application-services","whats-new_year":"2022","GLOBAL_content-type":"Launch Announcement","postBody":"<p><a href=\"/content/aws.amazon.com/live/en_US/step-functions.html\" target=\"_blank\" rel=\"noopener\">AWS Step Functions</a> is a visual workflow service capable of orchestrating over 10,000 API actions from over 220 AWS services to automate business processes and data processing workloads.</p>\r\n<p>Now, AWS Step Functions can iterate over objects such as images or logs stored in Amazon S3, then launch and coordinate thousands of parallel workflows to process the data, and save the results of executions to Amazon S3. You can scale thousands of parallel workflow executions, running concurrently, with the new distributed mode of the Map state. You can use the distributed Map mode to analyze millions of log files for security risks, iterate terabytes of data for business insights or scan images, and video files for specific objects. To process your data, use compute services such as <a href=\"/content/aws.amazon.com/live/en_US/lambda.html\" target=\"_blank\" rel=\"noopener\">AWS Lambda</a> and write code in any language supported, or choose from over 220 purpose-built AWS services to accelerate your development. AWS Step Functions manages the concurrency and error thresholds, provides visibility into the progress of each individual workflow execution in a visual operator console, and gives you control over how faults and errors are handled.</p>\r\n<p>Start using the new distributed Map mode today in the console with <a href=\"https://console.aws.amazon.com/states/home?region=us-east-1#/statemachines\" target=\"_blank\" rel=\"noopener\">Workflow Studio</a>, <a href=\"/content/aws.amazon.com/live/en_US/cli.html\" target=\"_blank\" rel=\"noopener\">Command Line Interface (CLI)</a> or <a href=\"/content/aws.amazon.com/live/en_US/developer/tools.html\" target=\"_blank\" rel=\"noopener\">SDK</a>. To learn more, please see the AWS Step Functions <a href=\"https://docs.aws.amazon.com/step-functions/latest/dg/concepts-orchestrate-large-scale-parallel-workloads.html\" target=\"_blank\" rel=\"noopener\">developer guide</a> and the <a href=\"https://aws.amazon.com/blogs/aws/step-functions-distributed-map-a-serverless-solution-for-large-scale-parallel-data-processing/\" target=\"_blank\" rel=\"noopener\">launch blog</a>.</p>\r\n<p>AWS Step Functions’ distributed Map will be generally available in the following regions: US East (Ohio and N. Virginia), US West (Oregon), Canada (Central), Asia Pacific (Tokyo, Singapore and Sydney) and Europe (Ireland, Frankfurt and Stockholm). For a complete list of regions and service offerings, see <a href=\"/content/aws.amazon.com/live/en_US/about-aws/global-infrastructure/regional-product-services.html\" target=\"_blank\" rel=\"noopener\">AWS Regions</a>.&nbsp;</p>\r\n","modifiedDate":"2022-12-01T19:56:55Z","headlineUrl":"/about-aws/whats-new/2022/12/aws-step-functions-large-scale-parallel-workflows-data-processing-serverless-applications/","postDateTime":"2022-12-01T08:00:00Z","postSummary":"<p>AWS Step Functions expands support for iterating and processing large sets of data such as images, logs and financial data in <a href=\"/content/aws.amazon.com/live/en_US/s3.html\" target=\"_blank\" rel=\"noopener\">Amazon Simple Storage Service (Amazon S3)</a>, a cloud object storage service.&nbsp;</p>\r\n","contentType":"Launch Announcement","headline":"AWS Step Functions launches large-scale parallel workflows for data processing and serverless applications"}
{"id":"whats-new#about-aws-whats-new-2022-12-aws-repost-customers-community-engagement-builder-id-repost-linked-logins","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/12/aws-repost-customers-community-engagement-builder-id-repost-linked-logins/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-12-01T17:55:02+0000","dateUpdated":"2022-12-01T19:18:14+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2022","whats-new_general-products":"-aws-re-post","postBody":"<p>AWS Customers can now simultaneously build applications in the AWS Management Console and troubleshoot on re:Post with the community, without managing multiple login credentials. AWS enthusiasts that do not have an AWS account can now publish technical guidance and engage with community experts. Users that are signed on to re:Post using AWS Builder ID will have a seamless experience navigating between other AWS applications such as <a href=\"https://docs.aws.amazon.com/codecatalyst/latest/userguide/\" target=\"_blank\" rel=\"noopener\">CodeCatalyst</a> and <a href=\"/content/aws.amazon.com/live/en_US/codewhisperer.html\" target=\"_blank\" rel=\"noopener\">CodeWhisperer</a> without additional sign-in. <a href=\"https://repost.aws/account/signin\" target=\"_blank\" rel=\"noopener\">Join</a> the re:Post community and consolidate your contributions in one re:Post profile today.&nbsp;<br>\r\n</p>\r\n","modifiedDate":"2022-12-01T19:17:16Z","headlineUrl":"/about-aws/whats-new/2022/12/aws-repost-customers-community-engagement-builder-id-repost-linked-logins/","postDateTime":"2022-12-01T08:00:00Z","postSummary":"<p><a href=\"https://repost.aws/\" target=\"_blank\" rel=\"noopener\">AWS re:Post</a> is a cloud knowledge service that provides customers the technical guidance they need to innovate faster and improve operational efficiency with AWS services. re:Post has integrated with <a href=\"https://docs.aws.amazon.com/general/latest/gr/aws_builder_id.html\" target=\"_blank\" rel=\"noopener\">AWS Builder ID</a> to provide re:Post users an additional sign-in method to join the community without an AWS account. Additionally, users can <a href=\"https://repost.aws/dashboard/settings/logins\" target=\"_blank\" rel=\"noopener\">link</a> multiple logins with <a href=\"https://docs.aws.amazon.com/awsconsolehelpdocs/latest/gsg/learn-whats-new.html\" target=\"_blank\" rel=\"noopener\">AWS Management Console</a> or AWS Builder ID so that community contributions live in a single re:Post profile. re:Post integration with AWS Builder ID and the ability to link multiple logins to a single re:Post profile allow users to keep their contributions, points earned, and reputation status on re:Post, even if they transfer to a new role or organization.<br>\r\n</p>\r\n","contentType":"Launch Announcement","headline":"AWS re:Post streamlines customers’ community engagement with AWS Builder ID and re:Post Linked logins"}
{"id":"whats-new#about-aws-whats-new-2022-12-aws-application-composer-preview","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/12/aws-application-composer-preview/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-12-01T17:17:02+0000","dateUpdated":"2022-12-01T19:15:00+0000","whats-new_marketing-marchitecture":"developer-tools","whats-new_year":"2022","GLOBAL_content-type":"Launch Announcement","postBody":"<p>Developers new to building serverless applications can face a steep learning curve when composing applications from multiple AWS services. They need to understand how to configure each service, and then learn and write IaC to deploy their application. When making changes to an existing application, developers can find it difficult to communicate architectural changes with their teams by reading updates to large IaC definition files. With AWS Application Composer, you can start a new architecture from scratch, or you can import an existing AWS CloudFormation or AWS Serverless Application Model (SAM) template. You can add and connect AWS services, and AWS Application Composer helps generate deployment-ready projects, such as IaC definitions and AWS Lambda function code scaffolding. AWS Application Composer then maintains the visual representation of your application architecture in sync with your IaC, in real time.&nbsp;</p>\r\n<p>AWS Application Composer is available at no additional charge in the following <a href=\"/content/aws.amazon.com/live/en_US/about-aws/global-infrastructure/regional-product-services.html\" target=\"_blank\" rel=\"noopener\">AWS Regions</a>: US East (Ohio), US East (N. Virginia), US West (Oregon), Asia Pacific (Tokyo), Europe (Frankfurt), and Europe (Ireland). To get started visit the AWS Application Composer <a href=\"/content/aws.amazon.com/live/en_US/application-composer.html\" target=\"_blank\" rel=\"noopener\">product page</a>. To learn more, please see the <a href=\"https://aws.amazon.com/blogs/compute/visualize-and-create-your-serverless-workloads-with-aws-application-composer/\" target=\"_blank\" rel=\"noopener\">launch blog post</a>.<br>\r\n</p>\r\n","modifiedDate":"2022-12-01T19:14:01Z","headlineUrl":"/about-aws/whats-new/2022/12/aws-application-composer-preview/","postDateTime":"2022-12-01T08:00:00Z","postSummary":"<p>AWS Application Composer helps developers simplify and accelerate architecting, configuring, and building serverless applications. You can drag, drop, and connect AWS services into an&nbsp;application architecture by using AWS Application Composer’s browser-based visual canvas.&nbsp;AWS Application Composer helps you focus on building by maintaining deployment-ready infrastructure as code (IaC) definitions, complete with integration configuration for each service.</p>\r\n","contentType":"Launch Announcement","headline":"Introducing AWS Application Composer (Preview)"}
{"id":"whats-new#about-aws-whats-new-2022-12-amazon-gamelift-customer-managed-compute-gamelift-anywhere","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/12/amazon-gamelift-customer-managed-compute-gamelift-anywhere/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-12-01T17:54:56+0000","dateUpdated":"2022-12-01T19:18:04+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2022","postBody":"<p>Amazon GameLift is a fully managed solution that allows you to manage and scale dedicated game servers for session-based multiplayer games. With this new release, customers can now register and deploy any hardware, including their own local workstations, under a logical construct called an Anywhere Fleet.  Customers can use their Anywhere Fleet the same way as a managed Amazon Elastic Compute Cloud (Amazon EC2) Fleet by connecting to GameLift FlexMatch and Queue services in the cloud via API calls. Amazon GameLift Anywhere enables developers to iterate game builds faster and manage game sessions across any server hosting infrastructure under a single managed solution.   </p>\r\n<p>To learn more about GameLift Anywhere, see the following resources:<br>\r\n<span><br>\r\n</span></p>\r\n<ul>\r\n<li><span><a href=\"https://aws.amazon.com/blogs/aws/introducing-amazon-gamelift-anywhere-run-your-game-servers-on-your-own-infrastructure/\" target=\"_blank\" rel=\"noopener\">AWS News Blog</a></span></li>\r\n<li><a href=\"https://docs.aws.amazon.com/gamelift/latest/developerguide/fleets-creating-anywhere.html\" target=\"_blank\" rel=\"noopener\">Developer guide</a>&nbsp;</li>\r\n</ul>\r\n","modifiedDate":"2022-12-01T19:17:06Z","headlineUrl":"/about-aws/whats-new/2022/12/amazon-gamelift-customer-managed-compute-gamelift-anywhere/","postDateTime":"2022-12-01T08:00:00Z","postSummary":"<p>The general availability (GA) of Amazon GameLift Anywhere de-couples game session management from the underlying compute resources. During the game development phase, developers need instant compute resources to deploy, test and iterate their game builds continuously. In addition, customers often have ongoing bare-metal contracts or on-premises game servers and need the flexibility to use their existing infrastructure with cloud servers. </p>\r\n","contentType":"Launch Announcement","headline":"Amazon GameLift now supports customer-managed compute with GameLift Anywhere"}
