{"id":"whats-new#about-aws-whats-new-2022-11-aws-announces-amazon-vpc-lattice-preview","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/aws-announces-amazon-vpc-lattice-preview/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-30T00:19:41+0000","dateUpdated":"2022-11-30T01:24:35+0000","whats-new_general-products":"amazon-vpc","whats-new_marketing-marchitecture":"networking","whats-new_year":"2022","GLOBAL_content-type":"Launch Announcement","postBody":"<p>VPC Lattice handles common tasks required for service-to-service communication such as service discovery, request level routing and load balancing, authentication, authorization, and generates detailed metrics and logs to give you visibility into how your service is performing. In addition, Amazon VPC Lattice is a fully managed service, removing the need to install and manage additional infrastructure, such as host-based agents or sidecar proxies, making it easier to connect your new and existing applications.<br>\r\n</p>\r\n<p>During the preview, Amazon VPC Lattice is available in the US West (Oregon) Region. To preview Amazon VPC Lattice, see the <a href=\"https://pages.awscloud.com/AmazonVPCLattice-Preview.html\" target=\"_blank\" rel=\"noopener\">sign-up page</a>.<br>\r\n</p>\r\n<p>For more information, visit the <a href=\"/content/aws.amazon.com/live/en_US/vpc/lattice.html\" target=\"_blank\" rel=\"noopener\">Amazon VPC Lattice product detail page</a>, and read the introductory <a href=\"https://aws.amazon.com/blogs/aws/introducing-vpc-lattice-simplify-networking-for-service-to-service-communication-preview/\" target=\"_blank\" rel=\"noopener\">blog</a>. For details on pricing, explore the <a href=\"/content/aws.amazon.com/live/en_US/vpc/lattice/pricing.html\" target=\"_blank\" rel=\"noopener\">pricing page</a>.</p>\r\n","modifiedDate":"2022-11-30T01:23:41Z","headlineUrl":"/about-aws/whats-new/2022/11/aws-announces-amazon-vpc-lattice-preview/","postDateTime":"2022-11-29T13:00:00Z","postSummary":"<p>Today, AWS announces the preview of Amazon VPC Lattice, an application layer networking service that makes it simple to connect, secure, and monitor service-to-service communication. You can use VPC Lattice to enable cross-account, cross-VPC connectivity, and application layer load balancing for your workloads in a consistent way regardless of the underlying compute type – instances, containers, and serverless.&nbsp;<br>\r\n</p>\r\n","contentType":"Launch Announcement","headline":"AWS announces Amazon VPC Lattice (Preview)"}
{"id":"whats-new#about-aws-whats-new-2022-11-aws-announces-amazon-ec2-inf2-instances-preview","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/aws-announces-amazon-ec2-inf2-instances-preview/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-29T17:52:42+0000","dateUpdated":"2022-11-29T21:25:52+0000","whats-new_marketing-marchitecture":"compute","whats-new_year":"2022","GLOBAL_content-type":"Launch Announcement","whats-new_general-products":"amazon-ec2","postBody":"<p>You can use Inf2 instances to run DL applications for natural language understanding, translation, video and image generation, speech recognition, personalization, and more. They are optimized to deploy complex models, such as large language models (LLM) and vision transformers, at scale while also improving the Inf1 instances’ price-performance benefits for smaller models. To support ultra-large 100B+ parameter models, Inf2 instances are the first inference-optimized instances in Amazon EC2 to support scale-out distributed inference with ultra-high-speed connectivity between accelerators. </p>\r\n<p>Inf2 instances offer up to 2.3 petaflops of DL performance, up to 384 GB of accelerator memory with 9.8 TB/s bandwidth, and NeuronLink, an intra-instance ultra-high-speed, nonblocking interconnect. Inf2 instances also offer up to 50% better performance per watt compared to GPU-based instances in Amazon EC2 and help you meet your sustainability goals.The AWS Neuron SDK is natively integrated with popular ML frameworks, such as PyTorch and TensorFlow, so you can deploy your DL applications on Inf2 with a few lines of code.&nbsp;&nbsp;</p>\r\n<p>To learn more and sign up for a preview of the Inf2 instances, see the <a href=\"/content/aws.amazon.com/live/en_US/ec2/instance-types/inf2.html\" target=\"_blank\" rel=\"noopener\">Inf2 product detail page</a>.</p>\r\n","modifiedDate":"2022-11-29T21:24:56Z","headlineUrl":"/about-aws/whats-new/2022/11/aws-announces-amazon-ec2-inf2-instances-preview/","postDateTime":"2022-11-29T13:00:00Z","postSummary":"<p>Today, AWS announces the preview of Amazon Elastic Compute Cloud (Amazon EC2) Inf2 instances, which are designed to deliver high performance at the lowest cost in Amazon EC2 for the most demanding deep learning (DL) inference applications. Inf2 instances are powered by up to 12 AWS Inferentia2, the third AWS-designed DL accelerator.&nbsp;Inf2 instances offer 3x higher compute performance, up to 4x higher throughput, and up to 10x lower latency compared to Inf1 instances.</p>\r\n","contentType":"Launch Announcement","headline":"AWS announces Amazon EC2 Inf2 instances (Preview)"}
{"id":"whats-new#about-aws-whats-new-2022-11-amazon-redshift-integration-apache-spark-amazon-emr","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/amazon-redshift-integration-apache-spark-amazon-emr/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-29T17:17:10+0000","dateUpdated":"2022-11-29T21:25:20+0000","whats-new_general-products":"amazon-redshift","whats-new_year":"2022","GLOBAL_content-type":"Launch Announcement","whats-new_marketing-marchitecture":"analytics","postBody":"<p>You can use this integration to build applications that directly write to Redshift tables as a part of your ETL workflows or to combine data in Redshift with data in other source. Developers can load data from Redshift tables to Spark data frames or write data to Redshift tables. Developers don’t have to worry about downloading open source connectors to connect to Redshift.</p>\r\n<p>Amazon Redshift integration for Apache Spark enables applications on Amazon EMR that access Redshift data to run up to 10x faster compared to existing Redshift-Spark connectors. It supports pushing down relational operations such as joins, aggregations, sort and scalar functions from Spark to Redshift to improve your query performance. It supports IAM-based roles to enable single sign on capabilities and integrates with AWS Secrets Manager for securely managing keys.</p>\r\n<p><a href=\"/content/aws.amazon.com/live/en_US/redshift.html\" target=\"_blank\" rel=\"noopener\">Amazon Redshift</a> integration for Apache Spark is available in all regions where Amazon EMR, Amazon EMR on EKS and Amazon Serverless are available. To get started, refer to our documentation for <a href=\"https://docs.aws.amazon.com/emr/latest/EMR-Serverless-UserGuide/emr-spark-redshift.html\" target=\"_blank\" rel=\"noopener\">Amazon EMR</a>, <a href=\"https://docs.aws.amazon.com/emr/latest/EMR-on-EKS-DevelopmentGuide/emr-spark-redshift.html\" target=\"_blank\" rel=\"noopener\">Amazon EMR on EKS</a> and <a href=\"https://docs.aws.amazon.com/emr/latest/EMR-Serverless-UserGuide/emr-spark-redshift.html\" target=\"_blank\" rel=\"noopener\">Amazon EMR Serverless</a>.</p>\r\n","modifiedDate":"2022-11-29T21:24:29Z","headlineUrl":"/about-aws/whats-new/2022/11/amazon-redshift-integration-apache-spark-amazon-emr/","postDateTime":"2022-11-29T13:00:00Z","postSummary":"<p><a href=\"/content/aws.amazon.com/live/en_US/emr.html\" target=\"_blank\" rel=\"noopener\">Amazon EMR</a> announces <a href=\"/content/aws.amazon.com/live/en_US/redshift.html\" target=\"_blank\" rel=\"noopener\">Amazon Redshift</a> integration with Apache Spark. This integration helps data engineers build and run Spark applications that can consume and write data from an Amazon Redshift cluster. Starting with Amazon EMR 6.9, this integration is available across all three deployment models for EMR - EC2, EKS, and Serverless.</p>\r\n","contentType":"Launch Announcement","headline":"Announcing Amazon Redshift integration for Apache Spark with Amazon EMR"}
{"id":"whats-new#about-aws-whats-new-2022-11-announcing-amazon-opensearch-serverless-preview","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/announcing-amazon-opensearch-serverless-preview/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-29T17:00:15+0000","dateUpdated":"2022-11-29T21:25:53+0000","whats-new_year":"2022","whats-new_general-products":"amazon-opensearch-service","whats-new_marketing-marchitecture":"serverless","GLOBAL_content-type":"Launch Announcement","postBody":"<p>OpenSearch Serverless decouples compute and storage and separates the indexing (ingest) components from the search (query) components, with Amazon Simple Storage Service (Amazon S3) as the primary data storage for indexes. With this decoupled architecture, OpenSearch Serverless can scale search and indexing functions independently of each other, and independently of the indexed data in Amazon S3. For example, when an application-monitoring workload receives a sudden burst of logging activities during an availability event, OpenSearch Serverless instantly scales the resources to ingest and store the data without impacting query response times.  </p>\r\n<p>To get started with OpenSearch Serverless, developers can create new collections, a logical grouping of indexed data that works together to support a workload. OpenSearch Serverless supports the same ingest and query APIs as <a href=\"https://opensearch.org/\" target=\"_blank\" rel=\"noopener\">OpenSearch</a>, so you can get started in seconds with your existing clients and applications—all while building data visualizations with serverless <a href=\"https://opensearch.org/docs/2.0/dashboards/index/\" target=\"_blank\" rel=\"noopener\">OpenSearch Dashboards</a>. </p>\r\n<p>OpenSearch Serverless is now available in the following <a href=\"/content/aws.amazon.com/live/en_US/about-aws/global-infrastructure/regional-product-services.html\" target=\"_blank\" rel=\"noopener\">AWS Regions</a>: US East (Ohio), US East (N. Virginia), US West (Oregon), Asia Pacific (Tokyo), and Europe (Ireland).<br>\r\n</p>\r\n<p>To learn more, see the <a href=\"/content/aws.amazon.com/live/en_US/opensearch-service/features/serverless.html\">Amazon OpenSearch Serverless</a> webpage and the <a href=\"https://docs.aws.amazon.com/opensearch-service/latest/developerguide/serverless.html\" target=\"_blank\" rel=\"noopener\">Amazon OpenSearch Service Developer Guide</a>.</p>\r\n","modifiedDate":"2022-11-29T21:25:01Z","headlineUrl":"/about-aws/whats-new/2022/11/announcing-amazon-opensearch-serverless-preview/","postDateTime":"2022-11-29T13:00:00Z","postSummary":"<p><a href=\"/content/aws.amazon.com/live/en_US/opensearch-service.html\" target=\"_blank\" rel=\"noopener\">Amazon OpenSearch Service</a> now offers a new serverless option, <a href=\"/content/aws.amazon.com/live/en_US/opensearch-service/features/serverless.html\" target=\"_blank\" rel=\"noopener\">Amazon OpenSearch Serverless</a>. This option simplifies the process of running petabyte-scale search and analytics workloads without having to configure, manage, or scale OpenSearch clusters. OpenSearch Serverless automatically provisions and scales the underlying resources to deliver fast data ingestion and query responses for even the most demanding and unpredictable workloads. With OpenSearch Serverless, you pay only for the resources consumed.</p>\r\n","contentType":"Launch Announcement","headline":"Announcing Amazon OpenSearch Serverless (Preview)"}
{"id":"whats-new#about-aws-whats-new-2022-11-aws-announces-torn-write-prevention-ec2-i4i-instances-ebs-amazon-rds","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/aws-announces-torn-write-prevention-ec2-i4i-instances-ebs-amazon-rds/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-29T17:53:59+0000","dateUpdated":"2022-11-29T21:25:31+0000","GLOBAL_content-type":"Launch Announcement","whats-new_general-products":"amazon-elastic-block-store","whats-new_marketing-marchitecture":"databases","whats-new_year":"2022","postBody":"<p>TWP enables customers running databases such as MySQL or MariaDB on EC2, EBS, and managed services like Amazon RDS, to turn off the double write operation, thereby accelerating database performance Transactions per Second (TPS) by up to 30% without compromising the resiliency of their workloads. With additional performance unlocked, customers can now support their business growth without having to over provision or scale up their clusters, saving cost. For Amazon RDS users, Amazon RDS Optimized Writes uses TWP’s technology to improve write transaction throughput by up to 2x for RDS for MySQL customers at no additional cost.&nbsp;<br>\r\n</p>\r\n<p>For customers using AWS EC2 I4i instances, they can use TWP in those regions where I4i instance is available. For customers with EBS volumes attached to Nitro instances, TWP is available in US East (N. Virginia), US West (Oregon), Europe (Ireland), and Asia Pacific (Sydney, Tokyo) with support for more regions coming soon. For more information on Amazon EC2 storage optimized instances, <a href=\"/content/aws.amazon.com/live/en_US/ec2/instance-types.html\" target=\"_blank\" rel=\"noopener\">visit here</a>. For more information on Amazon EBS, <a href=\"/content/aws.amazon.com/live/en_US/ebs.html\" target=\"_blank\" rel=\"noopener\">visit here</a>. For more information on Amazon RDS Optimized Writes, <a href=\"/content/aws.amazon.com/live/en_US/about-aws/whats-new/2022/11/amazon-rds-optimized-writes-2x-higher-write-throughput-no-cost.html\" target=\"_blank\" rel=\"noopener\">visit here</a>. For more information on how to use TWP,&nbsp;see our <a href=\"https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/storage-twp.html\" target=\"_blank\" rel=\"noopener\">documentation</a>.</p>\r\n","modifiedDate":"2022-11-29T21:24:36Z","headlineUrl":"/about-aws/whats-new/2022/11/aws-announces-torn-write-prevention-ec2-i4i-instances-ebs-amazon-rds/","postDateTime":"2022-11-29T13:00:00Z","postSummary":"<p>Torn Write Prevention (TWP) is a feature that ensures 16KiB write operations are not torn in the event of operating system crashes or power loss during write transactions. This feature is available for AWS customers using instance store on AWS Nitro SSD&nbsp;based <a href=\"/content/aws.amazon.com/live/en_US/ec2.html\" target=\"_blank\" rel=\"noopener\">EC2</a> I4i storage optimized instances, <a href=\"/content/aws.amazon.com/live/en_US/ebs.html\" target=\"_blank\" rel=\"noopener\">Amazon Elastic Block Store</a> (EBS), a block storage service, when attached to all EC2 Nitro-based instances, and <a href=\"/content/aws.amazon.com/live/en_US/rds.html\" target=\"_blank\" rel=\"noopener\">Amazon Relational Database Services</a> (RDS), a fully managed, open-source cloud database.</p>\r\n","contentType":"Launch Announcement","headline":"AWS Announces Torn Write Prevention for EC2 I4i instances, EBS, and Amazon RDS"}
{"id":"whats-new#about-aws-whats-new-2022-11-contact-lens-amazon-connect-provides-conversational-analytics-chat","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/contact-lens-amazon-connect-provides-conversational-analytics-chat/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-29T18:25:54+0000","dateUpdated":"2022-11-29T21:25:52+0000","whats-new_year":"2022","whats-new_marketing-marchitecture":"analytics","GLOBAL_content-type":"Launch Announcement","whats-new_general-products":"amazon-connect","postBody":"<p>With Contact Lens’ conversational analytics for chat, businesses can identify contacts where customers had issues based on specific keywords, sentiment score, contact categories, and agent response time. Contact Lens also provides chat summarization, a capability that uses machine learning to classify key parts of the customer’s conversation (e.g. issue, outcome, or action item) and enables businesses to dive deep into specific sections of the chat transcript. Contact Lens’ conversational analytics for chat can also detect and redact sensitive customer information (e.g., name, credit card details, social security number, etc.) from chat transcripts and provide access to both redacted and unredacted chat transcripts.&nbsp;<br>\r\n</p>\r\n<p>Contact Lens’ conversational analytics for chat is currently available for post-chat use cases and is supported in all the <a href=\"https://docs.aws.amazon.com/general/latest/gr/connect_region.html\" target=\"_blank\" rel=\"noopener\">AWS Regions</a> where Contact Lens’ conversational analytics&nbsp;for voice is already available.&nbsp;</p>\r\n<p>To get started, please see our <a href=\"https://docs.aws.amazon.com/connect/latest/adminguide/analyze-conversations.html\" target=\"_blank\" rel=\"noopener\">help documentation</a> or visit our <a href=\"/content/aws.amazon.com/live/en_US/connect/contact-lens.html\" target=\"_blank\" rel=\"noopener\">webpage</a>. For information about pricing, please visit our <a href=\"/content/aws.amazon.com/live/en_US/connect/pricing.html\" target=\"_blank\" rel=\"noopener\">Contact Lens pricing page</a> for more details. <br>\r\n</p>\r\n","modifiedDate":"2022-11-29T21:24:56Z","headlineUrl":"/about-aws/whats-new/2022/11/contact-lens-amazon-connect-provides-conversational-analytics-chat/","postDateTime":"2022-11-29T13:00:00Z","postSummary":"<p><a href=\"/content/aws.amazon.com/live/en_US/connect/contact-lens.html\" target=\"_blank\" rel=\"noopener\">Contact Lens for Amazon Connect</a> now provides conversational analytics capabilities for <a href=\"https://docs.aws.amazon.com/connect/latest/adminguide/chat.html\" target=\"_blank\" rel=\"noopener\">Amazon Connect Chat</a>, extending&nbsp;the machine learning powered analytics to better assess chat contacts. These capabilities enable businesses to understand customer sentiment in both agent and chatbot conversations, redact sensitive customer information, and monitor agent compliance with company guidelines to help improve agent performance and customer experience.&nbsp;</p>\r\n","contentType":"Launch Announcement","headline":"Contact Lens for Amazon Connect now provides conversational analytics for chat"}
{"id":"whats-new#about-aws-whats-new-2022-11-amazon-kinesis-data-firehose-support-data-stream-delivery-opensearch-serverless","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/amazon-kinesis-data-firehose-support-data-stream-delivery-opensearch-serverless/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-30T00:13:34+0000","dateUpdated":"2022-11-30T01:12:09+0000","GLOBAL_content-type":"Launch Announcement","whats-new_marketing-marchitecture":"serverless","whats-new_general-products":"amazon-opensearch-service","whats-new_year":"2022","postBody":"<p>OpenSearch Serverless is a new serverless option offered by <a href=\"/content/aws.amazon.com/live/en_US/opensearch-service.html\" target=\"_blank\" rel=\"noopener\">Amazon OpenSearch Service</a>. OpenSearch Serverless makes it simple to run petabyte scale search and analytics workloads without having to configure, manage, or scale OpenSearch clusters. OpenSearch Serverless automatically provisions and scales the underlying resources to deliver fast data ingestion and query responses for even the most demanding and unpredictable workloads.</p>\r\n<p>To get started, you need an AWS account. Once you have an account, you can create a delivery stream in the <a href=\"https://console.aws.amazon.com/firehose\" target=\"_blank\" rel=\"noopener\">Amazon Kinesis Console</a>. To learn more, explore the Amazon Kinesis Data Firehose <a href=\"https://docs.aws.amazon.com/firehose/latest/dev/what-is-this-service.html\" target=\"_blank\" rel=\"noopener\">developer guide</a>.</p>\r\n","modifiedDate":"2022-11-30T01:11:10Z","headlineUrl":"/about-aws/whats-new/2022/11/amazon-kinesis-data-firehose-support-data-stream-delivery-opensearch-serverless/","postDateTime":"2022-11-29T13:00:00Z","postSummary":"<p><a href=\"/content/aws.amazon.com/live/en_US/kinesis/data-firehose.html\" target=\"_blank\" rel=\"noopener\">Amazon Kinesis Data Firehose</a> can now deliver streaming data to an <a href=\"/content/aws.amazon.com/live/en_US/opensearch-service/features/serverless.html\" target=\"_blank\" rel=\"noopener\">Amazon OpenSearch Serverless</a>. With few clicks, you can easily ingest, transform, and reliably deliver streaming data into an Amazon OpenSearch Serverless without building and managing your own data ingestion and delivery infrastructure. Kinesis Data Firehose is a fully managed service that automatically scales to match the throughput of your data and without ongoing administration.</p>\r\n","contentType":"Launch Announcement","headline":"Amazon Kinesis Data Firehose adds support for data stream delivery to Amazon OpenSearch Serverless"}
{"id":"whats-new#about-aws-whats-new-2022-11-amazon-quicksight-q-supports-automated-data-preparation","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/amazon-quicksight-q-supports-automated-data-preparation/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-30T00:17:48+0000","dateUpdated":"2022-11-30T00:17:49+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2022","whats-new_general-products":"amazon-quicksight","whats-new_marketing-marchitecture":"analytics","postBody":"<p>Automated data preparation for QuickSight Q saves authors time by automatically selecting fields, classifying dimensions and measures, creating name labels, and applying column value formats. It also enriches topics with related synonyms for fields, semantic type, and default date information, improving the ability of QuickSight Q to match results to users’ intent out of the box.  A new step-by-step workflow explains how topics work and gives tips to improve results. Authors can now quickly create topics directly from analysis. Adding convenience, QuickSight Q automatically presents the topic above the dashboard in the QuickSight Q bar. Authors can also now add QuickSight Q results to analysis, facilitating quick creation of visuals using natural language.</p>\r\n<p>QuickSight Q is available in the following AWS Regions: US East (Ohio), US East (N. Virginia), US West (Oregon), Asia Pacific (Mumbai), Asia Pacific (Singapore), Asia Pacific (Sydney), Canada (Central), Europe (Frankfurt), Europe (Ireland), and Europe (London).</p>\r\n<p>Automated data preparation for QuickSight Q is available at no additional charge with a QuickSight Q subscription. Get started with a free trial of <a href=\"/content/aws.amazon.com/live/en_US/quicksight/q.html\" target=\"_blank\" rel=\"noopener\">Amazon QuickSight Q</a>.</p>\r\n","modifiedDate":"2022-11-30T00:16:51Z","headlineUrl":"/about-aws/whats-new/2022/11/amazon-quicksight-q-supports-automated-data-preparation/","postDateTime":"2022-11-29T13:00:00Z","postSummary":"<p>Amazon QuickSight Q now includes artificial intelligence (AI)-enhanced automated data preparation, making it fast and straightforward to augment existing dashboards for natural language questions. Preparing data for natural language query takes time and effort. Authors must imagine terms their users will input and manually replicate field names and data type information from their dashboards.  </p>\r\n","contentType":"Launch Announcement","headline":"Amazon QuickSight Q now supports automated data preparation"}
{"id":"whats-new#about-aws-whats-new-2022-11-aws-announces-amazon-redshift-integration-apache-spark","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/aws-announces-amazon-redshift-integration-apache-spark/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-29T17:17:06+0000","dateUpdated":"2022-11-29T21:26:03+0000","GLOBAL_content-type":"Launch Announcement","whats-new_general-products":"amazon-redshift","whats-new_marketing-marchitecture":"analytics","whats-new_year":"2022","postBody":"<p>Amazon Redshift integration for Apache Spark minimizes the cumbersome and often manual process of setting up a spark-redshift open-source connector and reduces the time needed to prepare for analytics and ML tasks. You only need to specify the connection to your data warehouse and can start working with Amazon Redshift data from your Apache Spark-based applications in seconds. You can use several pushdown capabilities for operations such as sort, aggregate, limit, join, and scalar functions so that only the relevant data is moved from your Amazon Redshift data warehouse to the consuming Spark application. This allows you to improve the performance of your applications. You can also help make your applications more secure by using AWS Identity Access and Management (IAM) credentials to connect to Amazon Redshift.<br>\r\n</p>\r\n<p>To get started, go to Amazon EMR 6.9, EMR Serverless, or AWS Glue 4.0, use data frame or Spark SQL code in an Apache Spark job or Notebook to connect to the Amazon Redshift data warehouse, and start running queries in minutes. To learn more, see <a href=\"/content/aws.amazon.com/live/en_US/redshift.html\" target=\"_blank\" rel=\"noopener\">Amazon Redshift</a> or Amazon Redshift Integration for Apache Spark.</p>\r\n","modifiedDate":"2022-11-29T21:25:06Z","headlineUrl":"/about-aws/whats-new/2022/11/aws-announces-amazon-redshift-integration-apache-spark/","postDateTime":"2022-11-29T13:00:00Z","postSummary":"<p>Amazon Redshift integration for Apache Spark helps developers seamlessly build and run Apache Spark applications on Amazon Redshift data. If you are using AWS analytics and machine learning (ML) services—such as Amazon EMR, AWS Glue, and Amazon SageMaker—you can now build Apache Spark applications that read from and write to your Amazon Redshift data warehouse without compromising on the performance of your applications or transactional consistency of your data.&nbsp;Amazon Redshift integration for Apache Spark builds on an <a href=\"https://github.com/spark-redshift-community/spark-redshift\" target=\"_blank\" rel=\"noopener\">existing open source connector project</a> and enhances it for performance and security, helping customers gain up to 10x faster application performance. We thank the original contributors on the project who collaborated with us to make this happen. As we make further enhancements we will continue to contribute back into the open source project.</p>\r\n","contentType":"Launch Announcement","headline":"AWS announces Amazon Redshift integration for Apache Spark"}
{"id":"whats-new#about-aws-whats-new-2022-11-amazon-connect-forecasting-capacity-planning-scheduling-generally-available","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/amazon-connect-forecasting-capacity-planning-scheduling-generally-available/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-29T18:26:18+0000","dateUpdated":"2022-11-29T21:26:03+0000","whats-new_general-products":"amazon-connect","whats-new_marketing-marchitecture":"business-productivity","whats-new_year":"2022","GLOBAL_content-type":"Launch Announcement","postBody":"<p>With forecasting, capacity planning, and scheduling, agents have the flexibility to choose when they want to work overtime or take time off, within predetermined, manager-defined limits, without the need for manual approvals. When agents accept overtime or time-off slots, Amazon Connect uses ML to make real-time schedule updates, such as moving or creating additional rest breaks. Automation frees managers to focus on reviewing performance metrics and coaching agents. Additionally, contact center managers can track agents’ adherence to planned schedules in real time. With one check of a box, you can try out these capabilities, without any extra cost, effort, or time.</p>\r\n<p>Amazon Connect forecasting, capacity planning, and scheduling is generally available in four <a href=\"https://aws.amazon.com/about-aws/global-infrastructure/regional-product-services/\" target=\"_blank\" rel=\"noopener\">AWS Regions</a>: US East (N. Virginia), US West (Oregon), Asia Pacific (Sydney), and Europe (London).</p>\r\n<p>To learn more, visit our <a href=\"/content/aws.amazon.com/live/en_US/connect/optimization.html\" target=\"_blank\" rel=\"noopener\">webpage</a>, <a href=\"https://docs.aws.amazon.com/connect/latest/adminguide/forecasting-capacity-planning-scheduling.html\" target=\"_blank\" rel=\"noopener\">documentation</a>, and <a href=\"https://aws.amazon.com/blogs/contact-center/optimization/\" target=\"_blank\" rel=\"noopener\">blog post</a>.</p>\r\n","modifiedDate":"2022-11-29T21:25:11Z","headlineUrl":"/about-aws/whats-new/2022/11/amazon-connect-forecasting-capacity-planning-scheduling-generally-available/","postDateTime":"2022-11-29T13:00:00Z","postSummary":"<p>Amazon Connect forecasting, capacity planning, and scheduling, now generally available, provides new machine learning (ML)–powered capabilities for contact centers. Forecasting, capacity planning, and scheduling help your contact center managers forecast contact demand, determine optimal staffing levels, and ensure the right agents are available at the right time to meet your operational and business goals. </p>\r\n","contentType":"Launch Announcement","headline":"Amazon Connect forecasting, capacity planning, and scheduling is now generally available"}
{"id":"whats-new#about-aws-whats-new-2022-11-announcing-amazon-ec2-hpc6id-instances","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/announcing-amazon-ec2-hpc6id-instances/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-29T17:59:06+0000","dateUpdated":"2022-11-29T21:26:14+0000","GLOBAL_content-type":"Launch Announcement","whats-new_marketing-marchitecture":"compute","whats-new_general-products":"aws-govcloud-us","whats-new_year":"2022","postBody":"<p>EC2 Hpc6id instances are powered by 64 cores of 3rd Generation Intel Xeon Scalable processors with an all-core turbo frequency of 3.5 GHz, 1,024 GB of memory, and up to 15.2 TB of local NVMe solid state drive (SSD) storage. EC2 Hpc6id instances, built on the <a href=\"/content/aws.amazon.com/live/en_US/ec2/nitro.html\" target=\"_blank\" rel=\"noopener\">AWS Nitro System</a>, offer 200 Gbps <a href=\"/content/aws.amazon.com/live/en_US/hpc/efa.html\" target=\"_blank\" rel=\"noopener\">Elastic Fabric Adapter (EFA)</a> networking for high-throughput inter-node communications that enable your HPC workloads to run at scale. The AWS Nitro System is a rich collection of building blocks that offloads many of the traditional virtualization functions to dedicated hardware and software. It delivers high performance, high availability, and high security while reducing virtualization overhead.</p>\r\n<p>EC2 Hpc6id instances are available in the following <a href=\"/content/aws.amazon.com/live/en_US/about-aws/global-infrastructure/regional-product-services.html\" target=\"_blank\" rel=\"noopener\">AWS Regions</a>: US East (Ohio) and AWS GovCloud (US-West). To optimize EC2 Hpc6id instances networking for tightly coupled workloads, you can access EC2 Hpc6id instances in a single Availability Zone in each Region.</p>\r\n<p>To learn more about EC2 Hpc6id instances, see the <a href=\"/content/aws.amazon.com/live/en_US/ec2/instance-types/hpc6i.html\" target=\"_blank\" rel=\"noopener\">product detail page</a>.</p>\r\n","modifiedDate":"2022-11-29T21:25:21Z","headlineUrl":"/about-aws/whats-new/2022/11/announcing-amazon-ec2-hpc6id-instances/","postDateTime":"2022-11-29T13:00:00Z","postSummary":"<p>AWS announces the general availability of Amazon Elastic Compute Cloud (Amazon EC2) Hpc6id instances. These instances are optimized to efficiently run memory bandwidth-bound, data-intensive high performance computing (HPC) workloads, such as finite element analysis and seismic reservoir simulations. With EC2 Hpc6id instances, you can lower the cost of your HPC workloads while taking advantage of the elasticity and scalability of AWS.</p>\r\n","contentType":"Launch Announcement","headline":"Announcing Amazon EC2 Hpc6id instances"}
{"id":"whats-new#about-aws-whats-new-2022-11-amazon-aurora-zero-etl-integration-redshift","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/amazon-aurora-zero-etl-integration-redshift/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-29T17:16:10+0000","dateUpdated":"2022-11-29T21:42:43+0000","whats-new_year":"2022","whats-new_general-products":"amazon-redshift","whats-new_marketing-marchitecture":"databases","GLOBAL_content-type":"Launch Announcement","postBody":"<p>This zero-ETL integration also enables you to analyze data from multiple Aurora database clusters in the same new or existing Amazon Redshift instance to derive holistic insights across many applications or partitions. With near real-time access to transactional data, you can leverage Amazon Redshift’s analytics and capabilities such as built-in ML, materialized views, data sharing, and federated access to multiple data stores and data lakes to derive insights from transactional and other data.</p>\r\n<p>Amazon Aurora zero-ETL integration with Amazon Redshift is now available in limited preview for Amazon Aurora MySQL 3 with MySQL 8.0 compatibility in the <a href=\"/content/aws.amazon.com/live/en_US/about-aws/global-infrastructure/regional-product-services.html\" target=\"_blank\" rel=\"noopener\">US East (N. Virginia) Region</a>.</p>\r\n<p>To request access to the limited preview, visit the <a href=\"https://pages.awscloud.com/AmazonAurora-zeroETL-AmazonRedshift-Preview.html\" target=\"_blank\" rel=\"noopener\">Preview Page</a>. To learn more about each service, visit the <a href=\"/content/aws.amazon.com/live/en_US/rds/aurora.html\" target=\"_blank\" rel=\"noopener\">Amazon Aurora</a> or <a href=\"/content/aws.amazon.com/live/en_US/redshift.html\" target=\"_blank\" rel=\"noopener\">Amazon Redshift</a> webpages.</p>\r\n","modifiedDate":"2022-11-29T21:41:41Z","headlineUrl":"/about-aws/whats-new/2022/11/amazon-aurora-zero-etl-integration-redshift/","postDateTime":"2022-11-29T13:00:00Z","postSummary":"<p>Amazon Aurora now supports zero-ETL integration with Amazon Redshift, to enable near real-time analytics and machine learning (ML) using Amazon Redshift on petabytes of transactional data from Aurora. Within seconds of transactional data being written into Aurora, the data is available in Amazon Redshift, so you don’t have to build and maintain complex data pipelines to perform extract, transform, and load (ETL) operations.</p>\r\n","contentType":"Launch Announcement","headline":"AWS announces Amazon Aurora zero-ETL integration with Amazon Redshift"}
{"id":"whats-new#about-aws-whats-new-2022-11-amazon-redshift-real-time-streaming-ingestion-kds-msk","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/amazon-redshift-real-time-streaming-ingestion-kds-msk/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-29T18:52:34+0000","dateUpdated":"2022-11-29T21:25:52+0000","whats-new_year":"2022","GLOBAL_content-type":"Launch Announcement","postBody":"<p>Data engineers, data analysts, and big data developers are evolving their analytics from batch to real-time, adopting streaming engines like Amazon KDS and Amazon MSK, to implement near real-time responsive logic and analytics on streaming application data. Currently, customers who want to ingest real-time data from services like Amazon KDS and Amazon MSK, into Amazon Redshift must first stage the data in Amazon S3 and use the COPY command, which achieves latency in the minutes. With the new streaming ingestion capability in Amazon Redshift, you can use SQL (Structured Query Language) within Redshift to provide the ability to connect to and directly ingest data from multiple Amazon KDS streams or multiple Amazon MSK topics simultaneously. Amazon Redshift streaming ingestion simplifies data pipelines by letting you create materialized views on top of streams directly. The materialized views can also include SQL transforms as part of your ELT (Extract Load Transform) pipeline.</p>\r\n<p>Once the materialized views are defined, streaming data is automatically and continuously ingested from the KDS stream or MSK topic into the Amazon Redshift streaming materialized view when the Auto Refresh feature is enabled.  You can also choose to manually refresh the streaming materialized view when direct control over ingest scheduling is desired. This approach allows you to perform downstream processing and transformations of streaming data using existing Amazon Redshift tools and SQL that you are familiar with, at no additional cost.</p>\r\n<p>Amazon Redshift streaming ingestion is now generally available in all Amazon Web Services (AWS) regions where <a href=\"/content/aws.amazon.com/live/en_US/about-aws/global-infrastructure/regional-product-services.html\" target=\"_blank\" rel=\"noopener\">Amazon Redshift is available</a>. To get started with Amazon Redshift streaming ingestion, provision an Amazon Redshift cluster in the CURRENT track. For more information on how to get started with Amazon Redshift streaming ingestion, see the <a href=\"https://docs.aws.amazon.com/redshift/latest/dg/materialized-view-streaming-ingestion.html\" target=\"_blank\" rel=\"noopener\">Amazon Redshift documentation</a> page.&nbsp;&nbsp;</p>\r\n","modifiedDate":"2022-11-29T21:24:56Z","headlineUrl":"/about-aws/whats-new/2022/11/amazon-redshift-real-time-streaming-ingestion-kds-msk/","postDateTime":"2022-11-29T08:00:00Z","postSummary":"<p><a href=\"/content/aws.amazon.com/live/en_US/redshift.html\" target=\"_blank\" rel=\"noopener\">Amazon Redshift</a> now supports real-time streaming ingestion for Amazon Kinesis Data Streams (KDS) and Amazon Managed Streaming for Apache Kafka (MSK). Amazon Redshift streaming ingestion eliminates the need to stage streaming data in Amazon S3 before ingesting it into Amazon Redshift, enabling customers to achieve low latency, measured in seconds, while ingesting hundreds of megabytes of streaming data per second into their data warehouse.&nbsp;</p>\r\n","contentType":"Launch Announcement","headline":"Amazon Redshift announces general availability of real-time streaming ingestion for Amazon KDS and Amazon MSK"}
{"id":"whats-new#about-aws-whats-new-2022-11-aws-simspace-weaver-available","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/aws-simspace-weaver-available/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-29T18:13:57+0000","dateUpdated":"2022-11-29T21:25:52+0000","whats-new_year":"2022","GLOBAL_content-type":"Launch Announcement","whats-new_general-use-case":"high-performance-computing","whats-new_marketing-marchitecture":"compute","postBody":"<p>Historically, spatial simulations were generally confined to running on a single server. This limited the number and complexity of dynamic entities that developers could build in their simulations. With SimSpace Weaver, you can break down the simulation world into smaller, discrete spatial areas and distribute the task of running the simulation code across multiple Amazon Elastic Compute Cloud (Amazon EC2) instances. SimSpace Weaver automatically provisions the requested number of EC2 resources, networks them together, and maintains synchronized simulation time across the distributed cluster. It manages the complexities of data replication and object transfer across Amazon EC2 instances so that you can spend more time developing simulation code and content. You can use your own custom simulation engine or popular third-party tools such as Unity and Unreal Engine 5 with SimSpace Weaver.</p>\r\n<p>To quickly iterate on simulation code, use the SimSpace Weaver Local Development environment to test on your hardware. The local environment uses the same SimSpace Weaver APIs as the cloud service, so you can transition to AWS without needing to modify any code when it’s time to scale.&nbsp;</p>\r\n<p>SimSpace Weaver is available in the following <a href=\"/content/aws.amazon.com/live/en_US/about-aws/global-infrastructure/regional-product-services.html\" target=\"_blank\" rel=\"noopener\">AWS Regions</a>:&nbsp;US East (N. Virginia), US East (Ohio), US West (Oregon), Asia Pacific (Singapore), Asia Pacific (Sydney), Europe (Frankfurt), Europe (Ireland), and Europe (Stockholm).</p>\r\n<p>To learn more and get started, see <a href=\"/content/aws.amazon.com/live/en_US/simspaceweaver.html\" target=\"_blank\" rel=\"noopener\">AWS SimSpace Weaver</a>.</p>\r\n","modifiedDate":"2022-11-29T21:25:01Z","headlineUrl":"/about-aws/whats-new/2022/11/aws-simspace-weaver-available/","postDateTime":"2022-11-29T08:00:00Z","postSummary":"<p>Today, AWS announces AWS SimSpace Weaver, a new fully managed compute service that helps you deploy large-scale spatial simulations in the cloud. With SimSpace Weaver, you can create seamless virtual worlds with millions of objects that can interact with one another in real time without managing the backend infrastructure.</p>\r\n","contentType":"Launch Announcement","headline":"Announcing AWS SimSpace Weaver"}
{"id":"whats-new#about-aws-whats-new-2022-11-aws-kms-external-key-store","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/aws-kms-external-key-store/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-29T18:57:19+0000","dateUpdated":"2022-11-29T21:26:03+0000","whats-new_general-products":"aws-kms","GLOBAL_content-type":"Launch Announcement","whats-new_marketing-marchitecture":"security-identity-and-compliance","whats-new_year":"2022","postBody":"<p>XKS may help you address your compliance needs where encryption keys for regulated workloads must be outside AWS and solely under your control.&nbsp;</p>\r\n<p>To provide customers with a broad range of external key manager options, AWS KMS developed the XKS specification with feedback from several HSM, key management and integration service providers, including Thales, Entrust, Salesforce, T-Systems, Atos, Fortanix, and HashiCorp.  For information about availability, pricing, and how to use XKS with solutions from these vendors, consult the vendor’s documentation.</p>\r\n<p>For detailed information about choosing, configuring, and using XKS, see <a href=\"https://docs.aws.amazon.com/kms/latest/developerguide/keystore-external.html\" target=\"_blank\" rel=\"noopener\">External Key Stores</a> in the AWS KMS Developer Guide and read the External Key Store (XKS) announcement on the <a href=\"https://aws.amazon.com/blogs/aws/announcing-aws-kms-external-key-store-xks/\" target=\"_blank\" rel=\"noopener\">AWS News Blog</a>. To see the Regions where XKS is currently available, visit our <a href=\"https://docs.aws.amazon.com/kms/latest/developerguide/keystore-external.html\" target=\"_blank\" rel=\"noopener\">technical documentation</a>.<br>\r\n</p>\r\n","modifiedDate":"2022-11-29T21:25:06Z","headlineUrl":"/about-aws/whats-new/2022/11/aws-kms-external-key-store/","postDateTime":"2022-11-29T08:00:00Z","postSummary":"<p>Today, <a href=\"/content/aws.amazon.com/live/en_US/kms.html\" target=\"_blank\" rel=\"noopener\">AWS Key Management Service (AWS KMS)</a> introduces the External Key Store (XKS), a new feature for customers who want to protect their data with encryption keys stored in an external key management system under their control. This capability brings new flexibility for customers to encrypt or decrypt data with cryptographic keys, independent authorization, and audit in an external key management system outside of AWS.</p>\r\n","contentType":"Launch Announcement","headline":"AWS KMS launches External Key Store "}
{"id":"whats-new#about-aws-whats-new-2022-11-amazon-omics-generally-available","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/amazon-omics-generally-available/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-29T18:36:15+0000","dateUpdated":"2022-11-29T21:26:03+0000","whats-new_year":"2022","GLOBAL_content-type":"Launch Announcement","postBody":"<p>With Amazon Omics, you can bring genomic, biological, and population health data together to generate insights and offer more personalized care with multimodal analysis. For example, you can train ML models with Amazon SageMaker to help researchers predict whether individuals are predisposed to certain diseases. You can also combine an individual’s genome data with their medical history from Amazon HealthLake to deliver better diagnosis and personalized treatment plans. Additionally, Amazon Omics is HIPAA eligible.&nbsp;&nbsp;</p>\r\n<p>Amazon Omics is now available in the US East (N. Virginia), US West (Oregon), Asia Pacific (Singapore), Europe (Frankfurt), Europe (Ireland), and Europe (London) <a href=\"/content/aws.amazon.com/live/en_US/about-aws/global-infrastructure/regional-product-services.html\" target=\"_blank\" rel=\"noopener\">AWS Regions</a>.</p>\r\n<p>Read the <a href=\"https://aws.amazon.com/blogs/aws/introducing-amazon-omics-a-purpose-built-service-to-store-query-and-analyze-genomic-and-biological-data-at-scale\" target=\"_blank\" rel=\"noopener\">blog post</a> to learn more, and refer to the <a href=\"https://docs.aws.amazon.com/omics/\" target=\"_blank\" rel=\"noopener\">documentation</a> to get started.<br>\r\n</p>\r\n","modifiedDate":"2022-11-29T21:25:06Z","headlineUrl":"/about-aws/whats-new/2022/11/amazon-omics-generally-available/","postDateTime":"2022-11-29T08:00:00Z","postSummary":"<p>Amazon Omics is a new purpose-built service that helps healthcare and life science organizations store, query, and analyze genomic, transcriptomic, and other omics data and then generate insights from that data to improve health and advance scientific discoveries. Omics is designed to support large scale analysis and collaborative research so you can store and, together with other AWS services, analyze genome data for entire populations. Amazon Omics also automates provisioning and scaling of bioinformatics workflows, so you can run analysis pipelines at production scale and spend more time on research and innovation.</p>\r\n","contentType":"Launch Announcement","headline":"Introducing Amazon Omics "}
{"id":"whats-new#about-aws-whats-new-2022-11-amazon-security-lake-preview","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/amazon-security-lake-preview/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-29T17:38:10+0000","dateUpdated":"2022-12-01T16:45:58+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2022","whats-new_marketing-marchitecture":"security-identity-and-compliance","postBody":"<p>Once enabled,&nbsp;Security Lake automatically creates a security data lake in a Region that you select for rolling up your global data.&nbsp;AWS log and security data sources are automatically collected in your selected Amazon Simple Storage Service (Amazon S3) bucket for existing and new accounts. They are normalized into the&nbsp;OCSF format, including AWS CloudTrail management events, Amazon Virtual Private Cloud (Amazon VPC) Flow Logs, Amazon Route 53 Resolver query logs, and&nbsp;security findings&nbsp;from over&nbsp;50 solutions&nbsp;integrated through&nbsp;AWS Security Hub. You can also bring data into your security data lake from&nbsp;third-party security solutions and your custom data that you have&nbsp;converted into OCSF. This data can include logs from internal applications or network infrastructure.&nbsp;Security Lake manages the lifecycle of your&nbsp;data with customizable retention settings and storage costs with&nbsp;automated storage tiering.&nbsp;</p>\r\n<p>During the preview period, Amazon&nbsp;Security Lake is available in the following <a href=\"/content/aws.amazon.com/live/en_US/about-aws/global-infrastructure/regional-product-services.html\" target=\"_blank\" rel=\"noopener\">AWS Regions</a>: US East (Ohio), US East (N. Virginia), US West (Oregon),&nbsp;Asia Pacific (Sydney), Asia Pacific (Tokyo), Europe (Frankfurt), and Europe (Ireland).&nbsp;</p>\r\n<p>To get started, see the following list of resources:</p>\r\n<ul>\r\n<li><a href=\"https://console.aws.amazon.com/securitylake/\" target=\"_blank\" rel=\"noopener\">Amazon Security Lake console&nbsp;</a></li>\r\n<li><a href=\"https://aws.amazon.com/blogs/aws/preview-amazon-security-lake-a-purpose-built-customer-owned-data-lake-service/\" target=\"_blank\" rel=\"noopener\">Preview: Amazon Security Lake – A Purpose-Built Customer-Owned Data Lake Service</a><br>\r\n</li>\r\n<li><a href=\"https://docs.aws.amazon.com/security-lake/latest/userguide/\" target=\"_blank\" rel=\"noopener\">Amazon Security Lake User Guide&nbsp;</a></li>\r\n<li><a href=\"https://docs.aws.amazon.com/security-lake/latest/userguide/integrations-third-party.html\" target=\"_blank\" rel=\"noopener\">Amazon Security Lake integrations documentation&nbsp;</a></li>\r\n<li><a href=\"/content/aws.amazon.com/live/en_US/security-lake.html\" target=\"_blank\" rel=\"noopener\">Amazon Security Lake webpage</a></li>\r\n<li><a href=\"https://github.com/ocsf/\" target=\"_blank\" rel=\"noopener\">OCSF website&nbsp;</a><br>\r\n</li>\r\n</ul>\r\n","modifiedDate":"2022-12-01T16:45:04Z","headlineUrl":"/about-aws/whats-new/2022/11/amazon-security-lake-preview/","postDateTime":"2022-11-29T08:00:00Z","postSummary":"<p>Amazon Security Lake automatically centralizes security data from cloud, on-premises, and custom sources into a purpose-built data lake stored in your account. Security Lake makes it easier to analyze security data so that you can get a more complete understanding of your security across the entire organization. You can also improve the protection of your workloads, applications, and data. Security Lake automatically gathers and manages all your security data across accounts and Regions. You can use your preferred analytics tools while retaining control and ownership of your security data.&nbsp;Security Lake has adopted&nbsp;the Open Cybersecurity Schema Framework (OCSF), an open standard. It helps normalize and combine security data from AWS and a broad range of enterprise security data sources. Now, your analysts and engineers can get broad visibility to investigate and respond to security events and improve your security across the cloud and on premises.</p>\r\n","contentType":"Launch Announcement","headline":"Introducing Amazon Security Lake (Preview)"}
{"id":"whats-new#about-aws-whats-new-2022-11-aws-supply-chain-preview","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/aws-supply-chain-preview/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-29T18:26:05+0000","dateUpdated":"2022-11-29T21:25:52+0000","GLOBAL_content-type":"Launch Announcement","postBody":"<p>AWS Supply Chain provides a real-time visual map feature showing the level and health of inventory in each location, ML-powered insights, and targeted watchlists to alert you to potential risks. When a risk is uncovered, AWS Supply Chain provides inventory rebalancing recommendations and built-in, contextual collaboration tools that make it easier to coordinate across teams to implement solutions. AWS Supply Chain connects to your existing enterprise resource planning (ERP) and supply chain management systems, without replatforming, upfront licensing fees, or long-term contracts.&nbsp;</p>\r\n<p>AWS Supply Chain is available in preview in the following AWS Regions: US East (N. Virginia), US West (Oregon), and Europe (France).</p>\r\n<p>To learn more about AWS Supply Chain, see the <a href=\"/content/aws.amazon.com/live/en_US/aws-supply-chain.html\" target=\"_blank\" rel=\"noopener\">webpage</a>.</p>\r\n","modifiedDate":"2022-11-29T21:24:56Z","headlineUrl":"/about-aws/whats-new/2022/11/aws-supply-chain-preview/","postDateTime":"2022-11-29T08:00:00Z","postSummary":"<p>AWS Supply Chain is a cloud-based application that helps supply chain leaders mitigate risks and lower costs to increase supply chain resilience. AWS Supply Chain unifies supply chain data, provides machine learning (ML)–powered actionable insights, and offers built-in contextual collaboration, all of which help you increase customer service levels by reducing stock outs and help you lower costs from overstock.<br>\r\n</p>\r\n","contentType":"Launch Announcement","headline":"Announcing AWS Supply Chain (Preview)"}
{"id":"whats-new#about-aws-whats-new-2022-11-amazon-connect-step-by-step-guides-agent-workspace-preview","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/amazon-connect-step-by-step-guides-agent-workspace-preview/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-29T18:26:16+0000","dateUpdated":"2022-11-29T21:25:41+0000","whats-new_general-products":"amazon-connect","GLOBAL_content-type":"Launch Announcement","whats-new_marketing-marchitecture":"customer-enablement","whats-new_year":"2022","postBody":"<p>Step-by-step guides within agent workspace programmatically infer customer intent and recommend discrete next actions for agents within a guided experience. For example, when a customer calls, agent workspace presents the agent with the likely issue based on the customer’s history or current context (such as a lost order). Then agent workspace guides the agent through the actions needed to help quickly resolve the issue (such as initiating a replacement order).&nbsp;You can design workflows for various types of customer interactions and present agents with different step-by-step guides based on customer context, such as call queues, customer information, and IVR responses.</p>\r\n<p>Amazon Connect step-by-step guides are now available in preview in the following AWS Regions: US East (N. Virginia), US West (Oregon),&nbsp;Asia Pacific (Sydney), and Europe (London).</p>\r\n<p>To learn more and get started, visit the <a href=\"/content/aws.amazon.com/live/en_US/connect/agent-workspace.html\" target=\"_blank\" rel=\"noopener\">agent workspace webpage</a> and <a href=\"https://docs.aws.amazon.com/connect/latest/adminguide/step-by-step-guided-experiences\" target=\"_blank\" rel=\"noopener\">documentation</a>. You can find out more about Amazon Connect by visiting the <a href=\"/content/aws.amazon.com/live/en_US/connect.html\" target=\"_blank\" rel=\"noopener\">Amazon Connect webpage</a>.&nbsp;</p>\r\n","modifiedDate":"2022-11-29T21:24:46Z","headlineUrl":"/about-aws/whats-new/2022/11/amazon-connect-step-by-step-guides-agent-workspace-preview/","postDateTime":"2022-11-29T08:00:00Z","postSummary":"<p>Amazon Connect agent workspace now&nbsp;provides a step-by-step experience (preview) that guides agents by identifying customer issues and recommending subsequent actions.&nbsp;With&nbsp;Amazon Connect, you can create workflows that walk agents through custom UI pages that suggest what to do at a given moment during a customer interaction.&nbsp;Detailed step-by-step guides increase agent productivity and decrease training time.</p>\r\n","contentType":"Launch Announcement","headline":"Amazon Connect now provides step-by-step guides in agent workspace (preview)"}
{"id":"whats-new#about-aws-whats-new-2022-11-amazon-quicksight-q-question-types","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/amazon-quicksight-q-question-types/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-29T17:20:56+0000","dateUpdated":"2022-11-29T21:25:52+0000","GLOBAL_content-type":"Launch Announcement","whats-new_marketing-marchitecture":"analytics","whats-new_general-products":"amazon-quicksight","whats-new_year":"2022","postBody":"<p>These new capabilities enable business users to instantly get insights previously only accessible by enlisting the help of trained analysts. 'Forecast' questions make it fast and easy to predict trends and helps business users understand what they should expect so they can act quickly and plan accordingly.  'Why' questions are easy to ask and natural to think of, so business users can quickly pinpoint insights they need to know, rather than manually analyzing a body of data to discover contributing changes.</p>\r\n<p>These new feature are available in all <a href=\"https://docs.aws.amazon.com/quicksight/latest/user/regions.html#regions-q\" target=\"_blank\" rel=\"noopener\">AWS Regions where QuickSight Q is supported</a>.&nbsp;</p>\r\n<p>To get started, see the following resources:</p>\r\n<ul>\r\n<li>&nbsp;<a href=\"https://docs.aws.amazon.com/quicksight/latest/user/quicksight-q-ask.html\" target=\"_blank\" style=\"background-color: rgb(255,255,255);\" rel=\"noopener\">Asking Questions with Amazon QuickSight Q</a><span> in the Amazon QuickSight&nbsp; user guide</span></li>\r\n<li><a href=\"https://aws.amazon.com/blogs/big-data/new-analytical-questions-available-in-amazon-quicksight-q-why-and-forecast/\" target=\"_blank\" rel=\"noopener\">Explore the blog</a>: New Analytical Questions Available in Amazon QuickSight Q: ‘Why’ and ‘Forecasting’&nbsp;</li>\r\n</ul>\r\n","modifiedDate":"2022-11-29T21:24:56Z","headlineUrl":"/about-aws/whats-new/2022/11/amazon-quicksight-q-question-types/","postDateTime":"2022-11-29T08:00:00Z","postSummary":"<p>Today, Amazon QuickSight announces support for two new question types that simplify and scale complex analytical tasks using natural language. Business users type “forecast” to see future trajectories for up to 3 measures simultaneously. “Why” performs contribution analysis to automatically identify key drivers.</p>\r\n","contentType":"Launch Announcement","headline":"New question types for Amazon QuickSight Q"}
{"id":"whats-new#about-aws-whats-new-2022-11-amazon-connect-contact-lens-agent-performance-evaluation-forms","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/amazon-connect-contact-lens-agent-performance-evaluation-forms/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-29T18:26:15+0000","dateUpdated":"2022-11-29T21:26:14+0000","GLOBAL_content-type":"Launch Announcement","whats-new_marketing-marchitecture":"analytics","whats-new_general-use-case":"business-applications-other","whats-new_general-products":"amazon-connect","whats-new_year":"2022","postBody":"<p>Contact Lens’ agent performance evaluation capabilities are currently available in all the <a href=\"https://docs.aws.amazon.com/general/latest/gr/connect_region.html\" target=\"_blank\" rel=\"noopener\">AWS Regions</a> where Contact Lens is already available.&nbsp;</p>\r\n<p>To get started, please visit our <a href=\"https://docs.aws.amazon.com/connect/latest/adminguide/evaluations.html\" target=\"_blank\" rel=\"noopener\">help documentation</a> or our <a href=\"/content/aws.amazon.com/live/en_US/connect/contact-lens.html\" target=\"_blank\" rel=\"noopener\">website</a> on Contact Lens for Amazon Connect.&nbsp;</p>\r\n","modifiedDate":"2022-11-29T21:25:16Z","headlineUrl":"/about-aws/whats-new/2022/11/amazon-connect-contact-lens-agent-performance-evaluation-forms/","postDateTime":"2022-11-29T08:00:00Z","postSummary":"<p><a href=\"/content/aws.amazon.com/live/en_US/connect/contact-lens.html\" target=\"_blank\" rel=\"noopener\">Contact Lens for Amazon Connect</a> now provides a set of agent performance evaluation capabilities (preview) that enable contact center managers to create evaluation forms with criteria (e.g, adherence to talk scripts or compliance with sensitive data collection practices) that can be scored using Contact Lens’ machine learning powered conversational analytics. Managers can assess agent performance alongside contact details, recordings, transcripts, and summaries, without the need to switch applications. These capabilities enable managers to assess more agent/customer interactions while reducing the amount of time they spend identifying performance issues and coaching agents to perform their best.&nbsp;</p>\r\n","contentType":"Launch Announcement","headline":"Amazon Connect announces Contact Lens agent performance evaluation forms (Preview)"}
{"id":"whats-new#about-aws-whats-new-2022-11-aws-verified-access-preview","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/aws-verified-access-preview/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-30T00:18:19+0000","dateUpdated":"2022-11-30T03:49:08+0000","whats-new_year":"2022","GLOBAL_content-type":"Launch Announcement","whats-new_marketing-marchitecture":"networking-and-content-delivery","postBody":"<p>With Verified Access, you can quickly enable applications for secure remote access by creating a set of fine-grained policies that define the conditions under which a user can access an application. Verified Access evaluates each access request in real time and only connects users to the application if these conditions are met. Using Verified Access, you can define a unique access policy for each application, with conditions based on identity data and device posture. For example, you can create policies allowing only members of the finance team to access their financial reporting application and using only compliant devices. Verified Access supports your workforce identities through direct integration with <a href=\"/content/aws.amazon.com/live/en_US/iam/identity-center.html\" target=\"_blank\" rel=\"noopener\">AWS IAM Identity Center</a> and direct federation with third-party identity providers through OpenID Connect (OIDC). Verified Access also integrates with third-party device posture providers for additional security context.&nbsp;You can find the list of partners integrated with Verified Access in our <a href=\"http://aws.amazon.com/blogs/aws/aws-verified-access-preview-vpn-less-secure-network-access-to-corporate-applications\" target=\"_blank\" rel=\"noopener\">AWS News blog</a>.<br>\r\n</p>\r\n<p>Verified Access is available in 10 <a href=\"/content/aws.amazon.com/live/en_US/about-aws/global-infrastructure/regions_az.html\" target=\"_blank\" rel=\"noopener\">AWS Regions</a> in public preview: US East (Ohio), US East (Northern Virginia), US West (Northern California), US West (Oregon), Asia Pacific (Sydney), Canada (Central), Europe (Ireland), Europe (London), Europe (Frankfurt), and South America (São Paulo).</p>\r\n<p>Learn more by visiting the Verified Access product detail page and <a href=\"https://docs.aws.amazon.com/verified-access/\" target=\"_blank\" rel=\"noopener\">documentation</a>. To get started, visit the <a href=\"https://us-west-2.console.aws.amazon.com/vpc/home?region=us-west-2#VerifiedAccessInstances\" target=\"_blank\" rel=\"noopener\">console</a>. For details on&nbsp;<span>pricing, visit the <a href=\"/content/aws.amazon.com/live/en_US/verified-access/pricing.html\" target=\"_blank\" rel=\"noopener\">pricing&nbsp;page</a>.</span></p>\r\n","modifiedDate":"2022-11-30T03:48:11Z","headlineUrl":"/about-aws/whats-new/2022/11/aws-verified-access-preview/","postDateTime":"2022-11-29T08:00:00Z","postSummary":"<p>Today AWS announces the preview release of AWS Verified Access, a new service that allows you to deliver secure access to corporate applications without a VPN. Built using <a href=\"/content/aws.amazon.com/live/en_US/security/zero-trust.html\" target=\"_blank\" rel=\"noopener\">AWS Zero Trust guiding principles</a>, Verified Access helps you implement a work-from-anywhere model in a secure and scalable manner.</p>\r\n","contentType":"Launch Announcement","headline":"Announcing the preview of AWS Verified Access"}
{"id":"whats-new#about-aws-whats-new-2022-11-amazon-redshift-support-dynamic-data-masking-preview","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/amazon-redshift-support-dynamic-data-masking-preview/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-29T18:52:44+0000","dateUpdated":"2022-11-29T21:26:24+0000","whats-new_marketing-marchitecture":"analytics","whats-new_year":"2022","GLOBAL_content-type":"Launch Announcement","whats-new_general-products":"amazon-redshift","postBody":"<p>With this capability, as a security administrator, you can create masking policies to define consistent, format preserving, and irreversible masked data values. You can apply masking on a specific column or list columns in a table. Also, you have the flexibility of choosing how to show the masked data. For example, you can completely hide all the information about the data, you can replace partial real values with wildcard characters, or you can define your own way to mask the data using SQL Expressions, Python, or Lambda User Defined Functions. Additionally, you can apply a conditional masking based on other columns, which selectively protects the column data in a table based on the values in one or more different columns.  When you attach a policy to a table, the masking expression can be applied to one or more of its columns.&nbsp;<br>\r\n</p>\r\n<p>The Dynamic data masking in Amazon Redshift is available as a preview in the following <a href=\"/content/aws.amazon.com/live/en_US/about-aws/global-infrastructure/regional-product-services.html\" target=\"_blank\" rel=\"noopener\">AWS Regions</a>: US East (Ohio), US East (N. Virginia), US West (Oregon),&nbsp;Asia Pacific (Tokyo), Europe (Ireland), Europe (Stockholm). You can find more information about DDM from the Redshift <a href=\"https://docs.aws.amazon.com/redshift/latest/dg/t_ddm.html\" target=\"_blank\" rel=\"noopener\">database developers guide</a>.</p>\r\n","modifiedDate":"2022-11-29T21:25:31Z","headlineUrl":"/about-aws/whats-new/2022/11/amazon-redshift-support-dynamic-data-masking-preview/","postDateTime":"2022-11-29T08:00:00Z","postSummary":"<p><a href=\"/content/aws.amazon.com/live/en_US/redshift.html\" target=\"_blank\" rel=\"noopener\">Amazon Redshift</a> already supports role-based access control, row-level security, and column-level security to enable organizations to enforce fine-grained security on Redshift data. Amazon Redshift now extends these security features by supporting Dynamic Data Masking (DDM) that allows you to simplify the process of protecting sensitive data in your Amazon Redshift data warehouse. With Dynamic data masking, you control access to your data through simple SQL based masking policies that determine how Redshift returns sensitive data to the user at query time. Dynamic data masking makes it simple for you to adapt to changing privacy requirements without altering underlying data or updating SQL queries.</p>\r\n","contentType":"Launch Announcement","headline":"Amazon Redshift announces support for Dynamic Data Masking (Preview)"}
{"id":"whats-new#about-aws-whats-new-2022-11-aws-outposts-qatar-guatemala-trinidad-tobago","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2022/11/aws-outposts-qatar-guatemala-trinidad-tobago/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2022-11-30T00:20:00+0000","dateUpdated":"2022-11-30T00:20:00+0000","whats-new_year":"2022","GLOBAL_content-type":"Launch Announcement","whats-new_marketing-marchitecture":"compute","whats-new_general-products":"aws-outposts","postBody":"<p><a href=\"/content/aws.amazon.com/live/en_US/outposts.html\" target=\"_blank\" rel=\"noopener\">AWS Outposts</a>&nbsp;is a family of fully managed solutions that extends AWS infrastructure, AWS services, APIs, and tools to virtually any on-premises or edge location for a truly consistent hybrid experience. Outposts is ideal for workloads that require low latency access to on-premises systems, local data processing, and migration of applications with local system interdependencies. Outposts can also help meet data residency requirements. Outposts is available in a variety of form factors, from 1U and 2U Outposts servers to 42U Outposts racks, and multiple rack deployments.</p>\r\n<p>With the availability of Outposts in Qatar, Guatemala, and Trinidad &amp; Tobago, you can use AWS services to run your workloads and data in country in your on-premises facilities and connect to your nearest AWS Region for management and operations. Outposts rack is now available in 73 countries and territories, and 2U Outposts servers are now available in 72 countries and territories.&nbsp;</p>\r\n<p>To learn more about Outposts, read the <a href=\"/content/aws.amazon.com/live/en_US/outposts.html\" target=\"_blank\" rel=\"noopener\">product overview</a> and <a href=\"https://docs.aws.amazon.com/outposts/index.html\" target=\"_blank\" rel=\"noopener\">user guide</a>. For the most updated list of countries and territories where Outposts is supported, check out the <a href=\"/content/aws.amazon.com/live/en_US/outposts/faqs.html\" target=\"_blank\" rel=\"noopener\">Outposts rack FAQs page</a>&nbsp;and&nbsp;the <a href=\"/content/aws.amazon.com/live/en_US/outposts/servers/faqs.html\" target=\"_blank\" rel=\"noopener\">Outposts servers FAQs page</a>.</p>\r\n","modifiedDate":"2022-11-30T00:19:01Z","headlineUrl":"/about-aws/whats-new/2022/11/aws-outposts-qatar-guatemala-trinidad-tobago/","postDateTime":"2022-11-29T08:00:00Z","postSummary":"<p>AWS Outposts can now be shipped and installed at your data center and on-premises locations in Qatar, Guatemala, and Trinidad &amp; Tobago.</p>\r\n","contentType":"Launch Announcement","headline":"Announcing availability of AWS Outposts in Qatar, Guatemala, and Trinidad & Tobago"}
