{"id":"whats-new#about-aws-whats-new-2009-12-18-aws-management-console-adds-support-for-elastic-load-balancing","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/12/18/aws-management-console-adds-support-for-elastic-load-balancing/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:04+0000","dateUpdated":"2020-12-30T21:06:20+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2019-10-06T04:46:56Z","headlineUrl":"/about-aws/whats-new/2009/12/18/aws-management-console-adds-support-for-elastic-load-balancing/","postDateTime":"2009-12-18T20:00:00Z","postSummary":"<p>We’re excited to announce today that we’ve added support for Elastic Load Balancing to the AWS Management Console. Elastic Load Balancing automatically distributes incoming application traffic across multiple Amazon EC2 instances. Now you can use a simple, point-and-click web interface to create and configure load balancers for your Amazon EC2 applications. With AWS Management Console support, you can get started with Elastic Load Balancing faster than ever. This functionality is accessible through the Load Balancers section of the Amazon EC2 tab in the AWS Management Console.</p>\n<p>Access to the AWS Management Console is provided free of charge at <a href=\"/content/aws.amazon.com/live/en_US/console.html\">https://console.aws.amazon.com</a>.</p>","contentType":"Launch Announcement","headline":"AWS Management Console Adds Support for Elastic Load Balancing"}
{"id":"whats-new#about-aws-whats-new-2009-12-15-announcing-cloudfront-streaming","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/12/15/announcing-cloudfront-streaming/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:56+0000","dateUpdated":"2020-12-30T21:02:12+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2019-10-06T04:46:56Z","headlineUrl":"/about-aws/whats-new/2009/12/15/announcing-cloudfront-streaming/","postDateTime":"2009-12-15T20:00:00Z","postSummary":"<p>Amazon CloudFront, the easy-to-use content delivery service, now supports the ability to stream audio and video files. Traditionally, world-class streaming has been out of reach of for many customers  – running streaming servers was technically complex, and customers had to negotiate long- term contracts with minimum commitments in order to have access to the global streaming infrastructure needed to give high performance.</p>\n<p>We’ve designed Amazon CloudFront to make streaming accessible for anyone with media content. Streaming with Amazon CloudFront is exceptionally easy: with only a few clicks on the AWS Management Console or a simple API call, you’ll be able to stream your content using a world-wide network of edge locations running Adobe’s Flash® Media Server. And, like all AWS services, Amazon CloudFront streaming requires no up-front commitments or long-term contracts. There are no additional charges for streaming with Amazon CloudFront; you simply pay normal rates for the data that you transfer using the service.</p>\n<p>Visit the <a href=\"/content/aws.amazon.com/live/en_US/cloudfront.html\">Amazon CloudFront page</a> to learn more.</p>","contentType":"Launch Announcement","headline":"Announcing Amazon CloudFront Streaming"}
{"id":"whats-new#about-aws-whats-new-2009-12-14-amazon-virtual-private-cloud-enters-unlimited-beta","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/12/14/amazon-virtual-private-cloud-enters-unlimited-beta/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:05+0000","dateUpdated":"2020-12-30T21:07:27+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2019-10-06T04:46:56Z","headlineUrl":"/about-aws/whats-new/2009/12/14/amazon-virtual-private-cloud-enters-unlimited-beta/","postDateTime":"2009-12-14T20:00:00Z","postSummary":"<p>Today, we’re excited to announce unlimited access to Amazon Virtual Private Cloud (Amazon VPC) – a secure and seamless bridge between a company’s existing IT infrastructure and the AWS cloud. Since August 2009, Amazon VPC has been in a limited beta, during which we’ve selectively granted access. Starting today, all current and future Amazon EC2 customer accounts are enabled to use Amazon VPC, but customers will not be charged for Amazon VPC until they begin using it. Amazon VPC enables enterprises to connect their existing infrastructure to a set of isolated AWS compute resources via a Virtual Private Network (VPN) connection, and to extend their existing management capabilities such as security services, firewalls, and intrusion detection systems to include their AWS resources. To get started with the service, please visit the <a href=\"/content/aws.amazon.com/live/en_US/vpc.html\">Amazon VPC detail page</a>.</p>","contentType":"Launch Announcement","headline":"Amazon Virtual Private Cloud Enters Unlimited Beta"}
{"id":"whats-new#about-aws-whats-new-2009-12-14-announcing-amazon-ec2-spot-instances","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/12/14/announcing-amazon-ec2-spot-instances/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:48:54+0000","dateUpdated":"2020-12-30T21:01:27+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2019-10-06T04:46:56Z","headlineUrl":"/about-aws/whats-new/2009/12/14/announcing-amazon-ec2-spot-instances/","postDateTime":"2009-12-14T20:00:00Z","postSummary":"<p>We are excited to announce the introduction of Amazon EC2 Spot Instances, a new way to purchase and consume Amazon EC2 Instances.  Spot Instances allow customers to bid on unused Amazon EC2 capacity and run those instances for as long as their bid exceeds the current Spot Price.  The Spot Price changes periodically based on supply and demand, and customers whose bids meet or exceed it gain access to the available Spot Instances.  Spot Instances are complementary to On-Demand Instances and Reserved Instances, providing another option for obtaining compute capacity.  If you have flexibility in when your applications can run, Spot Instances can significantly lower your Amazon EC2 costs.  Additionally, Spot Instances can provide access to large amounts of additional capacity for applications with urgent needs.  To learn more, please visit the <a href=\"/content/aws.amazon.com/live/en_US/ec2/spot-instances.html\">Amazon EC2 Spot Instances detail page</a>.</p>","contentType":"Launch Announcement","headline":"Announcing Amazon EC2 Spot Instances"}
{"id":"whats-new#about-aws-whats-new-2009-12-09-aws-importexport-announces-international-support","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/12/09/aws-importexport-announces-international-support/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:33+0000","dateUpdated":"2020-12-30T21:08:08+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2019-10-06T04:46:56Z","headlineUrl":"/about-aws/whats-new/2009/12/09/aws-importexport-announces-international-support/","postDateTime":"2009-12-09T20:00:00Z","postSummary":"<p>We’re excited to announce that AWS Import/Export now supports importing and exporting data into and out of Amazon S3 buckets in the EU (Ireland) Region.  Additionally, you can now ship storage devices from most international locations for data loads to and from US Standard Region buckets.  AWS Import/Export accelerates moving large amounts of data into and out of AWS using portable storage devices for transport. AWS loads your data directly onto and off of storage devices using Amazon’s high-speed internal network and bypassing the Internet. For significant data sets, AWS Import/Export is often faster than Internet transfer and more cost effective than upgrading your connectivity. Please visit the <a href=\"/content/aws.amazon.com/live/en_US/importexport.html\">AWS Import/Export Detail Page</a> for more information.</p>","contentType":"Launch Announcement","headline":"AWS Import/Export Announces International Support "}
{"id":"whats-new#about-aws-whats-new-2009-12-09-announcing-aws-start-up-challenge-winner","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/12/09/announcing-aws-start-up-challenge-winner/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:28+0000","dateUpdated":"2020-12-30T21:00:35+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2019-10-06T04:46:57Z","headlineUrl":"/about-aws/whats-new/2009/12/09/announcing-aws-start-up-challenge-winner/","postDateTime":"2009-12-09T20:00:00Z","postSummary":"<p>On December 9, 2009 in Sunnyvale, CA, AWS announced the winner of the 2009 AWS Start-Up Challenge: Good Data. As the winner, Good Data has earned $50,000 in cash, $50,000 in AWS service credits, and an investment offer consideration from Amazon.com. The winner was announced at the final event in which all seven finalists presented their business plans to an audience of local start-ups and VCs. In addition, Bizo won the runner-up prize of $25,000 in AWS service credits and FlightCaster won the Amazon Payments award. Watch the finalist videos and learn about their start-ups and their uses of AWS at <a href=\"http://aws.amazon.com/startupchallenge\">aws.amazon.com/startupchallenge/</a>.</p>","contentType":"Launch Announcement","headline":"Announcing the AWS Start-Up Challenge Winner"}
{"id":"whats-new#about-aws-whats-new-2009-12-09-amazon-ec2-now-offers-windows-server-2008","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/12/09/amazon-ec2-now-offers-windows-server-2008/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:40+0000","dateUpdated":"2020-12-30T20:57:34+0000","whats-new_general-products":"ec2-windows","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2019-10-06T04:46:57Z","headlineUrl":"/about-aws/whats-new/2009/12/09/amazon-ec2-now-offers-windows-server-2008/","postDateTime":"2009-12-09T19:00:00Z","postSummary":"<p>Starting today, Amazon EC2 now offers Microsoft Windows Server 2008 and Microsoft SQL Server® Standard 2008 instances in all Amazon EC2 Regions.  This new announcement extends Amazon EC2’s existing Microsoft-based offerings that include Windows Server 2003 and SQL Server 2005 instances. Like all services offered by AWS, Amazon EC2 running Windows Server or SQL Server offers a low-cost, pay-as-you-go model with no long-term commitments and no minimum fees. Please visit the <a href=\"http://aws.amazon.com/windows\">AWS website</a> for more information on using Amazon EC2 running Windows.</p>","contentType":"Launch Announcement","headline":"Amazon EC2 Now Offers Windows Server 2008 "}
{"id":"whats-new#about-aws-whats-new-2009-12-08-aws-announces-pricing-changes","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/12/08/aws-announces-pricing-changes/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:29+0000","dateUpdated":"2020-12-30T21:08:38+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2019-10-06T04:46:57Z","headlineUrl":"/about-aws/whats-new/2009/12/08/aws-announces-pricing-changes/","postDateTime":"2009-12-08T20:00:00Z","postSummary":"<p>We’re excited to announce some price changes for Amazon S3 and Amazon EC2, as well as a special data transfer promotion that will run until June 30, 2010.</p>\n<p><strong>Amazon S3 Storage Pricing Tiers</strong><br>\nAs Amazon S3 has grown, so has the number of customers storing large amounts of data in the service.  To assist these customers, we are reducing the price of our 500 TB tier.  We are also introducing new pricing tiers in all Amazon S3 Regions at the 1 PB and 5 PB levels.  These changes reduce storage costs for multi-petabyte customers by more than 15%, and reduce the price of our highest tier by more than 50% in the US Standard and EU (Ireland) Regions.</p>\n<p><strong>Amazon S3 EU (Ireland) Pricing</strong><br>\nWe are reducing the price of Amazon S3 in the EU (Ireland) Region by over 15% across all of our storage tiers.  We have lowered our base price tier to $0.150 per GB.  We are also reducing Request prices from $0.012 to $0.010 per 10,000 GET requests or 1,000 PUT requests.</p>\n<p><strong>Amazon EC2 Windows Instance EU (Ireland) Pricing</strong><br>\nWe are reducing the price of Amazon EC2 Windows and SQL Server instances in the EU (Ireland) Region by more than 5% to $0.12 per small Windows instance hour.</p>\n<p><strong>Free Inbound Data Transfer (until June 30, 2010)</strong><br>\nData Transfer into AWS will be free of charge from now through June 30th, 2010, making it even easier for customers to get their data into AWS.  Other applicable charges for use of these services continue to apply.</p>\n<p>For full information on all service pricing, please see the detail page for each service on <a href=\"http://aws.amazon.com\">aws.amazon.com</a>.</p>","contentType":"Launch Announcement","headline":"AWS Announces Pricing Changes"}
{"id":"whats-new#about-aws-whats-new-2009-12-08-new-aws-economics-center","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/12/08/new-aws-economics-center/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:01+0000","dateUpdated":"2020-12-30T20:56:52+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2019-10-06T04:46:57Z","headlineUrl":"/about-aws/whats-new/2009/12/08/new-aws-economics-center/","postDateTime":"2009-12-08T20:00:00Z","postSummary":"<p>AWS has released the AWS Economics Center, a central repository of information, tools, and resources to help decision makers quantify the economic value of cloud computing. With AWS’s cloud computing platform, companies of all sizes can provision IT resources on demand, with no upfront expense or long-term commitment, and pay only for the resources actually used. This new resource center provides tools, such as the Amazon EC2 Cost Comparison Calculator, which you can customize so that you can compare the costs of Amazon Web Services with traditional IT infrastructure alternatives. To learn more about the economic benefits of AWS and to access these resources, go to <a href=\"/content/aws.amazon.com/live/en_US/economics.html\">http://aws.amazon.com/economics</a>.</p>","contentType":"Launch Announcement","headline":"New AWS Economics Center"}
{"id":"whats-new#about-aws-whats-new-2009-12-03-aws-launches-the-northern-california-region","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/12/03/aws-launches-the-northern-california-region/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:45+0000","dateUpdated":"2020-12-30T20:57:41+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2019-10-06T04:46:57Z","headlineUrl":"/about-aws/whats-new/2009/12/03/aws-launches-the-northern-california-region/","postDateTime":"2009-12-03T20:00:00Z","postSummary":"<p>Starting today, you can now choose to locate your AWS resources in our Northern California Region, which like other AWS Regions, contains multiple redundant Availability Zones. Utilizing this Region can reduce your data access latencies if you have customers or existing data centers in the Northern California area.  This new Region is available for Amazon EC2, Amazon Simple Storage Service (Amazon S3), Amazon SimpleDB, Amazon Simple Queue Service (Amazon SQS), and Amazon Elastic MapReduce.  For Northern California Region pricing, please see the detail page for each service at <a href=\"http://aws.amazon.com/products\">aws.amazon.com/products</a>.</p>","contentType":"Launch Announcement","headline":"AWS Launches the Northern California Region"}
{"id":"whats-new#about-aws-whats-new-2009-12-03-amazon-ec2-instances-now-can-boot-from-amazon-ebs","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/12/03/amazon-ec2-instances-now-can-boot-from-amazon-ebs/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:05+0000","dateUpdated":"2020-12-30T21:01:28+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2019-10-06T04:46:57Z","headlineUrl":"/about-aws/whats-new/2009/12/03/amazon-ec2-instances-now-can-boot-from-amazon-ebs/","postDateTime":"2009-12-03T20:00:00Z","postSummary":"<p>Amazon EC2 has also announced the ability to boot instances directly from Amazon EBS snapshots, providing significantly increased flexibility in how customers can manage their instances.  You can still save an Amazon Machine Image (AMI) in an Amazon S3 bucket and boot it from the local instance store, but you can now also choose to save AMIs as Amazon EBS snapshots and boot directly from an Amazon EBS volume.  When an instance is booted from an Amazon EBS snapshot, the root partition of the instance is created on an Amazon EBS volume.  Instances booted from Amazon EBS volumes can be stopped and later restarted, preserving any of the state that is saved to your volume and allowing you to modify some properties of your instances while it is stopped.   For example, you can change your instance size or update the kernel it is using, or attach your root partition to a different running instance, making it easier to do debugging when you are creating new boot images.  When booting from an Amazon EBS volume, AMIs and root partitions are no longer limited to 10GB, but can be up to 1TB in size, enabling significantly more complex images.  Additionally, you are not charged for stopped instance hours and you will just incur charges for your Amazon EBS volumes while your instance is stopped, allowing you to reduce your Amazon EC2 costs when you do not need your instances running. Customers can now use a newly launched API that makes it easy to bundle images without using the command line tools, and can also take advantage of the fact that the content of an Amazon EBS volume is available to the instance immediately on volume creation which can lead to much faster instance boot times.  For more details on this new addition to Amazon EC2, please see the <a href=\"http://ec2-downloads.s3.amazonaws.com/BootFromEBSGSGGuide.pdf\">Boot from Amazon EBS Feature Guide</a>.</p>","contentType":"Launch Announcement","headline":"Amazon EC2 Instances Now Can Boot from Amazon EBS"}
{"id":"whats-new#about-aws-whats-new-2009-11-12-aws-asia","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/11/12/aws-asia/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:42+0000","dateUpdated":"2020-08-24T23:33:00+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2020-08-24T23:31:00Z","headlineUrl":"/about-aws/whats-new/2009/11/12/aws-asia/","postDateTime":"2009-11-12T20:00:00Z","postSummary":"<p>AWS has announced an expansion of its services into an Asia-Pacific region in the first half of 2010, enabling businesses to deploy compute and storage resources in close proximity to their end-users in the region. AWS customers will be able to access AWS’s infrastructure services from multiple Availability Zones in Singapore in the first half of 2010, then in other Availability Zones within Asia over the second half of 2010. AWS services available at the launch of the Asia-Pacific region will include Amazon EC2, Amazon S3, Amazon SimpleDB, Amazon Relational Database Service, Amazon Simple Queue Service, Amazon Elastic MapReduce, and Amazon CloudFront.</p>\n<p>“Developers and businesses located in Asia, as well as those with a multi-national presence, have been eager for Asia-based infrastructure to minimize latency and optimize performance,” said Adam Selipsky, Vice President of Amazon Web Services. “We’re very excited to announce the expansion of AWS infrastructure into Asia to help our customers plan their technology investments and better serve their end-users in Asia.”</p>\n","contentType":"Launch Announcement","headline":"AWS Announces Expansion into Asia"}
{"id":"whats-new#about-aws-whats-new-2009-11-11-amazon-cloudfront-now-supports-private-content","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/11/11/amazon-cloudfront-now-supports-private-content/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:33+0000","dateUpdated":"2020-12-30T21:00:40+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2019-10-06T04:46:58Z","headlineUrl":"/about-aws/whats-new/2009/11/11/amazon-cloudfront-now-supports-private-content/","postDateTime":"2009-11-11T20:00:00Z","postSummary":"<p>We’re excited to announce that we’ve added support for private content to Amazon CloudFront, the cost-effective, low-latency content delivery service from Amazon Web Services (AWS). Now you can have detailed control over who is able to download your files from Amazon CloudFront. This optional feature lets you use Amazon CloudFront to deliver important digital assets that you prefer not to make publicly available. For instance, if your website sells digital goods, you might use Amazon CloudFront’s private content feature to help ensure your merchandise is only downloaded by paying customers. Or, if your company delivers training materials to employees, you might use this feature to help ensure that proprietary information isn’t accessed outside of your organization.</p>\n<p>There are no additional charges for using private content with Amazon CloudFront above that service’s normal rates. You can learn more about the private content feature and the service on the <a href=\"/content/aws.amazon.com/live/en_US/cloudfront.html\">Amazon CloudFront detail page</a>.</p>","contentType":"Launch Announcement","headline":"Amazon CloudFront now supports private content"}
{"id":"whats-new#about-aws-whats-new-2009-11-11-aws-completes-sas70-type-ii-audit","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/11/11/aws-completes-sas70-type-ii-audit/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:48:53+0000","dateUpdated":"2020-12-30T21:07:40+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2019-10-06T04:46:57Z","headlineUrl":"/about-aws/whats-new/2009/11/11/aws-completes-sas70-type-ii-audit/","postDateTime":"2009-11-11T20:00:00Z","postSummary":"<p>Amazon Web Services has successfully completed a Statement on Auditing Standards No. 70 (SAS70) Type II Audit, and has obtained a favorable unbiased opinion from its independent auditors. SAS70 certifies that a service organization has had an in-depth audit of its controls (including control objectives and control activities), which in the case of AWS relates to operational performance and security to safeguard customer data. AWS will continue efforts to obtain the strictest of industry certifications in order to verify its commitment to provide a secure, world-class cloud computing environment.</p>","contentType":"Launch Announcement","headline":"AWS Completes SAS70 Type II Audit"}
{"id":"whats-new#about-aws-whats-new-2009-11-11-amazon-cloudfront-now-supports-private-content-2","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/11/11/amazon-cloudfront-now-supports-private-content-2/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:39+0000","dateUpdated":"2020-12-30T21:08:13+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2019-10-06T04:46:58Z","headlineUrl":"/about-aws/whats-new/2009/11/11/amazon-cloudfront-now-supports-private-content-2/","postDateTime":"2009-11-11T20:00:00Z","postSummary":"<p>We are pleased to announce the seven finalists for the 2009 AWS Start-Up Challenge: Bizo, FlightCaster, Gazaro, GoodData, Involver, Motally, ReTel Technologies. These innovative start-ups have been selected for their business potential and use of AWS. The grand prize winner will be announced at the event December 9, 6:00pm-8:30pm at the PlugandPlayTechCenter in Sunnyvale, California. If you are interested in attending, please <b><a href=\"/content/aws.amazon.com/live/en_US/startupchallenge-final-event.html\">register</a></b> today as seats are limited.</p>","contentType":"Launch Announcement","headline":"Announcing 2009 AWS Start-Up Challenge Finalists"}
{"id":"whats-new#about-aws-whats-new-2009-11-11-announcing-aws-sdk-for-net","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/11/11/announcing-aws-sdk-for-net/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:41+0000","dateUpdated":"2020-12-30T21:06:26+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","whats-new_resource-development-language":"dotnet","modifiedDate":"2019-10-06T04:46:58Z","headlineUrl":"/about-aws/whats-new/2009/11/11/announcing-aws-sdk-for-net/","postDateTime":"2009-11-11T19:00:00Z","postSummary":"<p>The AWS SDK for .NET makes it even easier for Windows developers to build .NET applications that tap into the cost-effective, scalable, and reliable AWS cloud. Using the SDK, developers will be able to build solutions for AWS infrastructure services, including Amazon Simple Storage Service (Amazon S3), Amazon Elastic Compute Cloud (Amazon EC2), and Amazon SimpleDB. With the AWS SDK for .NET, developers get started in minutes with a single, downloadable package complete with Visual Studio project templates, the AWS .NET library, C# code samples, and documentation.</p>\n<p>Learn more about the AWS SDK for .NET at <a href=\"/content/aws.amazon.com/live/en_US/sdkfornet.html\">http://aws.amazon.com/sdkfornet</a>. See all resources for Windows &amp; .NET development at <a href=\"/content/aws.amazon.com/live/en_US/net.html\">http://aws.amazon.com/net</a>.</p>","contentType":"Launch Announcement","headline":"Announcing AWS SDK for .NET"}
{"id":"whats-new#about-aws-whats-new-2009-11-10-aws-multi-factor-authentication-compatible-devices-now-available-worldwide","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/11/10/aws-multi-factor-authentication-compatible-devices-now-available-worldwide/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:51:10+0000","dateUpdated":"2020-12-30T21:06:17+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2019-10-06T04:46:58Z","headlineUrl":"/about-aws/whats-new/2009/11/10/aws-multi-factor-authentication-compatible-devices-now-available-worldwide/","postDateTime":"2009-11-10T20:00:00Z","postSummary":"<p>Gemalto, Inc. has announced that they now support worldwide shipping of devices compatible with AWS Multi-Factor Authentication (MFA). This extends the additional security provided by AWS MFA to AWS’s international customers.  For more details on AWS Multi-Factor Authentication, please visit <a href=\"/content/aws.amazon.com/live/en_US/mfa.html\">http://aws.amazon.com/mfa</a>.</p>","contentType":"Launch Announcement","headline":"AWS Multi-Factor Authentication compatible devices now available worldwide"}
{"id":"whats-new#about-aws-whats-new-2009-10-27-announcing-lower-amazon-ec2-instance-pricing","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/10/27/announcing-lower-amazon-ec2-instance-pricing/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:44+0000","dateUpdated":"2020-06-04T04:36:48+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2014-08-06T18:48:09Z","headlineUrl":"/about-aws/whats-new/2009/10/27/announcing-lower-amazon-ec2-instance-pricing/","postDateTime":"2009-10-27T20:00:00Z","postSummary":"<p>Effective November 1, 2009, Amazon EC2 will be lowering prices up to 15% for all On-Demand instance families and sizes.  For example, a Small Standard Linux-based instance will cost just 8.5 cents per hour of computing, compared to the current price of 10 cents per hour.  For more details by instance type and region, please visit the <a href=\"/content/aws.amazon.com/live/en_US/ec2/#pricing.html\">Amazon EC2 detail page</a>.</p>","contentType":"Launch Announcement","headline":"Announcing Lower Amazon EC2 Instance Pricing"}
{"id":"whats-new#about-aws-whats-new-2009-10-27-announcing-amazon-ec2-high-memory-instances","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/10/27/announcing-amazon-ec2-high-memory-instances/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:44+0000","dateUpdated":"2020-12-30T21:06:50+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2019-10-06T04:46:58Z","headlineUrl":"/about-aws/whats-new/2009/10/27/announcing-amazon-ec2-high-memory-instances/","postDateTime":"2009-10-27T20:00:00Z","postSummary":"<p>We are excited to announce the availability of the new High-Memory instance family. This new instance family has two new instances specifically designed for memory-intensive, high throughput workloads such as databases, memory caching, and rendering.  The instance specifications are:</p>\n<ul>\n<li>Double Extra Large: 34.2 GB memory, 13 ECU (4 virtual cores with 3.25 ECU each), 850 GB storage, 64-bit platform</li>\n\t\t<li>Quadruple Extra Large: 68.4 GB memory, 26 ECU (8 virtual cores with 3.25 ECU each), 1690 GB storage, 64-bit platform</li>\n\t</ul>\n\n<p>Please visit our <a href=\"/content/aws.amazon.com/live/en_US/ec2/#instance.html\">Amazon EC2 detail page</a> for additional information on these High-Memory instances.</p>","contentType":"Launch Announcement","headline":"Announcing Amazon EC2 High-Memory Instances"}
{"id":"whats-new#about-aws-whats-new-2009-10-27-introducing-amazon-relational-database-service","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/10/27/introducing-amazon-relational-database-service/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:42+0000","dateUpdated":"2020-08-24T23:30:48+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2020-08-24T23:29:06Z","headlineUrl":"/about-aws/whats-new/2009/10/27/introducing-amazon-relational-database-service/","postDateTime":"2009-10-27T20:00:00Z","postSummary":"<p><a href=\"/content/aws.amazon.com/live/en_US/rds.html\" title=\"Amazon RDS\">Amazon Relational Database Service</a> is a web service that makes it easy to set up, operate, and scale a relational database in the cloud. It provides cost-efficient and resizable capacity, while managing time-consuming database administration tasks, freeing you up to focus on your applications and business. Amazon RDS gives you access to the full capabilities of a familiar MySQL database. This means the code, applications, and tools you already use today with your existing MySQL databases work seamlessly with Amazon RDS. Amazon RDS automatically patches the database software and backs up your database, storing the backups for a user-defined retention period. You also benefit from the flexibility of being able to scale the compute resources or storage capacity associated with your relational database instance via a single API call. As with all Amazon Web Services, there are no up-front investments required, and you pay only for the resources you use. Please see the <a href=\"/content/aws.amazon.com/live/en_US/rds.html\">Amazon RDS detail page</a> for more information on this exciting new service.</p>\n","contentType":"Launch Announcement","headline":"Introducing Amazon Relational Database Service"}
{"id":"whats-new#about-aws-whats-new-2009-10-01-amazon-elastic-mapreduce-now-supports-apache-hive","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/10/01/amazon-elastic-mapreduce-now-supports-apache-hive/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:29+0000","dateUpdated":"2021-12-22T23:43:02+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","postBody":"<p style=\"text-align: center;\"><sup>Modified 12/22/2021 – In an effort to ensure a great experience, expired links in this post have been updated or removed from the original post.</sup></p>\r\n","modifiedDate":"2021-12-22T23:42:13Z","headlineUrl":"/about-aws/whats-new/2009/10/01/amazon-elastic-mapreduce-now-supports-apache-hive/","postDateTime":"2009-10-01T20:00:00Z","postSummary":"<p><a href=\"/content/aws.amazon.com/live/en_US/emr.html\">Amazon Elastic MapReduce</a> now supports Apache Hive, an open source data warehouse and analytics package operated by a SQL-based language. Apache Hive allows users to structure, summarize, and query data sources stored in Amazon S3 without requiring in-depth knowledge of the map/reduce development paradigm. Hive goes beyond standard SQL, adding first-class support for map/reduce functions and complex extensible user-defined data types like Json and Thrift. This capability allows processing of complex and even unstructured data sources such as text documents and log files. Apache Hive is a powerful addition to Amazon Elastic MapReduce that makes the service even more compelling for large data set processing and analytics.&nbsp;</p>\r\n<p>In addition, we are pleased to announce that Amazon Elastic MapReduce is now supported by Karmasphere Studio for Hadoop, a NetBeans-based integrated development environment (IDE) that makes it easy to develop, debug, and deploy job flows from your desktop directly to Amazon Elastic MapReduce. See <a href=\"http://www.hadoopstudio.org/\">Karmasphere Studio</a> for Hadoop for more details on this IDE.</p>\r\n","contentType":"Launch Announcement","headline":"Amazon Elastic MapReduce now supports Apache Hive"}
{"id":"whats-new#about-aws-whats-new-2009-09-30-lower-price-windows-instances","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/09/30/lower-price-windows-instances/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:54+0000","dateUpdated":"2020-08-24T20:57:20+0000","whats-new_general-products":"ec2-windows","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","whats-new_resource-operating-system":"windows","modifiedDate":"2020-08-24T20:55:38Z","headlineUrl":"/about-aws/whats-new/2009/09/30/lower-price-windows-instances/","postDateTime":"2009-09-30T21:00:00Z","postSummary":"<p>Starting today we are removing the distinction between Amazon EC2 running Windows and Amazon EC2 running Windows with Authentication Services. With this change, Windows instances have been upgraded to enable the use of Authentication Services, like LDAP and Kerberos, at no additional charge. Additionally, if you are running any Windows with Authentication Services instances you will now be charged the same price as Windows instances, a savings of 50% on the hourly rate.</p>\n<p>We will remove the current Windows with Authentication Services AMIs starting on October 15th. If you need a version of this AMI, please re-bundle your own copy by following instructions that can be found in our <a href=\"http://docs.amazonwebservices.com/AWSEC2/latest/GettingStartedGuide/index.html?bundling-an-image-windows.html\">Getting Started Guide</a>.</p>\n<p>For more information about this change please visit the <a href=\"/content/aws.amazon.com/live/en_US/windows.html\">Amazon EC2 running Windows service page</a>.</p>\n","contentType":"Launch Announcement","headline":"New Lower Price for Windows Instances with Authentication Services"}
{"id":"whats-new#about-aws-whats-new-2009-09-24-introducing-amazon-ebs-shared-snapshots","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/09/24/introducing-amazon-ebs-shared-snapshots/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:57+0000","dateUpdated":"2020-12-30T21:06:47+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2019-10-06T04:46:58Z","headlineUrl":"/about-aws/whats-new/2009/09/24/introducing-amazon-ebs-shared-snapshots/","postDateTime":"2009-09-24T20:00:00Z","postSummary":"<p>Amazon EBS shared snapshots make it easy for you to share this data with your co-workers or others in the AWS community. With this feature, users that you have authorized can quickly use your Amazon EBS shared snapshots as the basis for creating their own Amazon EBS volumes. If you choose, you can also make your data available publicly to all AWS users. Because all the data is stored in the AWS cloud, users don’t have to wait for time consuming downloads, and can access it within minutes. You can quickly start sharing your data through the <a href=\"/content/aws.amazon.com/live/en_US/console.html\">AWS Management Console</a> by visiting the Snapshots section in the Amazon EC2 tab, or by leveraging the API Tools.</p>\n<p>Please visit our <a href=\"/content/aws.amazon.com/live/en_US/ebs.html\">Amazon EBS detail page</a> for additional information on Amazon EBS shared snapshots and Amazon EBS and see our <a href=\"/content/aws.amazon.com/live/en_US/documentation.html\">developer documentation</a> for more information on the new API calls.</p>","contentType":"Launch Announcement","headline":"Introducing Amazon EBS Shared Snapshots"}
{"id":"whats-new#about-aws-whats-new-2009-09-22-monitoring-auto-scaling-and-elastic-load-balancing-for-amazon-ec2-now-available-in-the-eu-region","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/09/22/monitoring-auto-scaling-and-elastic-load-balancing-for-amazon-ec2-now-available-in-the-eu-region/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:46+0000","dateUpdated":"2020-12-30T21:02:24+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2019-10-06T04:46:59Z","headlineUrl":"/about-aws/whats-new/2009/09/22/monitoring-auto-scaling-and-elastic-load-balancing-for-amazon-ec2-now-available-in-the-eu-region/","postDateTime":"2009-09-22T20:00:00Z","postSummary":"<p>Amazon CloudWatch, Auto Scaling, and Elastic Load Balancing in the EU Region enable you to achieve greater fault-tolerance and scalability when deploying solutions to the EU Region. Amazon CloudWatch is a web service that provides monitoring for AWS cloud resources, starting with Amazon EC2. Auto Scaling allows you to automatically scale your Amazon EC2 capacity up or down according to conditions you define. Elastic Load Balancing automatically distributes incoming application traffic across multiple Amazon EC2 instances. Like all Amazon Web Services and features, Amazon CloudWatch and Elastic Load Balancing are available on a pay-as-you-go basis with no up-front fee, minimum spend, or long term commitment. Auto Scaling is enabled by Amazon CloudWatch and carries no additional fees. For more information on these new features and details on how to start using them, please visit the <a href=\"/content/aws.amazon.com/live/en_US/ec2.html\">Amazon EC2 Detail Page</a>.</p>","contentType":"Launch Announcement","headline":"Monitoring, Auto Scaling and Elastic Load Balancing for Amazon EC2 now available in the EU Region"}
{"id":"whats-new#about-aws-whats-new-2009-09-22-announcing-amazon-simpledb-in-the-eu-region","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/09/22/announcing-amazon-simpledb-in-the-eu-region/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:03+0000","dateUpdated":"2020-12-30T21:02:25+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2019-10-06T04:46:59Z","headlineUrl":"/about-aws/whats-new/2009/09/22/announcing-amazon-simpledb-in-the-eu-region/","postDateTime":"2009-09-22T20:00:00Z","postSummary":"<p>Amazon Web Services has extended Amazon SimpleDB to the EU Region.  EU-based developers and businesses, or those in the US with European customers or operations, can now deploy their structured storage within the EU Region to achieve lower latency, operate closer to other AWS resources like Amazon EC2 and Amazon S3, and help meet EU data storage requirements when applicable.  As in the US Region, Amazon SimpleDB in the EU Region will include a free usage tier, which means you can get started for free without any long-term commitment.</p>\n<p><a href=\"/content/aws.amazon.com/live/en_US/simpledb.html\">Learn more about Amazon SimpleDB</a></p>","contentType":"Launch Announcement","headline":"Announcing Amazon SimpleDB in the EU Region"}
{"id":"whats-new#about-aws-whats-new-2009-08-31-now-available-aws-multi-factor-authentication","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/08/31/now-available---aws-multi-factor-authentication/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:32+0000","dateUpdated":"2020-12-30T21:00:30+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2019-10-06T04:46:59Z","headlineUrl":"/about-aws/whats-new/2009/08/31/now-available---aws-multi-factor-authentication/","postDateTime":"2009-08-31T20:00:00Z","postSummary":"<p>We’re excited to announce the public availability of AWS Multi-Factor Authentication (AWS MFA), which offers customers additional capabilities to access and control their AWS accounts. AWS MFA provides an additional layer of security to the administration of your AWS account by requiring a second piece of information to confirm your identity.  With AWS MFA enabled, you must provide a six-digit, rotating code from a device in your physical possession in addition to your standard AWS account credentials, before you are allowed to make changes to your AWS account settings.  AWS MFA is an optional feature of AWS accounts and is easy to set up and use via the AWS web site.  To learn more about and to begin using this important security feature, visit <a href=\"/content/aws.amazon.com/live/en_US/mfa.html\">aws.amazon.com/mfa</a>.</p>","contentType":"Launch Announcement","headline":"Now Available - AWS Multi-Factor Authentication"}
{"id":"whats-new#about-aws-whats-new-2009-08-31-aws-management-console-adds-support-for-amazon-cloudwatch","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/08/31/aws-management-console-adds-support-for-amazon-cloudwatch/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:51:01+0000","dateUpdated":"2020-12-30T21:06:05+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2019-10-06T04:46:59Z","headlineUrl":"/about-aws/whats-new/2009/08/31/aws-management-console-adds-support-for-amazon-cloudwatch/","postDateTime":"2009-08-31T20:00:00Z","postSummary":"<p>We’re excited to announce today that we’ve added support for Amazon CloudWatch, a web service that provides monitoring for AWS cloud resources starting with Amazon EC2, to the AWS Management Console. Now you can use a simple, point-and-click web interface to enable monitoring for your Amazon EC2 instances and view real-time operational metrics for Amazon EC2. With AWS Management Console support, you can get started with Amazon CloudWatch faster than ever.</p>\n<p>Access to the AWS Management Console is provided free of charge at <a href=\"https://console.aws.amazon.com\">https://console.aws.amazon.com</a>.</p>","contentType":"Launch Announcement","headline":"AWS Management Console Adds Support for Amazon CloudWatch"}
{"id":"whats-new#about-aws-whats-new-2009-08-31-seamlessly-rotate-your-access-credentials","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/08/31/seamlessly-rotate-your-access-credentials/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:26+0000","dateUpdated":"2020-12-30T21:07:38+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2019-10-06T04:46:59Z","headlineUrl":"/about-aws/whats-new/2009/08/31/seamlessly-rotate-your-access-credentials/","postDateTime":"2009-08-31T20:00:00Z","postSummary":"<p>Starting today, Amazon Web Services has made it much easier for you to rotate your access credentials (e.g., an AWS Access Key ID or X.509 Certificate), enabling you to further secure your assets in the AWS cloud. You can now request a new access credential while continuing to keep your existing one active.  This allows you to seamlessly replace the existing access credential with the new one without any incurring any downtime to your applications. With this new capability, you can also make your applications more secure by regularly rotating your access credentials, and protect your account in the event your access credentials are lost or compromised. To learn more about or to begin using access credential rotation, visit the <a href=\"http://portal.aws.amazon.com/gp/aws/developer/account/index.html?action=access-key\">Security Credentials</a> page.</p>","contentType":"Launch Announcement","headline":"Seamlessly Rotate Your Access Credentials"}
{"id":"whats-new#about-aws-whats-new-2009-08-26-aws-start-up-challenge-extended","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/08/26/AWS_Start_Up_Challenge_extended/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:46+0000","dateUpdated":"2020-12-30T20:56:59+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2019-10-06T04:46:59Z","headlineUrl":"/about-aws/whats-new/2009/08/26/AWS_Start_Up_Challenge_extended/","postDateTime":"2009-08-26T20:00:00Z","postSummary":"<p>The AWS Start-Up Challenge 2009 application deadline has been extended to September 25, 2009. Interested start-ups from the US, United Kingdom, Germany, and Israel should apply at the <a href=\"/content/aws.amazon.com/live/en_US/startupchallenge.html\">AWS Start-Up Challenge</a> site.</p>","contentType":"Launch Announcement","headline":"AWS Start-Up Challenge - Deadline extended to September 25, 2009"}
{"id":"whats-new#about-aws-whats-new-2009-08-26-introducing-amazon-virtual-private-cloud","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/08/26/introducing-amazon-virtual-private-cloud/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:40+0000","dateUpdated":"2020-08-18T04:31:13+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2020-07-03T00:38:00Z","headlineUrl":"/about-aws/whats-new/2009/08/26/introducing-amazon-virtual-private-cloud/","postDateTime":"2009-08-26T20:00:00Z","postSummary":"<p>Amazon Virtual Private Cloud (Amazon VPC) is a secure and seamless bridge between a company’s existing IT infrastructure and the AWS cloud. Amazon VPC enables enterprises to connect their existing infrastructure to a set of isolated AWS compute resources via a Virtual Private Network (VPN) connection, and to extend their existing management capabilities such as security services, firewalls, and intrusion detection systems to include their AWS resources. Amazon VPC integrates today with Amazon EC2, and will integrate with other Amazon Web Services in the future. As with all Amazon Web Services, there are no long-term contracts, minimum spend or up-front investments required. With Amazon VPC, you pay only for the resources you use. Please see the <a href=\"/content/aws.amazon.com/live/en_US/vpc.html\">Amazon VPC product page</a> for more information on this exciting new service, and for details on how to request access to the limited beta.</p>\n","contentType":"Launch Announcement","headline":"Introducing Amazon Virtual Private Cloud"}
{"id":"whats-new#about-aws-whats-new-2009-08-20-new-lower-prices-for-amazon-ec2-reserved-instances","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/08/20/New-Lower-Prices-for-Amazon-EC2-Reserved-Instances/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:42+0000","dateUpdated":"2020-12-30T20:57:44+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2019-10-06T04:46:59Z","headlineUrl":"/about-aws/whats-new/2009/08/20/New-Lower-Prices-for-Amazon-EC2-Reserved-Instances/","postDateTime":"2009-08-20T20:00:00Z","postSummary":"<p>Starting today, we have lowered the one-time fee for all Amazon EC2 Reserved Instances by 30%. We continuously strive to be more efficient, and to pass cost savings on to you in the form of lower prices.  With Linux Amazon EC2 Reserved Instances, you could reduce the cost of your instance usage by up to 56% compared to an On-Demand instance. When using Reserved Instances, you pay a low, one-time fee to guarantee capacity for each instance during a 1 or 3 years period. You then have the option to run that instance whenever you want, at a greatly reduced hourly rate. You can find more information about pricing on the <a href=\"http://aws.amazon.com/ec2/#pricing\">EC2 Detail Page</a> and Reserved Instances on the <a href=\"http://aws.amazon.com/ec2/reserved-instances/\">Reserved Instances Detail Page</a>.  We hope that you take advantage of this price savings by using Reserved Instances today!</p>","contentType":"Launch Announcement","headline":"New Lower Prices for Amazon EC2 Reserved Instances"}
{"id":"whats-new#about-aws-whats-new-2009-08-13-aws-import-export-unlimited-beta","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/08/13/AWS-Import-Export-Unlimited-Beta/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:58+0000","dateUpdated":"2020-12-30T20:57:01+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2019-10-06T04:46:59Z","headlineUrl":"/about-aws/whats-new/2009/08/13/AWS-Import-Export-Unlimited-Beta/","postDateTime":"2009-08-13T20:00:00Z","postSummary":"<p>Today we’re excited to announce unlimited access to the AWS Import/Export beta. Additionally, the beta now supports export from Amazon S3. AWS Import/Export accelerates moving large amounts of data into and out of AWS using portable storage devices for transport. For significant data sets, AWS Import/Export is often faster than Internet transfer and more cost effective than upgrading your connectivity. You can use AWS Import/Export for migrating data into the cloud, sending backups to AWS, and restoring data locally. To start using this service, please see the <a href=\"/content/aws.amazon.com/live/en_US/importexport.html\">AWS Import/Export Detail Page</a>.</p>","contentType":"Launch Announcement","headline":"AWS Import/Export Enters Unlimited Beta, Adds Export for Amazon S3"}
{"id":"whats-new#about-aws-whats-new-2009-08-10-elastic-mapreduce-support-apache-pig","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/08/10/elastic-mapreduce-support-apache-pig/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:05+0000","dateUpdated":"2021-12-27T22:18:00+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","postBody":"<p style=\"text-align: center;\"><sup>Modified 12/27/2021 – In an effort to ensure a great experience, expired links in this post have been updated or removed from the original post.</sup></p>\r\n","modifiedDate":"2021-12-27T22:17:10Z","headlineUrl":"/about-aws/whats-new/2009/08/10/elastic-mapreduce-support-apache-pig/","postDateTime":"2009-08-10T20:00:00Z","postSummary":"<p>Amazon Elastic MapReduce now supports Apache Pig – making the service even more compelling for large data set processing and analytics. Apache Pig is a platform for analyzing large data sets that consists of a high-level language for expressing data analysis programs, coupled with infrastructure for evaluating these programs.&nbsp;</p>\r\n","contentType":"Launch Announcement","headline":"Amazon Elastic MapReduce Now Supports Apache Pig"}
{"id":"whats-new#about-aws-whats-new-2009-07-22-aws-toolkit-for-eclipse-adds-simpledb","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/07/22/aws-toolkit-for-eclipse-adds-simpledb/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:50+0000","dateUpdated":"2020-12-30T21:07:14+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2019-10-06T04:47:00Z","headlineUrl":"/about-aws/whats-new/2009/07/22/aws-toolkit-for-eclipse-adds-simpledb/","postDateTime":"2009-07-22T20:00:00Z","postSummary":"<p>We are excited today to introduce support for managing your Amazon SimpleDB data in the AWS Toolkit for Eclipse, a plug-in for the Eclipse Java IDE. With the AWS toolkit for Eclipse, you’ll be able to get started faster and be more productive when building AWS applications.</p>\n<p>Earlier in the year, we launched the AWS Toolkit for Eclipse with support for Amazon EC2, which provided basic management features along with tools for deploying and debugging Java web applications.</p>\n<p>Today, we’ve added support for Amazon SimpleDB, so you can administer your Amazon SimpleDB data without writing a single line of code. By extending the Eclipse Data Tools Project, the AWS Toolkit for Eclipse provides a graphical interface that makes it easy to manage your Amazon SimpleDB domains, items, and attributes.</p>\n<p>The AWS Toolkit for Eclipse is available at no additional cost. We encourage you to check it out and contribute code to the project.</p>\n<p>To learn more about and download the AWS Toolkit for Eclipse, visit <a href=\"http://aws.amazon.com/eclipse\">http://aws.amazon.com/eclipse</a>.</p>","contentType":"Launch Announcement","headline":"AWS Toolkit for Eclipse Adds Amazon SimpleDB Management"}
{"id":"whats-new#about-aws-whats-new-2009-07-09-announcing-the-3rd-annual-aws-start-up-challenge","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/07/09/announcing-the-3rd-annual-aws-start-up-challenge/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:51:09+0000","dateUpdated":"2020-12-30T21:05:03+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2019-10-06T04:47:00Z","headlineUrl":"/about-aws/whats-new/2009/07/09/announcing-the-3rd-annual-aws-start-up-challenge/","postDateTime":"2009-07-09T20:00:00Z","postSummary":"<p>We’re looking for the most promising start-ups that can grow into significant, meaningful, and lasting companies that leverage AWS to build its infrastructure and business. Start-ups in the United States, the United Kingdom, Germany, and Israel are encouraged to apply for a chance to win $50,000 in cash, $50,000 in AWS credits, mentoring sessions from AWS technical experts, and AWS Premium Support Gold for one year.</p>\n<p>To learn more and enter the competition, visit the <a href=\"/content/aws.amazon.com/live/en_US/startupchallenge.html\">AWS Start-Up Challenge home page</a>.</p>","contentType":"Launch Announcement","headline":"Announcing the 3rd Annual AWS Start-Up Challenge"}
{"id":"whats-new#about-aws-whats-new-2009-07-08-amazon-elastic-mapreduce-now-available-in-the-eu-region","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/07/08/amazon-elastic-mapreduce-now-available-in-the-eu-region/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:51:04+0000","dateUpdated":"2020-12-30T21:07:19+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2019-10-06T04:47:00Z","headlineUrl":"/about-aws/whats-new/2009/07/08/amazon-elastic-mapreduce-now-available-in-the-eu-region/","postDateTime":"2009-07-08T20:00:00Z","postSummary":"<p>Amazon Elastic MapReduce web service is now available in the EU Region.   Now customers can run Amazon Elastic MapReduce job flows processing data stored locally in the EU Region.  Amazon Elastic MapReduce is a web service that enables businesses, researchers, data analysts, and developers to easily and cost-effectively process vast amounts of data. It utilizes a hosted Hadoop framework running on the web-scale infrastructure of Amazon Elastic Compute Cloud (Amazon EC2) and Amazon Simple Storage Service (Amazon S3).  Using Amazon Elastic MapReduce, you can instantly provision as much or as little capacity as you like to perform data-intensive tasks for applications such as web indexing, data mining, log file analysis, machine learning, financial analysis, scientific simulation, and bioinformatics research.  Amazon Elastic MapReduce lets you focus on crunching or analyzing your data without having to worry about time-consuming set-up, management or tuning of Hadoop clusters or the compute capacity upon which they sit.  You can learn more and sign up at <a href=\"/content/aws.amazon.com/live/en_US/elasticmapreduce.html\">http://aws.amazon.com/elasticmapreduce</a>.</p>","contentType":"Launch Announcement","headline":"Amazon Elastic MapReduce now available in the EU Region"}
{"id":"whats-new#about-aws-whats-new-2009-06-23-aws-management-console-adds-support-for-amazon-cloudfront","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/06/23/aws-management-console-adds-support-for-amazon-cloudfront/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:19+0000","dateUpdated":"2020-12-30T21:00:41+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2019-10-06T04:47:00Z","headlineUrl":"/about-aws/whats-new/2009/06/23/aws-management-console-adds-support-for-amazon-cloudfront/","postDateTime":"2009-06-23T20:00:00Z","postSummary":"<p>We’re excited to announce today that we’ve added support for Amazon CloudFront, the cost-effective, low-latency content delivery service, to the AWS Management Console. Now you can use a simple, point-and-click web interface to configure and manage Amazon CloudFront. With AWS Management Console support, you can get started with Amazon CloudFront faster than ever.</p>\n<p>Access to the AWS Management Console is provided free of charge at <a href=\"/content/aws.amazon.com/live/en_US/console.html\">http://console.aws.amazon.com</a>.</p>","contentType":"Launch Announcement","headline":"AWS Management Console Adds Support for Amazon CloudFront"}
{"id":"whats-new#about-aws-whats-new-2009-06-08-new-aws-security-center-and-security-whitepaper","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/06/08/new-aws-security-center-and-security-whitepaper/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:48+0000","dateUpdated":"2021-09-22T00:27:51+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2021-09-22T00:26:50Z","headlineUrl":"/about-aws/whats-new/2009/06/08/new-aws-security-center-and-security-whitepaper/","postDateTime":"2009-06-08T20:00:00Z","postSummary":"<p>The <a href=\"/content/aws.amazon.com/live/en_US/security.html\">AWS Security Center</a> is a central location from which you can obtain the latest versions of our security whitepaper, receive security updates and where you can report any security concerns. In addition, we’ve published the June 2009 version of our <i>AWS: Overview of Security Processes</i> whitepaper, which should help answer additional questions about physical and operational security processes for network infrastructure controlled by AWS.</p>\r\n","contentType":"Launch Announcement","headline":"New AWS Security Center and Security Whitepaper"}
{"id":"whats-new#about-aws-whats-new-2009-05-20-aws-import-export","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/05/20/AWS-Import-Export/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:51:12+0000","dateUpdated":"2020-12-30T21:02:33+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2019-10-06T04:47:01Z","headlineUrl":"/about-aws/whats-new/2009/05/20/AWS-Import-Export/","postDateTime":"2009-05-20T20:00:00Z","postSummary":"<p>Amazon Web Services has announced the limited beta of AWS Import/Export, a new offering that accelerates moving large amounts of data into and out of AWS using portable storage devices for transport. For significant data sets, AWS Import/Export is often faster than Internet transfer and more cost effective than upgrading your connectivity. You can use AWS Import/Export for migrating data into the cloud, sending backups to AWS, and interchanging data with others. To be considered for participation, please see the <a href=\"/content/aws.amazon.com/live/en_US/importexport.html\">AWS Import/Export Detail Page</a>.</p>","contentType":"Launch Announcement","headline":"Introducing AWS Import/Export for Physical Data Transfer"}
{"id":"whats-new#about-aws-whats-new-2009-05-20-simpledb-query-enhancements","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/05/20/SimpleDB-query-enhancements/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:47+0000","dateUpdated":"2020-12-30T21:03:26+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2019-10-06T04:47:01Z","headlineUrl":"/about-aws/whats-new/2009/05/20/SimpleDB-query-enhancements/","postDateTime":"2009-05-20T20:00:00Z","postSummary":"<p>In response to customer requests for additional querying capabilities, Amazon SimpleDB today released several upgrades for the SELECT API.  Developers may now perform “contains” queries via the LIKE operator, enabling  them to search for an attribute value within any part of a string.  In addition, queries may now be executed on and sorted by the itemName.  Query sorts have also been upgraded to allow “is null” as the predicate.  Finally, the limit on the number of items returned by a Select has been increased to 2500.  These new features are available with the new <a href=\"http://sdb.amazonaws.com/doc/2009-04-15/AmazonSimpleDB.wsdl\">Amazon SimpleDB WSDL 2009-04-15</a>. Visit the <a href=\"/content/aws.amazon.com/live/en_US/simpledb.html\">Amazon SimpleDB detail page</a> to learn more and to get started with SimpleDB.</p>","contentType":"Launch Announcement","headline":"New Amazon SimpleDB Query Enhancements and WSDL"}
{"id":"whats-new#about-aws-whats-new-2009-05-17-monitoring-auto-scaling-elastic-load-balancing","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/05/17/monitoring-auto-scaling-elastic-load-balancing/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:51:11+0000","dateUpdated":"2020-06-09T05:23:00+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2020-06-09T05:21:01Z","headlineUrl":"/about-aws/whats-new/2009/05/17/monitoring-auto-scaling-elastic-load-balancing/","postDateTime":"2009-05-17T20:00:00Z","postSummary":"<p>AWS today announced the public beta of new features for Amazon EC2: <a href=\"/content/aws.amazon.com/live/en_US/cloudwatch.html\">Amazon CloudWatch</a> for monitoring AWS cloud resources, <a href=\"/content/aws.amazon.com/live/en_US/autoscaling.html\">Auto Scaling</a> for automatically growing and shrinking capacity based on demand, and <a href=\"/content/aws.amazon.com/live/en_US/elasticloadbalancing.html\">Elastic Load Balancing</a> for distributing incoming traffic across Amazon EC2 compute instances. Together, these capabilities provide businesses and developers with greater visibility into the health and usage of AWS compute resources, and allow them to further improve performance of their applications and operate more efficiently. To learn more about these capabilities, visit the <a href=\"/content/aws.amazon.com/live/en_US/ec2.html\">Amazon EC2 detail page</a>.</p>\n","contentType":"Launch Announcement","headline":"Now Available: Monitoring, Auto Scaling and Elastic Load Balancing for Amazon EC2"}
{"id":"whats-new#about-aws-whats-new-2009-05-13-amazon-ec2-running-ibm-now-available-2","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/05/13/amazon-ec2-running-ibm-now-available-2/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:24+0000","dateUpdated":"2020-08-24T23:29:36+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2020-08-24T23:27:55Z","headlineUrl":"/about-aws/whats-new/2009/05/13/amazon-ec2-running-ibm-now-available-2/","postDateTime":"2009-05-13T20:00:00Z","postSummary":"<p>Amazon Elastic Compute Cloud (Amazon EC2) has been working in conjunction with IBM to expand our AMI Catalog. Last week, IBM released IBM Lotus Forms Turbo and IBM Mashup Center Development AMIs. The IBM Lotus Forms Turbo AMI will help you quickly create web-based eForms. IBM Mashup Center enables you to aggregate and “mashup” enterprise, Web, personal, and departmental data into other consumable forms. These AMIs are available at no additional fee beyond Amazon EC2 charges for developers building commercial Software-as-a-Service IBM-based applications.</p>\n","contentType":"Launch Announcement","headline":"IBM Releases New Development AMIs for Amazon EC2"}
{"id":"whats-new#about-aws-whats-new-2009-05-07-amazon-cloudfront-adds-access-logging-capability","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/05/07/amazon-cloudfront-adds-access-logging-capability/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:13+0000","dateUpdated":"2020-09-03T03:58:39+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2020-07-03T00:49:12Z","headlineUrl":"/about-aws/whats-new/2009/05/07/amazon-cloudfront-adds-access-logging-capability/","postDateTime":"2009-05-07T20:00:00Z","postSummary":"<p>AWS today released access logs for Amazon CloudFront. Access logs are activity records that show you details about every request delivered through Amazon CloudFront. They contain a comprehensive set of information about requests for your content, including the object requested, the date and time of the request, the edge location serving the request, the client IP address, the referrer and the user agent. It’s easy to get started using access logs: you just specify the name of the Amazon S3 bucket you want to use to store the logs when you configure your Amazon CloudFront distribution. There are no fees for using the access logs, beyond normal Amazon S3 charges to write, store and retrieve the logs.</p>\n<p>The Amazon Elastic MapReduce team has also built a sample application, <a href=\"/content/aws.amazon.com/live/en_US/articles/loganalyzer-for-amazon-cloudfront.html\">CloudFront LogAnalyzer</a>, that will analyze your Amazon CloudFront access logs. This tool lets you use the power of Amazon Elastic MapReduce to quickly turn Access Logs into the answers to the most commonly asked questions about your business. Additionally, several partners have also built solutions that help you analyze these access logs; you can find more information about these in the <a href=\"/content/aws.amazon.com/live/en_US/solutions.html\">AWS Solutions Catalog</a>.</p>\n<p>Learn more about <a href=\"/content/aws.amazon.com/live/en_US/cloudfront.html\">Amazon CloudFront</a> and <a href=\"/content/aws.amazon.com/live/en_US/emr.html\">Amazon Elastic MapReduce</a>.</p>\n","contentType":"Launch Announcement","headline":"Amazon CloudFront Adds Access Logging Capability"}
{"id":"whats-new#about-aws-whats-new-2009-04-29-aws-goes-to-school-with-programs-for-educators-researchers-and-students","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/04/29/aws-goes-to-school-with-programs-for-educators-researchers-and-students/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:13+0000","dateUpdated":"2021-09-22T00:24:49+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2021-09-22T00:23:53Z","headlineUrl":"/about-aws/whats-new/2009/04/29/aws-goes-to-school-with-programs-for-educators-researchers-and-students/","postDateTime":"2009-04-29T20:00:00Z","postSummary":"<p>Amazon.com, Inc. announces AWS in Education, a set of programs that enable the academic community to easily leverage the benefits of Amazon Web Services for teaching and research. With AWS in Education, educators, academic researchers, and students worldwide can obtain free usage credits to tap into the on-demand infrastructure of Amazon Web Services to teach advanced courses, tackle research endeavors and explore new projects – tasks that previously would have required expensive investments in infrastructure. AWS in Education also provides self-directed learning resources on cloud computing for students. To sign up and begin using Amazon Web Services, and to apply for grants for usage credits, visit: <a href=\"/content/aws.amazon.com/live/en_US/education.html\">http://aws.amazon.com/education</a></p>\r\n","contentType":"Launch Announcement","headline":"AWS Goes To School With Programs For Educators, Researchers, and Students"}
{"id":"whats-new#about-aws-whats-new-2009-04-22-amazon-ec2-running-ibm-now-available","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/04/22/amazon-ec2-running-ibm-now-available/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:31+0000","dateUpdated":"2020-12-30T20:57:43+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2019-10-06T04:47:03Z","headlineUrl":"/about-aws/whats-new/2009/04/22/amazon-ec2-running-ibm-now-available/","postDateTime":"2009-04-22T20:00:00Z","postSummary":"<p>Amazon EC2 running IBM now offers Amazon EC2 instances combined with popular IBM applications that you can pay for by the hour with no need for licenses or long term upfront commitments.  You can now flexibly scale your IBM applications up and down and only pay for what you use.  If you already have an existing IBM license, you may also have the ability to run that license in Amazon EC2 as well and you simply pay our normal Amazon EC2 hourly prices for On-Demand or Reserved Instances.</p>\n<p>The hourly prices for Amazon EC2 running IBM are as follows:</p>\n<ul>\n<li>Amazon EC2 running IBM DB2 Express – starting at $0.38/hour</li>\n<li>Amazon EC2 running IBM DB2 Workgroup – starting at $1.31/hour</li>\n<li>Amazon EC2 running IBM Informix Dynamic Server Express – starting at $0.38/hour</li>\n<li>Amazon EC2 running IBM Informix Dynamic Server Workgroup – starting at $1.31/hour</li>\n<li>Amazon EC2 running IBM WebSphere sMash – starting at $0.50/hour</li>\n<li>Amazon EC2 running IBM Lotus Web Content Management – starting at $2.48/hour</li>\n<li>Amazon EC2 running IBM WebSphere Portal Server and IBM Lotus Web Content Management Server – starting at $6.39/hour</li>\n</ul>\n\n<p>Amazon EC2 running IBM requires no commitments or long-term contracts, and allows you to get up and running quickly with IBM’s proven technologies paying only for the hours you use. To get started, you can find Amazon EC2 running IBM AMIs in the AWS Management Console or ElasticFox by searching for them with the keyword “ec2-paid-ibm-amis”.</p>\n<p>For more details on pricing or using Amazon EC2 with IBM-based technologies please go to <a href=\"/content/aws.amazon.com/live/en_US/ibm.html\">http://aws.amazon.com/ibm</a></p>","contentType":"Launch Announcement","headline":"Amazon EC2 Running IBM Now Available"}
{"id":"whats-new#about-aws-whats-new-2009-04-15-amazon-ec2-reserved-instances-now-available-in-europe","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/04/15/amazon-ec2-reserved-instances-now-available-in-europe/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:13+0000","dateUpdated":"2020-12-30T21:02:20+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2019-10-06T04:47:03Z","headlineUrl":"/about-aws/whats-new/2009/04/15/amazon-ec2-reserved-instances-now-available-in-europe/","postDateTime":"2009-04-15T20:00:00Z","postSummary":"<p>Amazon Elastic Compute Cloud (Amazon EC2) Reserved Instances are now available in Europe.  Reserved Instances give you the option to make a low, one-time payment for each instance you want to reserve and in turn receive a significant discount on the hourly usage charge for that instance. After the one-time payment for an instance, that instance is reserved for you, and you have no further obligation; you may choose to run that instance for the discounted usage rate for the duration of your term, or if and when you do not use the instance, you will not pay usage charges on it.</p>\n<p><a href=\"/content/aws.amazon.com/live/en_US/ec2.html\">Learn More</a></p>","contentType":"Launch Announcement","headline":"Amazon EC2 Reserved Instances Now Available in Europe"}
{"id":"whats-new#about-aws-whats-new-2009-04-09-announcing-amazon-sqs-wsdl-version-2009-02-01-and-amazon-sqs-in-europe","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/04/09/announcing-amazon-sqs-wsdl-version-2009-02-01-and-amazon-sqs-in-europe/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:51:09+0000","dateUpdated":"2020-08-24T23:29:05+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2020-08-24T23:27:18Z","headlineUrl":"/about-aws/whats-new/2009/04/09/announcing-amazon-sqs-wsdl-version-2009-02-01-and-amazon-sqs-in-europe/","postDateTime":"2009-04-09T20:00:00Z","postSummary":"<p><a href=\"/content/aws.amazon.com/live/en_US/sqs.html\">Amazon SQS</a> now includes shared queue access which, among other things, will give you the ability to grant access to your queue to anonymous users and enable you to integrate non-AWS applications with AWS applications. In addition, we’ve added the ability to change the timeout of a received message, which will allow you to accommodate applications that require longer processing time for items in your queues. These new features are available with Amazon SQS WSDL 2009-02-01 which is fully backwards compatible with WSDL 2008-01-01. If you’d like to take advantage of these new features please review our <a href=\"https://docs.aws.amazon.com/AWSSimpleQueueService/latest/SQSDeveloperGuide/welcome.html\">Technical Documentation</a>, which gives detailed information about the new APIs.</p>\n<p>Also, <a href=\"/content/aws.amazon.com/live/en_US/sqs.html\">Amazon SQS</a> is now available in the EU region, which means that resources for Amazon EC2, Amazon S3, and Amazon SQS can now be accessed locally in the EU. Developers now have a local EU end-point that supports all of the Amazon SQS functionality at the same pricing as in the US region.</p>\n","contentType":"Launch Announcement","headline":"Announcing Amazon SQS WSDL Version 2009-02-01 and Amazon SQS in Europe "}
{"id":"whats-new#about-aws-whats-new-2009-04-06-whitepaper-hipaa","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/04/06/whitepaper-hipaa/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:30+0000","dateUpdated":"2020-12-30T21:00:46+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2019-10-06T04:47:04Z","headlineUrl":"/about-aws/whats-new/2009/04/06/whitepaper-hipaa/","postDateTime":"2009-04-06T20:00:00Z","postSummary":"<p>U.S. companies that are handling healthcare information, specifically personally identifiable information, are subject to the security and privacy regulations of Health Insurance Portability and Accountability Act (HIPAA). To help companies building applications in the AWS cloud meet HIPAA standards, we have released a whitepaper, <a adhocenable=\"false\" target=\"_blank\" href=\"/content/dam/whitepapers/compliance/AWS_HIPAA_Compliance_Whitepaper.pdf\"><b>Architecting for HIPAA Security and Compliance on Amazon Web Services (PDF)</b></a> and<b> <a href=\"/content/aws.amazon.com/live/en_US/compliance/hipaa-compliance.html\">HIPAA Faqs</a></b>.<br>\n</p>\n","contentType":"Launch Announcement","headline":"Creating HIPAA-Compliant Medical Data Applications With AWS"}
{"id":"whats-new#about-aws-whats-new-2009-04-02-announcing-amazon-elastic-mapreduce","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/04/02/announcing-amazon-elastic-mapreduce/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:51:16+0000","dateUpdated":"2020-07-10T06:23:28+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2020-07-03T00:37:39Z","headlineUrl":"/about-aws/whats-new/2009/04/02/announcing-amazon-elastic-mapreduce/","postDateTime":"2009-04-02T20:00:00Z","postSummary":"<p>Amazon Web Services has announced the beta launch of Amazon Elastic MapReduce a web service that enables businesses, researchers, data analysts, and developers to easily and cost-effectively process vast amounts of data. It utilizes a hosted Hadoop framework running on the web-scale infrastructure of Amazon Elastic Compute Cloud (Amazon EC2) and Amazon Simple Storage Service (Amazon S3). Using Amazon Elastic MapReduce, you can instantly provision as much or as little capacity as you like to perform data-intensive tasks for applications such as web indexing, data mining, log file analysis, machine learning, financial analysis, scientific simulation, and bioinformatics research. Amazon Elastic MapReduce lets you focus on crunching or analyzing your data without having to worry about time-consuming set-up, management or tuning of Hadoop clusters or the compute capacity upon which they sit. You can learn more and sign up at <a href=\"/content/aws.amazon.com/live/en_US/emr.html\">http://aws.amazon.com/elasticmapreduce</a>.</p>\n","contentType":"Launch Announcement","headline":"Announcing Amazon Elastic MapReduce "}
{"id":"whats-new#about-aws-whats-new-2009-03-30-celebrating-3-years-of-amazon-s3-with-3-months-of-transfer-in-for-3-centsgb","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/03/30/celebrating-3-years-of-amazon-s3-with-3-months-of-transfer-in-for-3-centsgb/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:07+0000","dateUpdated":"2020-12-30T21:01:39+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2019-10-06T04:47:01Z","headlineUrl":"/about-aws/whats-new/2009/03/30/celebrating-3-years-of-amazon-s3-with-3-months-of-transfer-in-for-3-centsgb/","postDateTime":"2009-03-30T20:00:00Z","postSummary":"<p>Three years ago this month, Amazon Web Services launched Amazon Simple Storage Service (Amazon S3) as “storage for the internet,” providing “highly scalable, reliable, low-latency storage at very low costs.”  Since that time, Amazon S3 has experienced dramatic growth, expanded into Europe, and lowered pricing multiple times as we’ve been able to achieve ever greater economies of scale and pass them on to our customers.  Today, the service has grown to store over 52 billion objects and serve over 1 trillion requests per year from customers in over 90 countries.  Whether you’ve used Amazon S3 to back up files, host static website content, securely share files with your external business partners, or store scientific, financial, or website data for processing via Amazon EC2, you’ve contributed to this growth.</p>\n<p>We owe the success of the service to you, and on the 3rd anniversary of Amazon S3, we’ve decided to say “thank you” with a few more “3s.”  We’ll be offering “data transfer in” to Amazon S3 for only $0.03 per GB (vs. the standard $0.10) for the next 3 months, April through June.  As always, data transfer between Amazon S3 and EC2 within regions remains free, and all other pricing dimensions are unchanged.  At the beginning of July, prices will return to normal, so if you’ve been thinking about moving a new project into Amazon S3, now might be the time.  More information on Amazon S3 and its pricing can be found here: <a href=\"/content/aws.amazon.com/live/en_US/s3.html\">http://aws.amazon.com/s3</a></p>\n<p>After three years, we continue to be excited and honored to be on this journey with you.  Thank you.</p>","contentType":"Launch Announcement","headline":"Celebrating 3 Years of Amazon S3 with 3 Months of Transfer-In for 3 Cents/GB"}
{"id":"whats-new#about-aws-whats-new-2009-03-25-announcing-the-aws-toolkit-for-eclipse","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/03/25/announcing-the-aws-toolkit-for-eclipse/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:24+0000","dateUpdated":"2020-12-30T21:03:41+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2019-10-06T04:47:01Z","headlineUrl":"/about-aws/whats-new/2009/03/25/announcing-the-aws-toolkit-for-eclipse/","postDateTime":"2009-03-25T20:00:00Z","postSummary":"<p>The AWS Toolkit for Eclipse is a plug-in for the Eclipse Java IDE that makes it easier for developers to develop, deploy, and debug Java applications using Amazon Web Services. With the AWS Toolkit for Eclipse, you’ll be able to get started faster and be more productive when building AWS applications.</p>\n<p>To learn more about the AWS Toolkit for Eclipse, go to: <a href=\"/content/aws.amazon.com/live/en_US/eclipse.html\">http://aws.amazon.com/eclipse</a></p>","contentType":"Launch Announcement","headline":"Announcing the AWS Toolkit for Eclipse"}
{"id":"whats-new#about-aws-whats-new-2009-03-24-write-your-simpledb-data-faster-with-batch-put","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/03/24/write-your-simpledb-data-faster-with-batch-put/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:11+0000","dateUpdated":"2020-12-30T21:04:54+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2019-10-06T04:47:01Z","headlineUrl":"/about-aws/whats-new/2009/03/24/write-your-simpledb-data-faster-with-batch-put/","postDateTime":"2009-03-24T20:00:00Z","postSummary":"<p>AWS today released a new batch put API for <a href=\"/content/aws.amazon.com/live/en_US/simpledb.html\">Amazon SimpleDB</a>.  Developers can now perform multiple PutAttribute operations in a single call.  The BatchPutAttributes operation offers developers the ability to optimize the number of requests submitted to SimpleDB while increasing overall throughput.</p>","contentType":"Launch Announcement","headline":"Write Your SimpleDB Data Faster With Batch Put"}
{"id":"whats-new#about-aws-whats-new-2009-03-12-amazon-ec2-introduces-reserved-instances","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/03/12/amazon-ec2-introduces-reserved-instances/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:55+0000","dateUpdated":"2020-09-03T03:55:33+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2020-07-03T00:37:28Z","headlineUrl":"/about-aws/whats-new/2009/03/12/amazon-ec2-introduces-reserved-instances/","postDateTime":"2009-03-12T20:00:00Z","postSummary":"<p>We are excited today to introduce Reserved Instances, an additional pricing option for Amazon EC2 that gives you an option to make a low, one-time payment for an instance to reserve capacity and further reduce hourly usage charges. Reserved Instances are complementary to existing Amazon EC2 On-Demand Instances and give businesses even more flexibility to reduce computing costs. As with On-Demand Instances, you will still pay only for the compute capacity that you actually consume, and if you do not use an instance, you will not pay usage charges for it. To learn more about Reserved Instances, go to <a href=\"/content/aws.amazon.com/live/en_US/ec2.html\">http://aws.amazon.com/ec2</a></p>\n","contentType":"Launch Announcement","headline":"Amazon EC2 Introduces Reserved Instances"}
{"id":"whats-new#about-aws-whats-new-2009-03-03-amazon-ec2-running-windows-in-eu-region","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/03/03/amazon-ec2-running-windows-in-eu-region/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:52+0000","dateUpdated":"2020-08-04T03:59:30+0000","GLOBAL_content-type":"Launch Announcement","whats-new_general-products":"ec2-windows","whats-new_year":"2009","modifiedDate":"2020-07-03T00:37:10Z","headlineUrl":"/about-aws/whats-new/2009/03/03/amazon-ec2-running-windows-in-eu-region/","postDateTime":"2009-03-03T19:00:00Z","postSummary":"<p>We are excited to announce several new features for the Amazon EC2 European Region. Starting today, you can launch Amazon EC2 running Windows or SQL Server instances in the EU Region, enabling you to locate your Windows computing resources close to your European customers/partners, as well as to other AWS computing services (e.g. Amazon S3, Amazon CloudFront, etc.). Pay-as-you-go pricing for Amazon EC2 running Windows Server in the EU Region begins at $0.135 per compute hour.</p>\n<p>To make it even easier to get started and to manage Amazon EC2, the <a href=\"https://console.aws.amazon.com\">AWS Management Console</a> has been extended to the Amazon EC2 European Region and provides the same features as in the US Region, including provisioning and managing Linux/UNIX and Windows instances, Amazon EBS volumes, and Elastic IP addresses.</p>\n<p>Finally, Amazon EC2 has also launched an additional Availability Zone for Windows instances in the US Region, making it possible for you to build Windows-based systems that are resilient to failure in a single location.</p>\n<p>We are excited to share these new features with you and invite you to visit the <a href=\"http://aws.amazon.com/windows\">Windows Detail Page</a> or the <a href=\"https://console.aws.amazon.com\">AWS Management Console</a> to get started.</p>\n","contentType":"Launch Announcement","headline":"Amazon EC2 Expands Windows and EU Region Offerings"}
{"id":"whats-new#about-aws-whats-new-2009-02-19-new-features-for-amazon-simpledb","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/02/19/new-features-for-amazon-simpledb/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:47+0000","dateUpdated":"2020-12-30T20:57:43+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2019-10-06T04:47:02Z","headlineUrl":"/about-aws/whats-new/2009/02/19/new-features-for-amazon-simpledb/","postDateTime":"2009-02-19T20:00:00Z","postSummary":"<p>AWS today released two upgrades to the SELECT API for <a href=\"/content/aws.amazon.com/live/en_US/simpledb.html\">Amazon SimpleDB</a>.  With Select Count, developers may now count the number of items that meet the condition(s) specified by the predicate(s) in a query.  And rather than timing out when queries run long, now when using the Select API, SimpleDB will return the partial result set accumulated at the 5 second mark together with a NextToken to restart precisely from the point previously reached, until the full result set has been returned.</p>","contentType":"Launch Announcement","headline":"New Features for Amazon SimpleDB"}
{"id":"whats-new#about-aws-whats-new-2009-02-11-ibm-in-the-cloud","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/02/11/IBM-in-the-Cloud/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:36+0000","dateUpdated":"2020-08-24T23:25:30+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2020-08-24T23:23:48Z","headlineUrl":"/about-aws/whats-new/2009/02/11/IBM-in-the-Cloud/","postDateTime":"2009-02-11T20:00:00Z","postSummary":"<p>Amazon Elastic Compute Cloud (Amazon EC2) has several exciting announcements regarding our partnership with IBM. Effective immediately, you can now bring your own IBM software to Amazon EC2. IBM is also providing several AMIs at no additional fee beyond Amazon EC2 charges for developers building commercial IBM-based applications. Later this year, AWS will make available Amazon EC2 running IBM AMIs, which will enable all customers the ability to use an IBM environment at the same pay-as-you go pricing model you are already familiar with. The initial list of IBM environments that will be available includes: IBM DB2, IBM Informix, IBM WebSphere sMash, IBM Lotus Web Content Management, and IBM WebSphere Portal Server.</p>\n","contentType":"Launch Announcement","headline":"Start Using IBM in the Cloud Today"}
{"id":"whats-new#about-aws-whats-new-2009-02-05-amazon-fps-exits-beta-and-announces-limited-time-free-payment-processing","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/02/05/amazon-fps-exits-beta-and-announces-limited-time-free-payment-processing/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:18+0000","dateUpdated":"2020-12-30T21:00:41+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2019-10-06T04:47:02Z","headlineUrl":"/about-aws/whats-new/2009/02/05/amazon-fps-exits-beta-and-announces-limited-time-free-payment-processing/","postDateTime":"2009-02-05T20:00:00Z","postSummary":"<p><a href=\"/content/aws.amazon.com/live/en_US/fps.html\">Amazon Flexible Payments Service</a> (Amazon FPS) is now generally available and has been made easier to use with Amazon FPS Quick Starts. Amazon FPS Quick Starts aggregate various Amazon FPS APIs into a simplified set of APIs that substantially reduce the steps you must take to enable payment processing on your website. Also, with a limited time offer from Amazon Payments, you can get started free! Build an application using Amazon FPS and get free payment processing for the first 90 days until total transaction volume reaches $500,000. <a href=\"/content/aws.amazon.com/live/en_US/fps/promo.html\">Learn more.</a></p>","contentType":"Launch Announcement","headline":"Amazon FPS Exits Beta and Announces Limited Time Free Payment Processing"}
{"id":"whats-new#about-aws-whats-new-2009-01-28-new-lower-pricing-tiers-for-amazon-cloudfront","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/01/28/new-lower-pricing-tiers-for-amazon-cloudfront/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:26+0000","dateUpdated":"2020-12-30T21:02:28+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2019-10-06T04:47:02Z","headlineUrl":"/about-aws/whats-new/2009/01/28/new-lower-pricing-tiers-for-amazon-cloudfront/","postDateTime":"2009-01-28T20:00:00Z","postSummary":"<p>Today, AWS is announcing new pricing tiers for <a href=\"/content/aws.amazon.com/live/en_US/cloudfront.html\">Amazon CloudFront</a>, our high-performance, pay-as-you-go content delivery service.  The new pricing tiers decrease the price of delivering content to as low as $0.05 per gigabyte delivered for high volume users.  You can see the new pricing tiers, which are effective February 1st, on the <a href=\"/content/aws.amazon.com/live/en_US/cloudfront.html\">CloudFront</a> detail page.</p>","contentType":"Launch Announcement","headline":"New Lower Pricing Tiers for Amazon CloudFront"}
{"id":"whats-new#about-aws-whats-new-2009-01-09-amazon-cto-chief-of-year-2","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/01/09/Amazon-CTO-Chief-of-Year-2/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:00+0000","dateUpdated":"2020-12-30T21:02:34+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2019-10-06T04:47:03Z","headlineUrl":"/about-aws/whats-new/2009/01/09/Amazon-CTO-Chief-of-Year-2/","postDateTime":"2009-01-09T20:00:00Z","postSummary":"\n\n\t<p>Amazon.com CTO Dr. Werner Vogels was honored to accept on behalf of Amazon Web Services the award for Best Enterprise Startup during TechCrunch’s 2nd annual Crunchie awards ceremony at the Herbst Theater in San Francisco on January 9, 2009. We’d also like to congratulate our Crunchie award-winning customers: eBuddy for winning Best International Startup and GoodGuide for winning Most Likely To Make The World A Better Place. Other AWS customers receiving special recognition include Twitter, the runner up for Best Overall Startup in 2008; Animoto, the runner up for Best Design; and DropBox, the runner up for Best New Startup of 2008. Thanks to everyone who voted!</p>\n\n\n<div align=\"right\"><a href=\"http://www.techcrunch.com/2009/01/10/congratulations-to-the-crunchies-winners-facebook-takes-top-prize-for-second-year/%E2%80%9D%20target=%E2%80%9D_blank%E2%80%9D&gt;View%20Article%20&lt;img%20src=\" alt=\"This link will launch a new browser window or tab.\"></a></div>\n","contentType":"Launch Announcement","headline":"AWS Wins 2008 Crunchie Award for Best Enterprise Startup"}
{"id":"whats-new#about-aws-whats-new-2009-01-08-announcing-the-aws-management-console","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/01/08/announcing-the-aws-management-console/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:47+0000","dateUpdated":"2020-12-30T20:57:01+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2019-10-06T04:47:03Z","headlineUrl":"/about-aws/whats-new/2009/01/08/announcing-the-aws-management-console/","postDateTime":"2009-01-08T20:00:00Z","postSummary":"<p>We’re excited to announce the initial beta release of our AWS Management Console, a web-based, point-and-click, graphical user interface that makes it even easier to access and manage AWS Infrastructure Web Services. The initial release provides an online interface for Amazon EC2, with additional AWS services scheduled to be added in the coming months. The console presents an intuitive, global picture of your cloud computing environment so that you can control your AWS resources without programming directly to an API.</p>\n<p>You do not need to write any code or install any software if you access Amazon EC2 via the AWS Management Console. You simply log in to the console after signing up for Amazon EC2 and immediately begin managing your resources through the point-and-click interface. Within minutes, you will be able to configure your application environment and begin launching and managing Amazon EC2 instances, mounting Amazon Elastic Block Store volumes, and listing your Amazon Machine Images (AMIs).</p>\n<p>Access to the AWS Management Console is provided free of charge at <a href=\"https://console.aws.amazon.com\">https://console.aws.amazon.com</a>.</p>","contentType":"Launch Announcement","headline":"Announcing the AWS Management Console"}
{"id":"whats-new#about-aws-whats-new-2009-01-05-amazon-cto-chief-of-year","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2009/01/05/Amazon-CTO-Chief-of-Year/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:52+0000","dateUpdated":"2020-12-30T20:57:49+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2009","modifiedDate":"2020-10-28T19:41:02Z","headlineUrl":"/about-aws/whats-new/2009/01/05/Amazon-CTO-Chief-of-Year/","postDateTime":"2009-01-05T20:00:00Z","postSummary":"\n\n\t<p>“If we’re on the cusp of the computer industry’s next major architecture, the one beyond client-server, Vogels has played a key role in getting us to this point. A former researcher in Cornell University’s computer science department, where he specialized in large-scale distributed systems, Vogels joined Amazon in 2004 to help the e-retailer design and scale its IT infrastructure to handle workloads many times Amazon’s own.”<br><br></p>\n\n\n\t<p>“Vogels’ name and face are often associated with Amazon’s cloud, but AWS isn’t a one-man show. Senior VP Andy Jassy conceived the business model five years ago and has had his hand at the wheel ever since. VP Charlie Bell is the lead technical manager of AWS. VP Adam Selipsky is the liaison to the 440,000 developers who have signed up so far. Vogels, Bell, and Selipsky report to Jassy, and Amazon balked at our suggestion that one of them could be singled out. But we did it anyway, selecting Vogels as InformationWeek’s Chief of the Year, our highest editorial honor.”</p>\n\n\n<div align=\"right\"><a href=\"http://www.informationweek.com/news/management/interviews/showArticle.jhtml?articleID=212501217%E2%80%9D%20target=%E2%80%9D_blank%E2%80%9D&gt;View%20Article%20&lt;img%20src=\" alt=\"This link will launch a new browser window or tab.\"></a></div>\n","contentType":"Launch Announcement","headline":"InformationWeek names Amazon CTO Werner Vogels Chief of the Year"}
