{"id":"whats-new#about-aws-whats-new-2011-12-28-amazon-sns-adds-support-for-delivery-policies-and-message-formatting","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/12/28/Amazon-SNS-adds-support-for-Delivery-Policies-and-Message-Formatting/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:08+0000","dateUpdated":"2020-12-30T20:57:52+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2019-10-06T04:47:18Z","headlineUrl":"/about-aws/whats-new/2011/12/28/Amazon-SNS-adds-support-for-Delivery-Policies-and-Message-Formatting/","postDateTime":"2011-12-28T20:00:00Z","postSummary":"<p>We are excited to announce two new Amazon SNS features today- configurable delivery policies and protocol-specific message formatting. Configurable delivery policies provide control over http retry behavior and improve end-to-end notification reliability.  New message formatting support allows message content to be optimized to fit the requirements of different delivery protocols such as email, sms, and http. \n<br><br>\nAmazon SNS delivery policies make machine-to-machine notifications more reliable by supporting configurable retry behavior to overcome server or network availability issues.  Delivery policies can be applied at either the topic or subscription level to control delivery behavior to any or all http subscriptions. Different retry patterns can be specified which include linear, geometric and exponential back-off.  In addition, maximum and minimum retry delays and maximum delivery rate can be bounded with user-specified values to ensure that downstream servers are never overwhelmed by delivery attempts.\n<br><br>\nWith new message formatting support, Amazon SNS notification content can be optimized to provide richness that is suitable for each delivery protocol used. For example, a notification that goes to both email and SMS subscribers can be tailored to each type of client. SMS users can receive a version of the message formatted for the available 140 characters supported by the SMS standard, while email users can receive a longer, more detailed version of the same content. \n<br><br>\nBoth of these new Amazon SNS features can be accessed from the <a href=\"http://aws.amazon.com/console/\">AWS Management Console</a>.\n</p>","contentType":"Launch Announcement","headline":"Amazon SNS adds support for Delivery Policies and Message Formatting "}
{"id":"whats-new#about-aws-whats-new-2011-12-27-amazon-s3-announces-object-expiration","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/12/27/amazon-s3-announces-object-expiration/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:05+0000","dateUpdated":"2020-12-30T21:02:30+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2019-10-06T04:47:18Z","headlineUrl":"/about-aws/whats-new/2011/12/27/amazon-s3-announces-object-expiration/","postDateTime":"2011-12-27T20:00:00Z","postSummary":"<p>We are excited to announce that starting today we're offering Object Expiration, a new feature to help you efficiently manage data stored in Amazon S3. Object Expiration allows you to schedule removal of your objects after a defined time period. Using Object Expiration rules to schedule periodic removal of objects eliminates the need to build processes to identify objects for deletion and submit delete requests to Amazon S3.</p>\n<p>You can define Object Expiration rules for a set of objects in your bucket. Each Object Expiration rule allows you to specify a prefix and an expiration period in days. The prefix field (e.g. “logs/”) identifies the object(s) subject to the expiration rule, and the expiration period specifies the number of days from creation date (i.e. age) after which object(s) should be removed. Once the objects are past their expiration date, they will be queued for deletion. You may create multiple expiration rules for different prefixes. You can use Object Expiration rules on objects stored in both Standard and Reduced Redundancy storage.</p>\n<p>As with standard delete requests, Amazon S3 doesn’t charge you for using Object Expiration. You can start using Object Expiration today through the AWS Management Console or the Amazon S3 API.</p>\n<p>To learn more about Object Expiration, please refer to the <a href=\"http://docs.amazonwebservices.com/AmazonS3/latest/dev/ObjectExpiration.html\">Object Expiration</a> topic in the <a href=\"http://docs.amazonwebservices.com/AmazonS3/latest/dev/\">Amazon S3 Developer Guide</a>.</p>","contentType":"Launch Announcement","headline":"Amazon S3 announces Object Expiration"}
{"id":"whats-new#about-aws-whats-new-2011-12-21-amazon-elastic-mapreduce-announces-support-for-cc2-8xlarge-instances","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/12/21/amazon-elastic-mapreduce-announces-support-for-cc2-8xlarge-instances/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:26+0000","dateUpdated":"2020-12-30T21:06:41+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2019-10-06T04:47:18Z","headlineUrl":"/about-aws/whats-new/2011/12/21/amazon-elastic-mapreduce-announces-support-for-cc2-8xlarge-instances/","postDateTime":"2011-12-21T20:00:00Z","postSummary":"<p>We are excited to announce Amazon Elastic MapReduce support for the new Amazon EC2 Cluster Compute instance, Cluster Compute Eight Extra Large (cc2.8xlarge). Like other Cluster Compute instances, cc2.8xlarge instances are optimized for high performance computing, giving customers very high CPU capabilities and the ability to launch instances within a high bandwidth, low latency, full bisection bandwidth network. cc2.8xlarge instances provide customers with more than 2.5 times the CPU performance of the first Cluster Compute instance (cc1.4xlarge) instance, more memory, and more local storage at a very compelling cost. Please visit the <a href=\"http://aws.amazon.com/elasticmapreduce/#instance\">Instance Types</a> section of the Amazon Elastic MapReduce detail page for more details.</p>\n<p>In addition, we are pleased to announce an over <b>18%</b> reduction in Amazon Elastic MapReduce pricing for cc1.4xlarge instances, dropping the total per hour cost to <b>$1.57</b>. Please visit the Amazon Elastic MapReduce <a href=\"https://aws.amazon.com/elasticmapreduce/pricing\">pricing page</a> for more details.</p>","contentType":"Launch Announcement","headline":"Amazon Elastic MapReduce Announces Support for cc2.8xlarge Instances, Reduced Pricing for cc1.4xlarge Instances"}
{"id":"whats-new#about-aws-whats-new-2011-12-21-multiple-network-interfaces","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/12/21/Multiple-Network-Interfaces/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:34+0000","dateUpdated":"2020-12-30T21:05:48+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2019-10-06T04:47:18Z","headlineUrl":"/about-aws/whats-new/2011/12/21/Multiple-Network-Interfaces/","postDateTime":"2011-12-21T20:00:00Z","postSummary":"<p>We are excited to announce support for Elastic Network Interfaces in Amazon VPC.  Elastic Network Interfaces are virtual network interfaces that can be attached to EC2 instances in your VPC. You can use Elastic Network Interfaces to run dual-homed network appliances in your VPC or create a back-end management network for your public facing instances.  You can also move an Elastic Network Interface from one instance to another and network traffic to that interface will be directed to the new instance.</p>\n<p>Please visit the <a href=\"http://docs.amazonwebservices.com/AWSEC2/latest/UserGuide/using-eni.html\">EC2 User Guide</a> for more information on using Elastic Network Interfaces in Amazon VPC.</p>","contentType":"Launch Announcement","headline":"Amazon VPC Adds Support for Multiple Network Interfaces"}
{"id":"whats-new#about-aws-whats-new-2011-12-14-announcing-the-south-america-sao-paulo-region","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/12/14/announcing-the-south-america-sao-paulo-region/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:59+0000","dateUpdated":"2020-12-30T21:07:45+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2019-10-06T04:47:18Z","headlineUrl":"/about-aws/whats-new/2011/12/14/announcing-the-south-america-sao-paulo-region/","postDateTime":"2011-12-14T20:00:00Z","postSummary":"<p>\nAWS is excited to announce its new South America (Sao Paulo) Region.  Starting today, South America-based businesses and global companies with customers in South America can run their applications and workloads in the new Sao Paulo Region. This new Region significantly reduces latency to end-users in South America and allows those needing their data to reside in Brazil to easily do so.\n</p>\n<p>The new Sao Paulo Region is currently available for multiple services, including: Amazon Elastic Compute Cloud (Amazon EC2), Amazon Simple Storage Service (Amazon S3), Amazon Elastic Block Store (Amazon EBS), Amazon SimpleDB, Amazon Relational Database Service (Amazon RDS), Amazon Simple Queue Service (Amazon SQS), Amazon Simple Notification Service (Amazon SNS), Amazon Virtual Private Cloud (Amazon VPC), Elastic Load Balancing, Amazon Elastic MapReduce, Auto Scaling, AWS CloudFormation, and Amazon CloudWatch. For Sao Paulo Region pricing, please see the detail page for each service at <a href=\"http://aws.amazon.com/products\">http://aws.amazon.com/products</a>.</p>\n<p>AWS now operates eight Regions worldwide serving customers from over 190 countries. You can learn more about AWS’s growing global infrastructure footprint at <a href=\"http://aws.amazon.com/about-aws/globalinfrastructure\">http://aws.amazon.com/about-aws/globalinfrastructure</a>.  </p>\n<p>\nThe newly launched Sao Paulo Region is now available for any business or software developer to sign up and get started today at <a href=\"http://aws.amazon.com\">http://aws.amazon.com</a> and <a href=\"http://aws.amazon.com/pt\">http://aws.amazon.com/pt/</a>. \n</p>","contentType":"Launch Announcement","headline":"Announcing the South America (Sao Paulo) Region"}
{"id":"whats-new#about-aws-whats-new-2011-12-13-amazon-simple-email-service-gets-simpler-with-smtp","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/12/13/amazon-simple-email-service-gets-simpler-with-smtp/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:51:34+0000","dateUpdated":"2020-12-30T21:03:56+0000","whats-new_year":"2011","GLOBAL_content-type":"Launch Announcement","modifiedDate":"2019-10-06T04:47:19Z","headlineUrl":"/about-aws/whats-new/2011/12/13/amazon-simple-email-service-gets-simpler-with-smtp/","postDateTime":"2011-12-13T20:00:00Z","postSummary":"<p>\nWe’re excited to announce that we have added support for Simple Mail Transfer Protocol (SMTP) to <a href=\"http://aws.amazon.com/ses/\">Amazon Simple Email Service (Amazon SES)</a>, AWS’s highly scalable and cost-effective bulk and transactional email-sending service for businesses and developers.  It is now much easier to configure your programs and applications to send email via Amazon SES. Using your existing systems and SMTP, you don’t have to write a single line of code to send your email. \n</p>\n<p>To use this feature:</p>\n<ol>\n<li>Log into the <a href=\"http://aws.amazon.com/console\">AWS Management Console</a>.</li>\n<li>In the SES tab, select <b>SMTP Settings</b> and click on <b>Create a New SMTP User</b>.</li>\n<li>Use the default User Name or edit this name and click <b>Create</b>.</li>\n<li>Copy your credentials or click on <b>Download Credentials</b>.</li>\n<li>Use these credentials with the settings in <b>SMTP Settings</b> to configure your program or system to send through the Amazon SES SMTP interface.</li>\n</ol>\n\n<p>\nOf course, you can continue to send email via our API as well, so you can use whichever method works best for you.\n</p>\n<p>\nWe encourage you to try this new feature today, and let us know what you think by visiting the <a href=\"https://forums.aws.amazon.com/forum.jspa?forumID=90\">Amazon SES forum</a>. For more information, please refer to the <a href=\"http://docs.amazonwebservices.com/ses/latest/DeveloperGuide/index.html?SMTP.html\">Amazon SES Developer Guide</a>.\n</p>","contentType":"Launch Announcement","headline":"Amazon Simple Email Service Gets Simpler with SMTP"}
{"id":"whats-new#about-aws-whats-new-2011-12-11-amazon-elastic-mapreduce-ami-versioning-vpc","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/12/11/amazon-elastic-mapreduce-ami-versioning-vpc/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:14+0000","dateUpdated":"2020-12-30T21:08:34+0000","whats-new_year":"2011","GLOBAL_content-type":"Launch Announcement","modifiedDate":"2019-10-06T04:47:19Z","headlineUrl":"/about-aws/whats-new/2011/12/11/amazon-elastic-mapreduce-ami-versioning-vpc/","postDateTime":"2011-12-11T20:00:00Z","postSummary":"<p>We are pleased to announce a number of exciting new Amazon Elastic MapReduce features. Starting today you can run your job flows using Hadoop 0.20.205 and Pig 0.9.1. To simplify the upgrade process, we have also introduced the concept of AMI versions. You can now provide a specific AMI version to use at job flow launch or specify that you would like to use our “latest” AMI, ensuring that you are always using our most up-to-date features. Please visit the <a href=\"http://docs.amazonwebservices.com/ElasticMapReduce/latest/DeveloperGuide/index.html?EnvironmentConfig_AMIVersion.html\">AMI Versioning</a> section in the Elastic MapReduce Developer Guide for more information.\nIn addition, we are excited to announce support for running job flows in an Amazon Virtual Private Cloud (Amazon VPC), making it easier to process sensitive data as well as access resources on your internal network. Please visit the <a href=\"http://docs.amazonwebservices.com/ElasticMapReduce/latest/DeveloperGuide/index.html?EnvironmentConfig_VPC.html\">Running Job Flows on an Amazon VPC</a> section in the Elastic MapReduce Developer Guide for more information.\n</p>","contentType":"Launch Announcement","headline":"Amazon Elastic MapReduce Announces Support for New Hadoop and Pig Versions, AMI Versioning, and Amazon VPC"}
{"id":"whats-new#about-aws-whats-new-2011-12-07-amazon-s3-announces-multi-object-delete","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/12/07/amazon-s3-announces-multi-object-delete/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:55+0000","dateUpdated":"2020-12-30T21:01:50+0000","whats-new_year":"2011","GLOBAL_content-type":"Launch Announcement","modifiedDate":"2019-10-06T04:47:19Z","headlineUrl":"/about-aws/whats-new/2011/12/07/amazon-s3-announces-multi-object-delete/","postDateTime":"2011-12-07T20:00:00Z","postSummary":"<p>We are excited to announce Multi-Object Delete, a new Amazon S3 feature that allows you to delete up to 1,000 objects with a single request. This speeds up your deletes by reducing the number of request roundtrips between your application and Amazon S3. You can use this feature to remove large numbers of objects from Amazon S3 more quickly than using multiple individual DELETE requests.</p>\n<p>Multi-Object Delete is immediately available in all Amazon S3 Regions free of charge. This feature is supported in both the Amazon S3 API and the AWS SDKs. To learn more about Multi-Object Delete and get started today, please visit the <a href=\"http://docs.amazonwebservices.com/AmazonS3/latest/dev/DeletingObjects.html\">Amazon S3 Developer Guide</a>. To learn more about Amazon S3, please visit the Amazon S3 detail page at: <a href=\"http://aws.amazon.com/s3/\">http://aws.amazon.com/s3/.</a></p>","contentType":"Launch Announcement","headline":"Amazon S3 announces Multi-Object Delete"}
{"id":"whats-new#about-aws-whats-new-2011-12-06-cloudfront-route-53-add-new-york-indiana-san-jose-locations","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/12/06/cloudfront-route-53-add-new-york-indiana-san-jose-locations/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:51:14+0000","dateUpdated":"2020-12-30T21:02:55+0000","whats-new_year":"2011","GLOBAL_content-type":"Launch Announcement","modifiedDate":"2019-10-06T04:47:19Z","headlineUrl":"/about-aws/whats-new/2011/12/06/cloudfront-route-53-add-new-york-indiana-san-jose-locations/","postDateTime":"2011-12-06T20:00:00Z","postSummary":"<p>We’re excited to announce the launch of new edge locations in South Bend, IN and San Jose, CA to serve Amazon CloudFront and Amazon Route 53 customers. We have also added a second edge location in New York, NY in order to increase connectivity and to provide even better service for our customers.</p>\n<p>With the launches in South Bend and San Jose and the addition of the second New York edge location, CloudFront and Route 53 now have a total of 24 edge locations worldwide. Each new edge location helps lower latency and improves performance for your end users. We plan to continue to add new edge locations worldwide.</p>\n<p>To learn more about <a href=\"/content/aws.amazon.com/live/en_US/cloudfront.html\">Amazon CloudFront</a> and <a href=\"/content/aws.amazon.com/live/en_US/route53.html\">Amazon Route 53</a>, visit their respective product detail pages on our website.</p>","contentType":"Launch Announcement","headline":"Amazon CloudFront & Amazon Route 53 Add Three New Edge Locations"}
{"id":"whats-new#about-aws-whats-new-2011-12-05-amazon-elasticache-new-regions","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/12/05/amazon-elasticache-new-regions/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:27+0000","dateUpdated":"2020-06-04T04:36:44+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2020-03-27T17:49:43Z","headlineUrl":"/about-aws/whats-new/2011/12/05/amazon-elasticache-new-regions/","postDateTime":"2011-12-05T20:00:00Z","postSummary":"<p>We are excited to announce the the immediate availability of <a href=\"/content/aws.amazon.com/live/en_US/elasticache.html\">Amazon ElastiCache</a> in four additional Regions: US West (N. California), EU West (Dublin), Asia Pacific (Singapore), and Asia Pacific (Tokyo). Starting today, you can use Amazon ElastiCache in these Regions to add an in-memory cache to your application architecture in a matter of minutes.</p>\n<p>In addition, we are pleased to announce that you can now configure, provision, and deploy Amazon ElastiCache using <a href=\"/content/aws.amazon.com/live/en_US/cloudformation.html\">Amazon CloudFormation</a> templates. These templates allow you to create and provision a collection of AWS resources in an orderly and predictable way.</p>\n<p>To learn more about <a href=\"/content/aws.amazon.com/live/en_US/elasticache.html\">Amazon ElastiCache</a>, please sign up for our December 6th Webinar: <a href=\"https://www.youtube.com/watch?v=hwBkMfm30Os\">“Turbo-charge your apps using Amazon ElastiCache”</a>. You can also easily get started with <a href=\"/content/aws.amazon.com/live/en_US/elasticache.html\">Amazon ElastiCache</a> by viewing a <a href=\"https://docs.aws.amazon.com/AmazonElastiCache/latest/red-ug/Tutorials.html\">quick demo</a>, reviewing the <a href=\"/content/aws.amazon.com/live/en_US/elasticache/getting-started.html\">Getting Started Guide</a>, and launching a pre-configured cache cluster in minutes.</p>\n","contentType":"Launch Announcement","headline":"Amazon ElastiCache is now available in four additional AWS Regions and as a CloudFormation template"}
{"id":"whats-new#about-aws-whats-new-2011-12-01-new-amazon-ec2-reserved-instances-options-now-available","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/12/01/New-Amazon-EC2-Reserved-Instances-Options-Now-Available/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:09+0000","dateUpdated":"2020-12-30T21:01:36+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2019-10-06T04:47:19Z","headlineUrl":"/about-aws/whats-new/2011/12/01/New-Amazon-EC2-Reserved-Instances-Options-Now-Available/","postDateTime":"2011-12-01T20:00:00Z","postSummary":"<p>We’re excited to introduce two new Reserved Instance (“RI”) options -- Light Utilization and Heavy Utilization Reserved Instances. Along with the existing Reserved Instance type we’ve offered for the last several years (renamed Medium Utilization Reserved Instances), these three Reserved Instance types (described below) enable you to you to balance the amount you pay upfront with your effective hourly price. </p>\n<ul>\n<li>\n<b>Light Utilization RIs</b> – Light Utilization RIs offer the lowest upfront payment of all of the Reserved Instance types.  Along with this low upfront payment, you’ll receive a significantly discounted hourly usage fee.  Light Utilization RIs allow you to turn off your instance at any point and not pay the hourly fee.  Light Utilization RIs are ideal for periodic workloads that only run a couple of hours a day, a few days per week, or very sporadically (like Disaster Recovery where they hardly ever are needed, but when they are, you must be sure you have the reserved capacity to handle).  Using Light Utilization RIs, you can save up to 28% for a 1-year term and 34% for a 3-year term vs. running On-Demand Instances.   If you’re trying to find a break-even utilization, you’re economically advantaged using Light Utilization RIs (vs. On-Demand Instances) if you plan to use your instance more than 32% of a 1-year term or 17% of a 3-year term.   </li>\n<li>\n<b>Medium Utilization RIs</b> – Medium Utilization RIs are the exact same Reserved Instances that EC2 has offered for the last several years.  They  have a higher upfront payment than Light Utilization RIs, but a much lower hourly usage fee.  Medium Utilization RIs allow you to turn off your instance at any point and not pay the hourly fee.  Medium Utilization RIs are best suited for workloads that run most of the time, but have some variability in usage (like web server traffic where demand may increase or decrease throughout the year). Using Medium Utilization RIs, you can save up to 34% for a 1-year term and 49% for a 3-year term vs. running On-Demand Instances.   If you’re trying to find a break-even utilization, you’re economically advantaged using Medium Utilization RIs (vs. On-Demand Instances) if you plan to use your instance more than 49% of a 1-year term or 24% of a 3-year term. </li>\n<li>\n<b>Heavy Utilization RIs</b> – Heavy Utilization RIs offer the most absolute savings of any Reserved Instance type.  They’re most appropriate for steady-state workloads where you’re willing to commit to always running these instances in exchange for our lowest hourly usage fee. With this RI, you pay a little higher upfront payment than Medium Utilization RIs, a significantly lower hourly usage fee, and you’re charged that lower hourly rate for every hour in the Reserved Instance term you purchase.   Using Heavy Utilization RIs, you can save up to 41% for a 1-year term and 58% for a 3-year term vs. running On-Demand Instances.   If you’re trying to find a break-even utilization, you’re economically advantaged using Heavy Utilization RIs (vs. On-Demand Instances) if you plan to use your instance more than 85% of a 1-year term or 79% of a 3-year term.</li>\n</ul>\n\n<p>You can start lowering your costs today by matching your application’s usage pattern with the pricing model that works best for you. To learn more about this feature and other Amazon EC2 pricing options, please visit the <a href=\"/content/aws.amazon.com/live/en_US/ec2/pricing.html\">Amazon EC2 Pricing</a> and the <a href=\"/content/aws.amazon.com/live/en_US/ec2/reserved-instances.html\">Amazon EC2 Reserved Instance Page</a>.</p>","contentType":"Launch Announcement","headline":"New Amazon EC2 Reserved Instance Options Now Available"}
{"id":"whats-new#about-aws-whats-new-2011-11-21-announcing-elastic-load-balancing-in-amazon-vpc","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/11/21/announcing-elastic-load-balancing-in-amazon-vpc/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:16+0000","dateUpdated":"2020-12-30T21:08:28+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2019-10-06T04:47:19Z","headlineUrl":"/about-aws/whats-new/2011/11/21/announcing-elastic-load-balancing-in-amazon-vpc/","postDateTime":"2011-11-21T20:00:00Z","postSummary":"<p>We are excited to announce that you can now use Elastic Load Balancing with Amazon Virtual Private Cloud (VPC).  The same easy-to-use features of Elastic Load Balancing are available in VPC, such as SSL termination, health checks, sticky sessions, and CloudWatch monitoring.  IPv6 support is not available in VPC at this time.  In addition to these features, when you provision an Elastic Load Balancer for your VPC, you can now assign security groups to your Elastic Load Balancer.  In addition, you can register instances with your Elastic Load Balancer without having public IP addresses assigned to the instances in your VPC.  Elastic Load Balancing will continue to distribute traffic across multiple Availability Zones if you have subnets allocated in more than one Availability Zone.</p>\n<p>To learn more, please visit the <a href=\"/content/aws.amazon.com/live/en_US/elasticloadbalancing.html\">Elastic Load Balancing</a> and <a href=\"/content/aws.amazon.com/live/en_US/vpc.html\">VPC</a> web pages.</p>","contentType":"Launch Announcement","headline":"Announcing Elastic Load Balancing in Amazon VPC"}
{"id":"whats-new#about-aws-whats-new-2011-11-21-aws-elastic-beanstalk-adds-support-for-aws-identity-access-management","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/11/21/aws-elastic-beanstalk-adds-support-for-aws-identity-access-management/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:11+0000","dateUpdated":"2020-12-30T21:00:49+0000","whats-new_year":"2011","GLOBAL_content-type":"Launch Announcement","modifiedDate":"2019-10-06T04:47:19Z","headlineUrl":"/about-aws/whats-new/2011/11/21/aws-elastic-beanstalk-adds-support-for-aws-identity-access-management/","postDateTime":"2011-11-21T20:00:00Z","postSummary":"<p>\nWe are excited to announce the availability of AWS Identity and Access Management (IAM) support for AWS Elastic Beanstalk. <a href=\"http://aws.amazon.com/elasticbeanstalk/\">AWS Elastic Beanstalk</a> provides a quick way to deploy and manage applications in the AWS cloud. <a href=\"http://aws.amazon.com/iam/\">IAM</a> enables you to manage permissions for multiple users within your AWS account.\n</p>\n<p>\nIAM offers you greater flexibility and access controls when using Elastic Beanstalk. For example, you can create groups of users for developers and quality assurance (QA) engineers. The developers group can be granted permissions to create application versions and deploy them to running environments, while the QA group would be granted read-only access, allowing them to see all running environments and all events, to help with testing and debugging.\n</p>\n<p>\nTo learn more about using IAM with Elastic Beanstalk, please visit the Elastic Beanstalk <a href=\"http://docs.amazonwebservices.com/elasticbeanstalk/latest/dg/AWSHowTo.iam.html\">Developer Guide</a>.\n</p>","contentType":"Launch Announcement","headline":"AWS Elastic Beanstalk Adds Support for AWS Identity & Access Management"}
{"id":"whats-new#about-aws-whats-new-2011-11-17-aws-management-console-adds-support-for-amazon-route-53","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/11/17/aws-management-console-adds-support-for-amazon-route-53/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:18+0000","dateUpdated":"2020-12-30T21:03:31+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2019-10-06T04:47:20Z","headlineUrl":"/about-aws/whats-new/2011/11/17/aws-management-console-adds-support-for-amazon-route-53/","postDateTime":"2011-11-17T20:00:00Z","postSummary":"<p>We're excited to announce today that we've added support for Amazon Route 53 to the AWS Management Console. Amazon Route 53 is AWS’s highly available and cost-effective Domain Name System (DNS) service. Using a global network of servers, Route 53 improves the reliability and performance of your website for customers worldwide. The AWS Management Console provides a simple, point-and-click web interface that makes it even easier for you to configure and manage your domains with Amazon Route 53. With AWS Management Console support, you can get started with Amazon Route 53 faster than ever. Access to the AWS Management Console is provided free of charge at <a href=\"/content/aws.amazon.com/live/en_US/console.html\">http://aws.amazon.com/console</a>.</p>","contentType":"Launch Announcement","headline":"AWS Management Console Adds Support for Amazon Route 53"}
{"id":"whats-new#about-aws-whats-new-2011-11-14-announcing-new-ec2-cluster-compute-instance","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/11/14/announcing-new-ec2-cluster-compute-instance/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:16+0000","dateUpdated":"2020-12-30T21:00:52+0000","whats-new_year":"2011","GLOBAL_content-type":"Launch Announcement","modifiedDate":"2019-10-06T04:47:20Z","headlineUrl":"/about-aws/whats-new/2011/11/14/announcing-new-ec2-cluster-compute-instance/","postDateTime":"2011-11-14T20:00:00Z","postSummary":"<p>We are very excited to announce the Public Beta of a new Amazon EC2 Cluster Compute instance, Cluster Compute Eight Extra Large (cc2.8xlarge). Like other Cluster Compute instances, cc2.8xlarge instances are optimized for high performance computing (HPC), giving customers very high CPU capabilities and the ability to launch instances within a high bandwidth, low latency, full bisection bandwidth network.  Customers can use Cluster Compute instances for physics simulations, seismic analysis, drug design, genome analysis, aircraft design and a variety of business computing and analytics applications, including Amazon Elastic MapReduce. cc2.8xlarge instances enable customers to achieve <a href=\"http://i.top500.org/system/177457\">supercomputing class performance</a> while continuing to take advantage of the elasticity, flexibility and cost benefits of Amazon EC2.</p>\n<p>To learn more about Cluster Compute instances and High Performance Computing with Amazon EC2, please visit <a href=\"/content/aws.amazon.com/live/en_US/hpc-applications.html\">http://aws.amazon.com/hpc</a></p>","contentType":"Launch Announcement","headline":"Announcing New Amazon EC2 Cluster Compute Instance"}
{"id":"whats-new#about-aws-whats-new-2011-11-11-aws-publishes-new-service-organization-controls-1-report","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/11/11/aws-publishes-new-service-organization-controls-1-report/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:13+0000","dateUpdated":"2020-12-30T21:01:02+0000","whats-new_year":"2011","GLOBAL_content-type":"Launch Announcement","modifiedDate":"2019-10-06T04:47:20Z","headlineUrl":"/about-aws/whats-new/2011/11/11/aws-publishes-new-service-organization-controls-1-report/","postDateTime":"2011-11-11T20:00:00Z","postSummary":"<p> Today we announce the publication of the AWS Service Organization Controls 1 (SOC 1), Type 2 report. The audit for this report is conducted in accordance with the SSAE 16 and the ISAE 3402 professional standards. This dual-standard report, the replacement of the SAS 70 report, can meet a broad range of auditing requirements for U.S. and international auditing bodies. The SOC 1 report audit attests that AWS’ control objectives are appropriately designed and that the individual controls defined to safeguard customer data are operating effectively. AWS customers can contact their sales representatives to receive a copy of this report.</p>\n<p>For more information, please visit the <a href=\"http://aws.amazon.com/security/\">AWS Security and Compliance</a> web page.</p>","contentType":"Launch Announcement","headline":"AWS Publishes New Service Organization Controls 1 Report (SSAE 16/ISAE 3402)"}
{"id":"whats-new#about-aws-whats-new-2011-11-08-announcing-new-us-west-oregon-region","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/11/08/Announcing-new-us-west-oregon-region/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:37+0000","dateUpdated":"2020-06-04T04:38:05+0000","whats-new_year":"2011","GLOBAL_content-type":"Launch Announcement","modifiedDate":"2020-05-28T09:52:04Z","headlineUrl":"/about-aws/whats-new/2011/11/08/Announcing-new-us-west-oregon-region/","postDateTime":"2011-11-08T20:00:00Z","postSummary":"<p>AWS is excited to announce the immediate availability of the US West (Oregon) Region, AWS’s newest infrastructure location in the United States.</p>\n<p>Starting today, customers can access the Oregon Region, a new, lower priced Region for the US West. Oregon joins Northern California as AWS’s second US West location and provides businesses a new, low-cost, low latency option for serving customers and applications benefiting from infrastructure located in the Western United States. Businesses can now choose to locate their AWS resources in the Oregon Region, which like other AWS Regions contains multiple redundant Availability Zones for architecting highly available applications.</p>\n<p>The new US West (Oregon) Region is priced approximately 10 percent lower than the existing US West (N. California) Region and equal to the US East (N. Virginia) Region. The new Region provides a broad suite of AWS services, including Amazon Elastic Compute Cloud (Amazon EC2), Amazon Simple Storage Service (Amazon S3), Amazon Elastic Block Store (Amazon EBS), Amazon SimpleDB, Amazon Relational Database Service (Amazon RDS), Amazon Simple Queue Service (Amazon SQS), Amazon Simple Notification Service (Amazon SNS), Amazon Virtual Private Cloud (Amazon VPC), Elastic Load Balancing, Amazon Elastic MapReduce, Auto Scaling, AWS CloudFormation, and Amazon CloudWatch.</p>\n<p>AWS now operates seven Regions worldwide serving customers in over 190 countries. US West (Oregon) is the seventh AWS infrastructure Region, joining US East (N. Virginia), EU West (Dublin), Asia Pacific (Tokyo), Asia Pacific (Singapore), GovCloud (US), and the existing US West (N. California) Region. You can learn more about AWS’s growing global infrastructure footprint at <a href=\"http://aws.amazon.com/about-aws/globalinfrastructure\">http://aws.amazon.com/about-aws/globalinfrastructure</a>.</p>\n","contentType":"Launch Announcement","headline":"Announcing the new US West (Oregon) Region"}
{"id":"whats-new#about-aws-whats-new-2011-11-02-amazon-sns-introduces-sms-text-message-notifications","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/11/02/amazon-sns-introduces-sms-text-message-notifications/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:04+0000","dateUpdated":"2020-12-30T20:57:50+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2019-10-06T04:47:20Z","headlineUrl":"/about-aws/whats-new/2011/11/02/amazon-sns-introduces-sms-text-message-notifications/","postDateTime":"2011-11-02T20:00:00Z","postSummary":"<p>We are excited to announce that Amazon Simple Notification Service now supports SMS text messages as a new method for notifications. SMS (also known as Short Message Service) is one of the most widely used messaging applications in the world. With support for SMS text messaging, Amazon SNS messages can be delivered to SMS-enabled cell phones and smart phones.<br><br>\nAmazon SNS is a web service that makes it easy to send notifications from the cloud to applications or people. It provides developers with a highly scalable, flexible, and cost-effective way to publish messages and have them immediately delivered to any number of subscribers or other applications. Previously Amazon SNS supported message deliveries via http, email or to Amazon SQS queues.<br><br>\nNotifications can now be sent as text messages to cell phones, smart phones or any other device that supports SMS. Amazon CloudWatch users who monitor their applications running on AWS services can receive timely updates for any event of interest or alarm they set. Existing Amazon SNS users who receive content via email can now also have that content delivered to their mobile device. SMS notifications with Amazon SNS can also be used to relay time-critical application events to mobile applications and devices. Mobile applications increasingly deliver and integrate real-time information from a variety of sources, including weather, traffic, social-media updates, and even multi-player games. Developers can easily integrate mobile applications with Amazon SNS today, to send messages and receive notifications over SMS.  This new Amazon SNS feature can be easily accessed from the <a href=\"http://aws.amazon.com/console/\">AWS Management Console</a>. While Amazon SNS is supported in all AWS regions, SMS notification support is currently supported in the US-East region, and will be available in other AWS regions and countries in the coming months.<br><br>\n\nYou can visit the Amazon SNS detail page to learn more about the usage and benefits of the service. You can easily get started by reviewing the SNS Documentation and setup SMS notifications through the console in minutes.\n\nYou can visit the <a href=\"http://aws.amazon.com/sns/\">Amazon SNS detail page</a> to learn more about the usage and benefits of the service. You can easily get started by reviewing the <a href=\"http://aws.amazon.com/documentation/sns/\">SNS Documentation</a> and setup SMS notifications through the console in minutes.\n</p>","contentType":"Launch Announcement","headline":"Amazon SNS Introduces SMS Text Message Notifications"}
{"id":"whats-new#about-aws-whats-new-2011-11-02-announcing-virtual-mfa-support","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/11/02/Announcing-virtual-mfa-support/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:17+0000","dateUpdated":"2021-09-30T22:47:07+0000","whats-new_year":"2011","GLOBAL_content-type":"Launch Announcement","modifiedDate":"2021-09-30T22:46:10Z","headlineUrl":"/about-aws/whats-new/2011/11/02/Announcing-virtual-mfa-support/","postDateTime":"2011-11-02T20:00:00Z","postSummary":"<p>We are excited to announce that AWS Multi-Factor Authentication (AWS MFA) now supports the use of virtual MFA devices. You can now use your existing smartphone, tablet, or computer running any application that supports the open OATH TOTP standard to generate an AWS MFA authentication code. AWS MFA provides an extra level of security for your AWS account, by prompting users for an authentication code in addition to their username and password, before they can sign in to AWS websites. You can optionally enable AWS MFA for your AWS account and for individual <a href=\"/content/aws.amazon.com/live/en_US/iam.html\">AWS Identity and Access Management (IAM)</a> users you have created under your account, and you now have the choice of virtual MFA devices or hardware MFA key fob devices.</p>\r\n<p>For more information, please visit the <a href=\"/content/aws.amazon.com/live/en_US/mfa.html\">AWS MFA web page</a>.</p>\r\n","contentType":"Launch Announcement","headline":"AWS Multi-Factor Authentication adds support for virtual MFA devices"}
{"id":"whats-new#about-aws-whats-new-2011-10-31-amazon-elastic-mapreduce-announces-karmasphere","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/10/31/amazon-elastic-mapreduce-announces-karmasphere/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:11+0000","dateUpdated":"2020-06-04T04:37:48+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2020-05-28T09:51:36Z","headlineUrl":"/about-aws/whats-new/2011/10/31/amazon-elastic-mapreduce-announces-karmasphere/","postDateTime":"2011-10-31T20:00:00Z","postSummary":"<p>We are pleased to announce hourly pricing for Karmasphere Analytics, a graphical, high productivity solution for working with large structured and unstructured data sets on Amazon Elastic MapReduce. By combining the scalability and flexibility of Amazon Elastic MapReduce with the ease-of-use and graphical interface of Karmasphere desktop tools, you can quickly and cost-effectively build powerful Apache Hadoop-based applications to generate insights from your data. Launch new or access existing Amazon Elastic MapReduce job flows directly from the Karmasphere Analyst or Karmasphere Studio desktop tools, all with hourly pricing and no upfront fees or long-term commitments.</p>\n","contentType":"Launch Announcement","headline":"Amazon Elastic MapReduce Announces Hourly Pricing for Karmasphere Analytics"}
{"id":"whats-new#about-aws-whats-new-2011-10-26-aws-management-console-adds-support-for-amazon-ses","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/10/26/aws-management-console-adds-support-for-Amazon-ses/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:44+0000","dateUpdated":"2020-12-30T21:01:43+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2019-10-06T04:47:20Z","headlineUrl":"/about-aws/whats-new/2011/10/26/aws-management-console-adds-support-for-Amazon-ses/","postDateTime":"2011-10-26T20:00:00Z","postSummary":"<p>\nWe are excited to announce the immediate availability of the Management Console for Amazon Simple Email Service (Amazon SES), AWS’s highly scalable and cost-effective bulk and transactional email-sending service for businesses and developers. \n</p>\n<p>The Amazon SES Management Console is a simple and intuitive web-based user interface for Amazon SES that allows you to do the following with a few clicks of your mouse:</p>\n<ul>\n<li>Check your sending quota and usage</li>\n<li>See your Amazon SES bounce, complaint, and rejection metrics over time</li>\n<li>Verify sender email addresses </li>\n<li>Send both formatted and raw test emails</li>\n</ul>\n\n<p>\nOf course, all of this is still available via the API as well, so you can choose whichever method works best for you.\n</p>\n<p>\nFor more information on how to use the <a href=\"http://aws.amazon.com/console\">Amazon SES Management Console</a>, please refer to the <a href=\"http://docs.amazonwebservices.com/ses/latest/DeveloperGuide/\">Amazon SES Developer Guide</a>.\n</p>","contentType":"Launch Announcement","headline":"AWS Management Console Adds Support for Amazon SES"}
{"id":"whats-new#about-aws-whats-new-2011-10-25-aws-announces-import-for-bizspark-licenses-for-ms-server-ec2-instances","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/10/25/aws-announces-import-for-bizspark-licenses-for-ms-server-ec2-instances/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:54+0000","dateUpdated":"2020-12-30T21:01:57+0000","whats-new_general-products":"ec2-windows","whats-new_year":"2011","GLOBAL_content-type":"Launch Announcement","modifiedDate":"2019-10-06T04:47:21Z","headlineUrl":"/about-aws/whats-new/2011/10/25/aws-announces-import-for-bizspark-licenses-for-ms-server-ec2-instances/","postDateTime":"2011-10-25T20:00:00Z","postSummary":"<p>AWS is pleased to announce that starting today, you can import your Microsoft BizSpark licenses for Windows Server and SQL Server products to AWS and use them to launch Amazon EC2 instances. You can then run these products on Amazon EC2 instances at an hourly cost that has been adjusted to reflect the removal of the license charges. In other words, Windows instances will be billed at the Linux/Unix rate under this plan.</p>\n<p>For more information, please visit the <a href=\"http://aws.amazon.com/solutions/global-solution-providers/microsoft/bizspark/\">Microsoft BizSpark on AWS page</a>.</p>","contentType":"Launch Announcement","headline":"AWS Announces the ability to import Microsoft BizSpark licenses for Microsoft Windows Server and SQL Server Amazon EC2 instances"}
{"id":"whats-new#about-aws-whats-new-2011-10-21-amazon-sqs-new-features-delay-queues-message-timers-and-batch-apis","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/10/21/amazon-sqs-new-features-delay-queues-message-timers-and-batch-apis/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:27+0000","dateUpdated":"2020-12-30T21:01:50+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2019-10-06T04:47:21Z","headlineUrl":"/about-aws/whats-new/2011/10/21/amazon-sqs-new-features-delay-queues-message-timers-and-batch-apis/","postDateTime":"2011-10-21T20:00:00Z","postSummary":"<p>\n\nWe are excited to announce three new Amazon SQS features today: delay queues, message timers, and the ability to send or delete multiple messages in a single API call (batch operations). Delay queues can be used to apply a uniform delay to all messages. Alternatively message timers can be used to apply delay to specific messages that can be sent individually, or in a batch.\n<br><br>\nNew support for batch send and delete operations complements the existing batch receive functionality. With batch operations many workloads will benefit from improved single thread message throughput, reduced connection overhead and lower API call latencies.\n<br><br>\nAs distributed applications become larger and more complex, greater scalability and control of message-based systems becomes increasingly important. With support for both queue delays and message timers, a wider array of real world distributed application scenarios can be addressed. With batch APIs, developing Internet-scale distributed applications is easier and more cost effective than ever. \n<br><br>\nThese new features can be easily accessed from the <a href=\"http://console.aws.amazon.com\"> AWS Management Console. </a>\n<br><br></p>","contentType":"Launch Announcement","headline":"Amazon SQS New Features: Delay Queues, Message Timers and Batch APIs"}
{"id":"whats-new#about-aws-whats-new-2011-10-11-announcing-amazon-ec2-spot-integration-with-amazon-vpc","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/10/11/announcing-amazon-ec2-spot-integration-with-amazon-vpc/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:40+0000","dateUpdated":"2020-12-30T21:02:56+0000","whats-new_year":"2011","GLOBAL_content-type":"Launch Announcement","modifiedDate":"2019-10-06T04:47:21Z","headlineUrl":"/about-aws/whats-new/2011/10/11/announcing-amazon-ec2-spot-integration-with-amazon-vpc/","postDateTime":"2011-10-11T20:00:00Z","postSummary":"<p>We are excited to introduce the combination of two popular features, Spot Instances and Amazon Virtual Private Cloud (Amazon VPC). Starting today, you can now bid for unused Amazon EC2 capacity and run those instances within your own Amazon VPC, potentially saving between 50%-66% less than the On-Demand price. By integrating Amazon VPC with Spot Instances, you can provision a private virtual network that you control, including selection of IP address range, creation of subnets, and configuration of route tables and network gateways.</p>\n<p>With this new feature, you can now bid for instances in Amazon VPC when you request a Spot instance. Similar to traditional Spot Instances, customers whose bids exceed the Spot price gain access to the available Spot Instances and run as long as the bid exceeds the Spot Price. Once launched, you can leverage all of the existing Amazon VPC features you use with other Amazon EC2 instances.</p>\n<p>To learn more details about this feature, please visit the <a href=\"http://docs.amazonwebservices.com/AWSEC2/latest/UserGuide/concepts-spot-instances-vpcs.html\">Spot Instances in Amazon VPC Developer’s Guide</a>. For more information about Amazon EC2 Spot Instances or Amazon VPC, please visit the <a href=\"/content/aws.amazon.com/live/en_US/ec2/spot-instances.html\">Amazon EC2 Spot Instance</a> or the <a href=\"/content/aws.amazon.com/live/en_US/vpc.html\">Amazon VPC</a> web pages.</p>","contentType":"Launch Announcement","headline":"Announcing Amazon EC2 Spot Integration with Amazon VPC"}
{"id":"whats-new#about-aws-whats-new-2011-10-06-aws-management-console-adds-support-for-amazon-sqs","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/10/06/aws-management-console-adds-support-for-Amazon-sqs/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:51:43+0000","dateUpdated":"2020-12-30T21:05:43+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2019-10-06T04:47:21Z","headlineUrl":"/about-aws/whats-new/2011/10/06/aws-management-console-adds-support-for-Amazon-sqs/","postDateTime":"2011-10-06T20:00:00Z","postSummary":"<p>\n\nWe’re excited to announce today that we’ve added support for Amazon Simple Queue Service (Amazon SQS) to the AWS Management Console. Amazon SQS offers a reliable and highly scalable queue-based messaging service which supports distributed application and makes it easy to exchange time-sensitive data between components or EC2 instances. The AWS Management Console adds the simplicity of a point-and-click web interface. You can now create queues, set configurations and manage access – all from your browser. The AWS Management Console is available free of charge at: <a href=\"http://console.aws.amazon.com\"> AWS Console </a>\n\n</p>","contentType":"Launch Announcement","headline":"AWS Management Console Adds Support for Amazon SQS"}
{"id":"whats-new#about-aws-whats-new-2011-10-04-amazon-s3-announces-server-side-encryption-support","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/10/04/amazon-s3-announces-server-side-encryption-support/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:04+0000","dateUpdated":"2020-12-30T21:09:30+0000","whats-new_year":"2011","GLOBAL_content-type":"Launch Announcement","modifiedDate":"2019-10-06T04:47:21Z","headlineUrl":"/about-aws/whats-new/2011/10/04/amazon-s3-announces-server-side-encryption-support/","postDateTime":"2011-10-04T20:00:00Z","postSummary":"<p>We are excited to announce that starting today we're offering Server Side Encryption support for Amazon S3. Amazon S3 Server Side Encryption (SSE) enables you to easily encrypt data stored at rest in Amazon S3. Using Amazon S3 SSE, you can encrypt data simply by adding an additional request header when writing the object to Amazon S3. Decryption happens automatically when data is retrieved.</p>\n<p>Amazon S3 Server Side Encryption employs strong multi-factor encryption. Each object is encrypted with a unique key. As an additional safeguard, this key itself is encrypted with a regularly rotated master key. Amazon S3 Server Side Encryption uses one of the strongest block ciphers available -- 256-bit Advanced Encryption Standard (AES-256) -- to encrypt your data.</p>\n<p>You can start using Amazon S3 Server Side Encryption today through the AWS Management Console and the Amazon S3 API.</p>\n<p>To learn more about Amazon S3 Server Side Encryption, please refer to the topic on <a href=\"http://docs.amazonwebservices.com/AmazonS3/latest/dev/UsingEncryption.html\">Using Server Side Encryption</a> in the <a href=\"http://docs.amazonwebservices.com/AmazonS3/latest/dev/\">Amazon S3 Developer Guide</a>. To learn more about how Amazon S3 provides protection for your data, please refer to <a href=\"http://aws.amazon.com/s3/#protecting\">http://aws.amazon.com/s3/#protecting</a>.</p>","contentType":"Launch Announcement","headline":"Amazon S3 announces Server Side Encryption Support"}
{"id":"whats-new#about-aws-whats-new-2011-09-30-new-edge-location-sao-paulo","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/09/30/new-edge-location-sao-paulo/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:55+0000","dateUpdated":"2020-12-30T21:03:50+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2019-10-06T04:47:21Z","headlineUrl":"/about-aws/whats-new/2011/09/30/new-edge-location-sao-paulo/","postDateTime":"2011-09-30T20:00:00Z","postSummary":"<p>We’re excited to announce the launch of our newest edge location in Sao Paulo, Brazil to serve Amazon CloudFront and Amazon Route 53. This is our first edge location in South America and with this location CloudFront and Route 53 now have a total of 20 edge locations worldwide. Each new edge location helps lower latency and improves performance for your end users. We plan to continue to add new edge locations worldwide.</p>\n<p>An edge location in South America has been frequently requested by our customers so we are excited to add this location to our global network. If you’re already using CloudFront or Route 53, you don't need to do anything to your applications as requests are automatically routed to this location when appropriate.</p>\n<p>To learn more about <a href=\"/content/aws.amazon.com/live/en_US/cloudfront.html\">CloudFront</a> and <a href=\"/content/aws.amazon.com/live/en_US/route53.html\">Route 53</a>, visit their respective product detail pages on our website.</p>","contentType":"Launch Announcement","headline":"New Edge Location in Sao Paulo, Brazil for Amazon CloudFront and Amazon Route 53"}
{"id":"whats-new#about-aws-whats-new-2011-09-29-aws-cloudformation-new-features-update-stack-and-iam-support","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/09/29/aws-cloudformation-new-features-update-stack-and-iam-support/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:22+0000","dateUpdated":"2020-12-30T21:04:33+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2019-10-06T04:47:21Z","headlineUrl":"/about-aws/whats-new/2011/09/29/aws-cloudformation-new-features-update-stack-and-iam-support/","postDateTime":"2011-09-29T20:00:00Z","postSummary":"<p>\nWe are excited to announce 4 new features available in AWS CloudFormation today: update of existing stacks, application bootstrapping, template-based AWS Identity and Access Management (IAM) and extensible scripting hooks to react to stack updates on your EC2 instances.\n</p>\n\n<p></p>\n<p>\nSince AWS CloudFormation was first introduced, customers have asked for a way to manage their stacks once they have been created. With this launch, you can now use CloudFormation to modify and update the resources in your existing stacks in a controlled and predictable way. By using templates to manage your stack changes, you have the ability to version control your AWS infrastructure in the same way as you version control the software running on it.\n</p>\n\n<p></p>\n<p>\nAs applications become more complex, it is important to understand the software assets that are deployed to your environment. AWS CloudFormation now allows you to define and deploy packages and files needed on your Amazon EC2 instances along with the AWS resources. You can choose to deploy your application directly, or bootstrap the environment you need with your existing deployment tools such as Opscode Chef or Puppet. In conjunction with extensible scripting hooks, your application can react to stack events and stack updates. This allows you to update software or configuration settings dynamically on your EC2 instances throughout the lifetime of the stack.\n</p>\n\n<p></p>\n<p>\nWith the new ability to define AWS IAM users, groups and access policies in a template, you can now encapsulate your best practice security policies along with the application resources, so that your policies are applied when the application is provisioned.\n</p>\n\n<p></p>\n<p>\nTogether, these features provide a new level of control and management for your AWS infrastructure. To learn more about AWS CloudFormation, please visit the <a href=\"http://aws.amazon.com/cloudformation/\">details page</a>. To understand how to bootstrap applications, react to stack changes and stack updates and to find out how to integrate with tools such as Chef and Puppet, we have written <a href=\"http://aws.amazon.com/cloudformation/aws-cloudformation-articles-and-tutorials/\">whitepapers</a> on ways to bootstrap applications using AWS CloudFormation.\n</p>","contentType":"Launch Announcement","headline":"AWS CloudFormation New Features: Update Stack and IAM Support"}
{"id":"whats-new#about-aws-whats-new-2011-09-27-amazon-route53-hosted-zone-price-change","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/09/27/amazon-route53-hosted-zone-price-change/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:19+0000","dateUpdated":"2020-12-30T21:08:26+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2019-10-06T04:47:21Z","headlineUrl":"/about-aws/whats-new/2011/09/27/amazon-route53-hosted-zone-price-change/","postDateTime":"2011-09-27T20:00:00Z","postSummary":"<p>We are excited to announce that effective October 1st we're reducing prices for Amazon Route 53, Amazon Web Services’ reliable and scalable domain name service. Amazon Route 53 routes end users to your Internet applications by translating human readable names like www.example.com into the numeric IP addresses like 192.0.2.1 that computers use to connect to each other. Effective October 1st, 2011, we’re cutting the price for each hosted zone from $1.00 per month to $0.50 per month for the first 25 zones, and then $0.10 per month for additional zones. </p>","contentType":"Launch Announcement","headline":"Amazon Route 53 Reduces Hosted Zone Pricing"}
{"id":"whats-new#about-aws-whats-new-2011-09-18-windows-for-cluster-instances","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/09/18/windows-for-cluster-instances/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:07+0000","dateUpdated":"2020-12-30T20:57:16+0000","whats-new_general-products":"ec2-windows","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2019-10-06T04:47:21Z","headlineUrl":"/about-aws/whats-new/2011/09/18/windows-for-cluster-instances/","postDateTime":"2011-09-18T20:00:00Z","postSummary":"<p>\n\nWe are excited to announce that starting today customers can run Microsoft Windows Server 2008 R2 and Microsoft Windows SQL Server Standard 2008 R2 on all Amazon EC2 instance types including Cluster Compute and Cluster GPU instances.  \n\nCustomers with IO-intensive or GPU-accelerated general purpose applications that run on Microsoft Windows can now take advantage of high bandwidth, low latency networking, and optionally NVidia Tesla GPUs for applications in areas such as computational finance, business analytics, transcoding and rendering.\n\nCluster Compute and Cluster GPU instances are currently available in the US-East (N. Virginia) region.  For more information, please visit the <a href=\"http://aws.amazon.com/ec2\">Amazon EC2</a> and <a href=\"http://aws.amazon.com/windows\">Amazon EC2 Running Microsoft Windows</a> pages.\n\n\n\n\n</p>","contentType":"Launch Announcement","headline":"Announcing Windows support for Amazon EC2 Cluster Compute and Cluster GPU instances"}
{"id":"whats-new#about-aws-whats-new-2011-09-15-aws-fisma-moderate","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/09/15/aws-fisma-moderate/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:42+0000","dateUpdated":"2020-12-30T21:06:58+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2019-10-06T04:47:22Z","headlineUrl":"/about-aws/whats-new/2011/09/15/aws-fisma-moderate/","postDateTime":"2011-09-15T20:00:00Z","postSummary":"<p>\n\nAWS has received Federal Information Security Management Act (FISMA) Moderate Authorization and Accreditation from the U.S. General Services Administration.  FISMA requires federal agencies to develop, document, and implement an information security system for its data and infrastructure.   Government entities can now utilize AWS infrastructure services while meeting security requirements for applications demanding the stringent security practices of the FISMA Moderate level. This accreditation covers Amazon Elastic Compute Cloud (Amazon EC2), Amazon Simple Storage Service (Amazon S3), Amazon Virtual Private Cloud (Amazon VPC) and the infrastructure upon which they run.  With the addition of FISMA Moderate, the AWS security and compliance framework now covers FISMA Low and Moderate, PCI DSS Level 1, FIPS 140-2, ISO 27001, and SAS-70 type II. AWS also provides an environment that enables businesses to comply with HIPAA regulations.<br><br>\n\nFISMA Moderate Authorization and Accreditation requires AWS to implement and operate an extensive set of security configurations and controls. This includes documenting the management, operational, and technical processes used to secure the physical and virtual infrastructure as well as conducting third party audits. This is the first time AWS has received a FISMA Moderate authority to operate.<br><br>\n \nBy meeting the Federal government’s requirements for FISMA Moderate, agencies can rapidly expand their cloud computing footprint, deploying sensitive government data and applications on AWS while continuing to comply with the government’s unique and rigorous security requirements.<br><br>\n\nAWS continues to provide cloud computing services to the U.S. government through its growing solution provider network.  AWS solution provider and reseller URS-Apptis was awarded an Infrastructure-as-a-Service blanket purchase agreement (BPA) from the U.S. General Services Administration (GSA). AWS is the exclusive technology provider under this agreement. Government agencies can now easily procure on-demand, highly reliable, highly scalable, and cost-efficient technology resources using the GSA IaaS BPA.<br><br>\n  \nTo learn more about Amazon Web Services security certifications, and other AWS security practices, visit <a href=\"http://aws.amazon.com/security\">http://aws.amazon.com/security</a>. To learn more about how AWS works with government agencies, visit <a href=\"http://aws.amazon.com/federal\">http://aws.amazon.com/federal</a> or visit <a href=\"http://aws.amazon.com/govcloud-us\">http://aws.amazon.com/govcloud-us</a> to learn about AWS GovCloud, an AWS Region with additional US Persons only controls.\n\n\n\n\n</p>","contentType":"Launch Announcement","headline":"AWS FISMA Moderate"}
{"id":"whats-new#about-aws-whats-new-2011-09-08-aws-direct-connect-ga-us-west","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/09/08/AWS-Direct-Connect-GA-US-West/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:52:05+0000","dateUpdated":"2020-12-30T21:08:42+0000","whats-new_year":"2011","GLOBAL_content-type":"Launch Announcement","modifiedDate":"2019-10-06T04:47:22Z","headlineUrl":"/about-aws/whats-new/2011/09/08/AWS-Direct-Connect-GA-US-West/","postDateTime":"2011-09-08T20:00:00Z","postSummary":"<p>We’re excited to announce that AWS Direct Connect is now available in the US West (Northern California) Region. Starting today, customers can connect to AWS resources in all Availability Zones in the Northern California Region through the AWS Direct Connect location in the Equinix Silicon Valley colocation facilities. </p>\n<p>AWS Direct Connect offers several benefits for customers:\n</p>\n\n<ul>\n<li>It lowers AWS bandwidth costs, which is valuable for applications that have bulk data transfer requirements</li>\n<li>It offers more consistent network performance for applications that require real-time data feeds</li>\n<li>It provides an alternative means to connect to the AWS cloud for customers who may have security or compliance policies that prevent VPN connectivity to the cloud</li>\n</ul>\n\n<p>To get started with AWS Direct Connect, click <a href=\"https://portal.aws.amazon.com/gp/aws/html-forms-controller/contactus/Direct_Connect_Service_Request\">here</a> to complete a sign-up form indicating your connection requirements (primarily the number of connections you require and connection bandwidth). AWS will contact you, usually within one business day. </p>\n<p>Additional AWS Direct Connect locations are planned for Los Angeles, London, Tokyo and Singapore in the next several months. For more details, including pricing, please refer to the <a href=\"http://aws.amazon.com/directconnect\">AWS Direct Connect</a> page and a list of <a href=\"http://aws.amazon.com/directconnect/faqs\">frequently asked questions</a>. </p>","contentType":"Launch Announcement","headline":"AWS Direct Connect announces general availability in the US West Region"}
{"id":"whats-new#about-aws-whats-new-2011-09-08-announcing-the-aws-toolkit-for-visual-studio","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/09/08/announcing-the-aws-toolkit-for-visual-studio/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:51:42+0000","dateUpdated":"2020-12-30T20:57:58+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","whats-new_resource-development-language":"dotnet","modifiedDate":"2019-10-06T04:47:22Z","headlineUrl":"/about-aws/whats-new/2011/09/08/announcing-the-aws-toolkit-for-visual-studio/","postDateTime":"2011-09-08T20:00:00Z","postSummary":"<p>The AWS Toolkit for Visual Studio is an extension for Microsoft Visual Studio that makes it easier for developers to develop, debug, and deploy .NET applications using Amazon Web Services. With the AWS Toolkit for Visual Studio, you’ll be able to get started faster and be more productive when building AWS applications, all from within the context of Visual Studio. </p>\n<ul>\n<li>\n<strong>AWS Explorer</strong> – Easily access and administer your entire AWS infrastructure, including Amazon S3, Amazon EC2, Amazon SimpleDB, AWS Identity and Access Management, AWS CloudFormation, Amazon SNS, and Amazon SQS.</li>\n  <li>\n<strong>Multiple AWS Account Support</strong> – Configure and easily switch between multiple AWS accounts (or IAM Users) during development.</li>\n<li>\n<strong>AWS CloudFormation Deployment</strong>- Easily deploy your existing ASP.NET web applications to the AWS cloud using AWS CloudFormation.  The included templates help you create a single instance application, or a load balanced, multi-AZ application, right from your Visual Studio environment.</li>\n</ul>\n<a href=\"/content/aws.amazon.com/live/en_US/visualstudio.html\">http://aws.amazon.com/visualstudio</a>","contentType":"Launch Announcement","headline":"Announcing the AWS Toolkit for Visual Studio "}
{"id":"whats-new#about-aws-whats-new-2011-09-07-mobile-sdks-support-credential-management","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/09/07/mobile-sdks-support-credential-management/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:07+0000","dateUpdated":"2020-12-30T21:01:54+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2019-10-06T04:47:22Z","headlineUrl":"/about-aws/whats-new/2011/09/07/mobile-sdks-support-credential-management/","postDateTime":"2011-09-07T20:00:00Z","postSummary":"<p>Amazon Web Services is pleased to announce two mobile SDKs exiting beta:</p>\n<ul>\n<li><a href=\"http://aws.amazon.com/sdkforandroid\">AWS SDK for Android</a></li>\n          <li><a href=\"http://aws.amazon.com/sdkforios\">AWS SDK for iOS</a></li>\n\t</ul>\n\n<p>AWS mobile SDKs make it easier for software developers to call an AWS web service API directly from a mobile application. This release provides support for the following AWS web service APIs: <strong>Amazon Elastic Compute Cloud (EC2), Auto Scaling, Elastic Load Balancing, Amazon S3, Amazon SimpleDB, Amazon Simple Notification Service (SNS), Amazon Simple Queue Service (SQS), Amazon Simple Email Service (SES), and Amazon CloudWatch</strong>.</p>\n<p>Additionally, this release provides examples that show how to more securely access Amazon Web Services using a token vending machine which distributes temporary security credentials to the mobile application.</p>\n<p>Examples of applications that developers can build with the mobile SDKs include:</p>\n<ul>\n<li>A media application that uploads photos, videos, and more to Amazon S3 for world-wide distribution through Amazon CloudFront.</li>\n\t  <li>A social game that shares moves, high scores, and other data between devices using Amazon SimpleDB. </li>\n\t  <li>A messaging client that broadcasts messages between devices using Amazon SQS and Amazon SNS, without requiring any additional server infrastructure.</li>\n\t</ul>\n\n<br>\n<br>\n<p>Learn more about the AWS SDK for Android at <a href=\"http://aws.amazon.com/sdkforandroid\">http://aws.amazon.com/sdkforandroid</a>.</p>\n<p>Learn more about the AWS SDK for iOS at <a href=\"http://aws.amazon.com/sdkforios\">http://aws.amazon.com/sdkforios</a>.</p>\n<p>Learn more about using the token vending machine at <a href=\"http://aws.amazon.com/articles/4611615499399490\">http://aws.amazon.com/articles/4611615499399490</a>.</p>\n<p>See all resources for mobile development at <a href=\"http://aws.amazon.com/mobile\">http://aws.amazon.com/mobile</a>.</p>","contentType":"Launch Announcement","headline":"AWS Mobile SDKs Exit Beta With Support for Credential Management"}
{"id":"whats-new#about-aws-whats-new-2011-08-24-announcing-vm-import-new-features","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/08/24/Announcing-VM-Import-New-Features/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:36+0000","dateUpdated":"2020-12-30T21:07:53+0000","whats-new_year":"2011","GLOBAL_content-type":"Launch Announcement","whats-new_resource-operating-system":"windows","modifiedDate":"2019-10-06T04:47:22Z","headlineUrl":"/about-aws/whats-new/2011/08/24/Announcing-VM-Import-New-Features/","postDateTime":"2011-08-24T20:00:00Z","postSummary":"<p> We are excited to announce support for new operating systems and virtualization platforms for VM Import. </p>\n<p>VM Import now supports Windows Server 2003 R2 in addition to existing support for Windows Server 2008 (DataCenter, Standard and Enterprise Editions). In addition, VM Import now supports the VHD image format, which is compatible with the Citrix Xen and Microsoft Hyper-V virtualization platforms. With these new capabilities, we have made it even easier for enterprises to leverage their existing investments in operating systems within Amazon EC2.  </p>\n<p>VM Import is available at no additional charge beyond standard usage charges for Amazon EC2 and Amazon S3. For more information, including links to documentation, developer resources and tools, please refer to the <a href=\"http://aws.amazon.com/ec2/vmimport\">VM Import</a> product page.</p>","contentType":"Launch Announcement","headline":"VM Import announces support for Windows Server 2003 and new virtualization platforms"}
{"id":"whats-new#about-aws-whats-new-2011-08-22-announcing-amazon-elasticache","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/08/22/announcing-amazon-elasticache/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:51:43+0000","dateUpdated":"2020-06-04T04:36:03+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2020-03-27T17:49:18Z","headlineUrl":"/about-aws/whats-new/2011/08/22/announcing-amazon-elasticache/","postDateTime":"2011-08-22T20:00:00Z","postSummary":"<p>We are excited to announce the public beta launch of <a href=\"/content/aws.amazon.com/live/en_US/elasticache.html\">Amazon ElastiCache</a>, a new web service that makes it easy to deploy, operate, and scale an in-memory cache in the cloud. The service improves the performance of web applications by allowing you to retrieve information from a fast, managed, in-memory caching system, instead of relying entirely on slower disk-based databases. Amazon ElastiCache is protocol-compliant with Memcached, a widely adopted memory object caching system, so code, applications, and tools that you use today with your existing Memcached environments will work seamlessly with the service. Amazon ElastiCache simplifies and offloads the management, monitoring, and operation of in-memory cache environments, enabling you to focus on the differentiating parts of your applications. The service is ideal for many read-heavy application workloads (such as social networking, gaming, media sharing and Q&amp;A portals) or compute-intensive workloads (such as a recommendation engine).<br>\n<br>\nPricing for Amazon ElastiCache is based on the size of the Cache Nodes used and begins as low as $0.095 per hour. The service is currently available in the US East (Virginia) Region, and will be available in other AWS Regions in the coming months. You can visit the <a href=\"/content/aws.amazon.com/live/en_US/elasticache.html\">Amazon ElastiCache page</a> to learn more about the benefits of the service. You can easily get started by viewing a <a href=\"https://docs.aws.amazon.com/AmazonElastiCache/latest/red-ug/Tutorials.html\">quick demo</a> or reviewing the <a href=\"/content/aws.amazon.com/live/en_US/elasticache/getting-started.html\">Getting Started Guide</a>, and launch a pre-configured Cache Cluster in minutes.</p>\n","contentType":"Launch Announcement","headline":"Announcing Amazon ElastiCache"}
{"id":"whats-new#about-aws-whats-new-2011-08-18-amazon-elastic-mapreduce-now-supports-spot-instances","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/08/18/amazon-elastic-mapreduce-now-supports-spot-instances/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:28+0000","dateUpdated":"2020-12-30T21:02:50+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2019-10-06T04:47:22Z","headlineUrl":"/about-aws/whats-new/2011/08/18/amazon-elastic-mapreduce-now-supports-spot-instances/","postDateTime":"2011-08-18T20:00:00Z","postSummary":"\n    Starting today, customers have the ability to run their Amazon Elastic MapReduce applications on Spot Instances, significantly reducing the cost of processing vast amounts of data on managed Apache Hadoop clusters. Customers can run their Elastic MapReduce applications entirely on Spot Instances to enjoy the largest potential cost savings or they can easily mix Spot Instances with On-Demand and/or Reserved Instances to protect against cluster failure due to Spot Instances being outbid. \n<br><br>\nTo see how customers have reduced their data analytics costs by over 50% through the use of Spot Instances, please view the <a href=\"/content/aws.amazon.com/live/en_US/solutions/case-studies/foursquare.html\">foursquare®</a>, <a href=\"/content/aws.amazon.com/live/en_US/solutions/case-studies/fliptop.html\">Fliptop</a> and <a href=\"/content/aws.amazon.com/live/en_US/solutions/case-studies/so-net.html\">So-net</a> case studies. Other use cases for Spot Instances with Amazon Elastic MapReduce include scaling out to increase the speed of application execution, trading flexibility in the time of completion for cost savings, and reducing the cost of application testing. \n<br><br>\nTo learn how to use the AWS Management Console to launch Amazon Elastic MapReduce clusters on Spot Instances, please view this <a href=\"http://aws.amazon.com/resources/webinars/?f=howto/UsingSpotWithEMR&amp;t=mp4&amp;s=s1i8hyopmhj1ma&amp;p=playlists/how2_playlist.xml&amp;state=play&amp;parent=http://aws.amazon.com/resources/webinars/?f&amp;d=how2_playlist.xml\"> Getting Started Video</a>. For additional information on using the feature, including how to use it with the Java SDK and Ruby CLI, please visit the <a href=\"http://docs.amazonwebservices.com/ElasticMapReduce/latest/DeveloperGuide/index.html?UsingEMR_SpotInstances.html%20\">Spot Instances section</a> of the Amazon Elastic MapReduce Developer Guide.  For additional information on Spot Instances please visit the  <a href=\"http://aws.amazon.com/ec2/spot-instances/\">Amazon EC2 Spot Instances</a> page.\n  ","contentType":"Launch Announcement","headline":"Amazon Elastic MapReduce Now Supports Spot Instances"}
{"id":"whats-new#about-aws-whats-new-2011-08-16-announcing-aws-govcloud-us","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/08/16/announcing-aws-govcloud-us/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:33+0000","dateUpdated":"2020-12-30T21:03:04+0000","whats-new_year":"2011","GLOBAL_content-type":"Launch Announcement","modifiedDate":"2019-10-06T04:47:22Z","headlineUrl":"/about-aws/whats-new/2011/08/16/announcing-aws-govcloud-us/","postDateTime":"2011-08-16T20:00:00Z","postSummary":"<p>Announcing AWS GovCloud, a new AWS Region designed to allow U.S. government agencies and contractors to move more sensitive workloads into the cloud by addressing their specific regulatory and compliance requirements.  Previously, government agencies with data subject to compliance regulations such as the International Trade and Arms Regulation (ITAR), which governs how organizations manage and store defense-related data, were unable to process and store data in the cloud that the federal government mandated be accessible only by U.S. persons.  Because AWS GovCloud is physically and logically accessible by U.S. persons only, government agencies can now manage more heavily regulated data in AWS while remaining compliant with strict federal requirements.<br><br>\n The new Region offers the same high level of security as other AWS Regions and supports existing AWS security controls and certifications such as FISMA, SAS-70, ISO 27001, and PCI DSS Level 1. AWS also provides an environment that enables agencies to comply with HIPAA regulations. AWS resources deployed from AWS GovCloud such as Amazon Elastic Compute Cloud (Amazon EC2), Amazon Simple Storage Service (Amazon S3) and Amazon Virtual Private Cloud (Amazon VPC) are available on-demand and agencies pay only for what they use, allowing the U.S. government to benefit from the flexibility, scalability and low pay-as-you-go pricing of AWS. Customers who are interested in learning more about the AWS GovCloud should contact their government sales representative by filling out the Contact Us form on the <a href=\"/content/aws.amazon.com/live/en_US/govcloud-us.html\">AWS GovCloud website</a>.\n \n</p>","contentType":"Launch Announcement","headline":"Announcing AWS GovCloud (US)"}
{"id":"whats-new#about-aws-whats-new-2011-08-15-announcing-the-aws-toolkit-for-eclipse-2-0","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/08/15/announcing-the-aws-toolkit-for-eclipse-2-0/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:01+0000","dateUpdated":"2020-12-30T21:01:57+0000","whats-new_year":"2011","GLOBAL_content-type":"Launch Announcement","modifiedDate":"2019-10-06T04:47:22Z","headlineUrl":"/about-aws/whats-new/2011/08/15/announcing-the-aws-toolkit-for-eclipse-2-0/","postDateTime":"2011-08-15T20:00:00Z","postSummary":"\n    We’ve just released the AWS Toolkit for Eclipse 2.0. This release has a number of new features, including:<br><ul>\n<li>\n<strong>AWS Explorer</strong> – Easily access and administer all your AWS infrastructure, including Amazon S3, Amazon SNS, and Amazon SQS, along with previous support for Amazon SimpleDB and Amazon EC2 management.</li>\n<li>\n<strong>Multiple AWS Account Support</strong> – Configure and easily switch between multiple AWS accounts (or IAM Users) during development.</li>\n<li>\n<strong>AWS Elastic Beanstalk Debugging</strong> - Remotely debug your application running in a Beanstalk environment. The Toolkit helps you select an EC2 instance, automatically configures the security groups and JVM settings, then starts a remote debugging session.</li>\n</ul>\n\nLearn more at <a href=\"http://aws.amazon.com/eclipse\">http://aws.amazon.com/eclipse</a>.\n\n  ","contentType":"Launch Announcement","headline":"Announcing the AWS Toolkit for Eclipse 2.0"}
{"id":"whats-new#about-aws-whats-new-2011-08-08-announcing-aws-cloudformation-embedded-stacks-and-auto-scaling-enhancements","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/08/08/announcing-aws-cloudformation-embedded-stacks-and-auto-scaling-enhancements/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:37+0000","dateUpdated":"2020-12-30T21:02:58+0000","whats-new_year":"2011","GLOBAL_content-type":"Launch Announcement","modifiedDate":"2019-10-06T04:47:23Z","headlineUrl":"/about-aws/whats-new/2011/08/08/announcing-aws-cloudformation-embedded-stacks-and-auto-scaling-enhancements/","postDateTime":"2011-08-08T20:00:00Z","postSummary":"<p>\n\nWe are excited to announce a set of new capabilities for <a href=\"http://aws.amazon.com/cloudformation/\">AWS CloudFormation</a>: Template composition and updated <a href=\"http://aws.amazon.com/autoscaling/\">Auto Scaling</a> support.\n</p>\n\n<p></p>\n\n<p></p>\n<p></p>\n<a href=\"http://aws.amazon.com/cloudformation/aws-cloudformation-templates/\">example templates</a>\n<ul>\n<li>Template composition (<a href=\"http://docs.amazonwebservices.com/AWSCloudFormation/latest/UserGuide/aws-properties-stack.html\">Reference</a>, <a href=\"http://docs.amazonwebservices.com/AWSCloudFormation/latest/UserGuide/quickref-stack.html\">Template snippet</a>)</li>\n<li>Auto Scaling policies (<a href=\"http://docs.amazonwebservices.com/AWSCloudFormation/latest/UserGuide/aws-properties-as-policy.html\">Reference</a>, <a href=\"http://docs.amazonwebservices.com/AWSCloudFormation/latest/UserGuide/quickref-autoscaling.html#scenario-as-policy\">Template snippet</a>)</li>\n<li>Auto Scaling notifications (<a href=\"http://docs.amazonwebservices.com/AWSCloudFormation/latest/UserGuide/aws-properties-as-group.html\">Reference</a>, <a href=\"http://docs.amazonwebservices.com/AWSCloudFormation/latest/UserGuide/quickref-autoscaling.html#scenario-as-notification\">Template snippet</a>)</li>\n</ul>\n\n<p></p>","contentType":"Launch Announcement","headline":"Announcing AWS CloudFormation embedded stacks and Auto Scaling enhancements"}
{"id":"whats-new#about-aws-whats-new-2011-08-03-announcing-vpc-ga","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/08/03/Announcing-VPC-GA/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:07+0000","dateUpdated":"2020-12-30T20:57:15+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2019-10-06T04:47:23Z","headlineUrl":"/about-aws/whats-new/2011/08/03/Announcing-VPC-GA/","postDateTime":"2011-08-03T20:00:00Z","postSummary":"<p>\nWe are excited to announce the global rollout of Amazon Virtual Private Cloud (Amazon VPC). Amazon VPC is now out of beta and is generally available in multiple Availability Zones in all AWS Regions (US East, US West, Europe, Singapore, and Tokyo.) Using Amazon VPC, you can provision a private section of the AWS cloud where you can a create virtual network that you control, including selection of IP address range, creation of subnets, and configuration or route tables and network gateways.  You can connect your Amazon VPC directly to the Internet while also extending your corporate data center to the cloud using encrypted VPN connections.  \n</p>\n<ul>\n<li>Provision multiple VPCs to support different use cases, for example, a production network, a staging network, and a development and test network</li>\n<li>Launch Amazon EC2 instances into subnets in different Availability Zones to protect applications from failure of a single location</li>\n<li>Connect branch office locations to each other and to your Amazon VPC via encrypted VPN tunnels</li>\n<li>View the status of your Amazon VPC VPN connections on the AWS Management Console</li>\n</ul>\n<a href=\"/content/aws.amazon.com/live/en_US/vpc.html\">Amazon VPC web page</a>","contentType":"Launch Announcement","headline":"Amazon VPC Generally Available in Multiple AZs in All Regions"}
{"id":"whats-new#about-aws-whats-new-2011-08-03-announcing-aws-direct-connect","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/08/03/Announcing-AWS-Direct-Connect/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:29+0000","dateUpdated":"2020-12-30T21:03:53+0000","whats-new_year":"2011","GLOBAL_content-type":"Launch Announcement","modifiedDate":"2019-10-06T04:47:23Z","headlineUrl":"/about-aws/whats-new/2011/08/03/Announcing-AWS-Direct-Connect/","postDateTime":"2011-08-03T20:00:00Z","postSummary":"<p>We’re excited to introduce AWS Direct Connect, a new service that allows enterprises to establish a dedicated network connection from their datacenter, office or colocation environment to AWS. AWS Direct Connect allows you to bypass the public Internet when connecting to AWS, which in many cases can reduce your network costs, improve bandwidth throughput and provide a more consistent network experience. </p>\n<p>With each AWS Direct Connect connection, you can configure one or more logical connections that allow you to access public AWS resources (such as S3 buckets) and/or reach private VPC networks. AWS Direct Connect is compatible with all AWS services, including Amazon Elastic Compute Cloud (EC2), Amazon Virtual Private Cloud (VPC), Amazon Simple Storage Service (S3), and Amazon Relational Database Service (RDS).</p>\n<p>AWS Direct Connect can be very useful in a variety of scenarios. Applications that require large and frequent data transfers to and from AWS or require more predictable network performance (real-time feeds for audio and video) can benefit from AWS Direct Connect. AWS Direct Connect also allows you to leverage your existing investment in equipment (such as SAN/NAS devices) by connecting them to AWS through a dedicated network connection.</p>\n<p>AWS Direct Connect has one location available today, located at Equinix’s Ashburn, Virginia colocation facility. From this location, you can connect to services in the AWS US-East (Virginia) region. Additional AWS Direct Connect locations are planned for San Jose, Los Angeles, London, Tokyo and Singapore in the next several months. \n<br><br>\nFor more details, including product pricing, please refer to the <a href=\"http://aws.amazon.com/directconnect\">AWS Direct Connect</a> page and a list of <a href=\"http://aws.amazon.com/directconnect/faqs\">frequently asked questions</a>. </p>","contentType":"Launch Announcement","headline":"Announcing AWS Direct Connect "}
{"id":"whats-new#about-aws-whats-new-2011-08-03-announcing-iam-identity-federation","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/08/03/Announcing-IAM-Identity-Federation/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:21+0000","dateUpdated":"2020-12-30T20:57:36+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2019-10-06T04:47:23Z","headlineUrl":"/about-aws/whats-new/2011/08/03/Announcing-IAM-Identity-Federation/","postDateTime":"2011-08-03T20:00:00Z","postSummary":"<p>\nWe are excited to announce that AWS Identity and Access Management (IAM) now enables “identity federation,” or the ability for you to use your existing corporate identities to grant secure and direct access to AWS resources without creating a new AWS identity for those users. This capability enables you to programmatically request security credentials, with configurable expiration and permissions, that grant your corporate identities access to AWS APIs and resources controlled by your business.</p>\n<a href=\"/content/aws.amazon.com/live/en_US/iam.html\">IAM webpage</a>","contentType":"Launch Announcement","headline":"AWS Identity and Access Management (IAM) Enables Identity Federation"}
{"id":"whats-new#about-aws-whats-new-2011-08-01-aws-startup-challenge-2011-worldwide","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/08/01/aws-startup-challenge-2011-worldwide/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:31+0000","dateUpdated":"2020-12-30T21:08:33+0000","whats-new_year":"2011","GLOBAL_content-type":"Launch Announcement","modifiedDate":"2019-10-06T04:47:23Z","headlineUrl":"/about-aws/whats-new/2011/08/01/aws-startup-challenge-2011-worldwide/","postDateTime":"2011-08-01T20:00:00Z","postSummary":"<p>The 5th Annual of AWS Start-up Challenge has launched and is open to start-ups worldwide. This contest is a great way for young, innovative companies using Amazon Web Services to gain exposure and compete for a chance to win $100,000 in cash and credits. This year, we will recognize 15 regional semi-finalists, 6 global finalists, and select one global grand prize winner. The application process is now open and the contest submission closes October 2, 2011. To learn more and enter the competition, visit the <a href=\"http://aws.amazon.com/startupchallenge\">AWS Start-Up Challenge home page</a>.</p>","contentType":"Launch Announcement","headline":"AWS Start-Up Challenge: Now Open to Start-ups Worldwide"}
{"id":"whats-new#about-aws-whats-new-2011-07-18-amazon-simple-email-service-announces-attachment-support","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/07/18/amazon-simple-email-service-announces-attachment-support/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:39+0000","dateUpdated":"2020-12-30T21:09:04+0000","whats-new_year":"2011","GLOBAL_content-type":"Launch Announcement","modifiedDate":"2019-10-06T04:47:28Z","headlineUrl":"/about-aws/whats-new/2011/07/18/amazon-simple-email-service-announces-attachment-support/","postDateTime":"2011-07-18T20:00:00Z","postSummary":"<p>\nWe are excited to announce attachment support for <a href=\"/content/aws.amazon.com/live/en_US/ses.html\">Amazon Simple Email Service (Amazon SES)</a>.  This enables customers to exchange data files, send company newsletters, share photos, and more.\n</p>\n<p>\nTo send emails with attachments, you can call the Amazon SES SendRawEmail API, or use the AWS Software Development Kits (SDKs) to compose and send the message programmatically.  The message, with attachment(s), will appear in the recipient’s email client where it can be viewed or saved to disk.\n</p>\n<p>\nWe have extended our content filtering technologies to include attachments, which helps detect and block attachments containing spam or malware before they can be sent.  Amazon SES helps senders protect their reputations by providing additional protection for recipient email boxes.\n</p>\n<p>\nAmazon SES supports a variety of MIME types, including plain text, comma-separated values (CSV), images (.bmp, .gif, .jpg, etc.), and Adobe Portable Document Format (PDF).  For more information, including a complete listing of supported MIME types, please refer to the <a href=\"http://docs.amazonwebservices.com/ses/latest/DeveloperGuide/\">Amazon SES Developer Guide</a>.\n</p>","contentType":"Launch Announcement","headline":"Amazon Simple Email Service Announces Attachment Support"}
{"id":"whats-new#about-aws-whats-new-2011-07-14-announcing-aws-sdk-for-ruby","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/07/14/announcing-aws-sdk-for-ruby/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:16+0000","dateUpdated":"2020-12-30T21:02:42+0000","whats-new_year":"2011","GLOBAL_content-type":"Launch Announcement","modifiedDate":"2019-10-06T04:47:28Z","headlineUrl":"/about-aws/whats-new/2011/07/14/announcing-aws-sdk-for-ruby/","postDateTime":"2011-07-14T20:00:00Z","postSummary":"<p>Amazon Web Services launches the official AWS SDK for Ruby, enabling developers to get started building scalable Ruby web applications in minutes.</p>\n<p>The SDK features:</p>\n<ul type=\"disc\">\n<li>\n<strong>AWS Ruby Gem</strong>—Build Ruby applications with the aws-sdk gem that       takes the complexity out of coding directly against the web service       interfaces. The gem handles common tasks, such as authentication, request       retries, XML processing, error handling, and more. </li>\n  <li>\n<strong>Rails Integration—</strong>Easily integrate Amazon Web Services into       your Rails application using an Object Relational Mapper (ORM) to model       your data and persist it using Amazon SimpleDB, and an Action Mailer       implementation for Amazon Simple E-mail Service.  <strong></strong>\n</li>\n  <li>\n<strong>Code Samples</strong>—Practical examples for how to use the library to       build applications available through GitHub. </li>\n</ul>\n\n<p>Learn more about the AWS SDK for Ruby at <a href=\"http://aws.amazon.com/sdkforruby\">http://aws.amazon.com/sdkforruby</a>.<br>\nSee all resources for Ruby development at <a href=\"http://aws.amazon.com/ruby\">http://aws.amazon.com/ruby</a>.</p>","contentType":"Launch Announcement","headline":"Announcing the AWS SDK for Ruby"}
{"id":"whats-new#about-aws-whats-new-2011-07-11-aws-cloudformation-july-announcement","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/07/11/aws-cloudformation-july-announcement/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:55+0000","dateUpdated":"2020-12-30T21:08:27+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","postBody":"<p>AWS CloudFormation now supports the ability to configure security groups for your EC2 instances so they'll only accept traffic from an Elastic Load Balancer. By using Elastic Load Balancers in conjunction with Amazon Route 53, you can map your root domain, or &quot;zone apex&quot; directly to your load balancer. For more information, read the related <a href=\"http://aws.typepad.com/aws/2011/05/elastic-load-balancing-ipv6-zone-apex-support-additional-security.html\" target=\"_blank\">AWS Blog post</a>. In addition, AWS CloudFormation supports the Amazon Route 53 Weighted Round Robin (WRR) functionality, allowing developers to specify the frequency (&quot;weights&quot;) with which different DNS responses are returned to end users.&nbsp;</p>\n<p>AWS CloudFormation now allows you to attach arbitrary, structured metadata to any resource in your template allowing you to &quot;tag&quot; your resources with additional information. By using this feature, you can store configuration data in the template and access it using the AWS CloudFormation command line tools or the APIs.&nbsp;</p>\n<p>Finally, with the CloudFormer prototype tool, you can provision and configure your application resources the way you want using your existing processes and tools. Once everything is setup and you have the resources provisioned, simply take a &quot;snapshot&quot; of the configuration to create a template, enabling you to launch copies of the application with just a few clicks through the <a href=\"http://aws.amazon.com/console/\" target=\"_blank\">AWS Management Console</a>.&nbsp;</p>\n<p>We have added a number of additional <a href=\"/content/aws.amazon.com/live/en_US/cloudformation/aws-cloudformation-templates.html\">example templates</a> to illustrate these new features to get you started quickly.</p>\n<p>The AWS CloudFormation team</p>\n","modifiedDate":"2019-10-06T04:47:28Z","headlineUrl":"/about-aws/whats-new/2011/07/11/aws-cloudformation-july-announcement/","postDateTime":"2011-07-11T20:00:00Z","postSummary":"<p>We are excited to announce a set of new capabilities for <a href=\"/content/aws.amazon.com/live/en_US/cloudformation.html\">AWS CloudFormation</a>: <a href=\"/content/aws.amazon.com/live/en_US/route53.html\">Amazon Route53</a> weighted round robin (WRR) functionality, <a href=\"/content/aws.amazon.com/live/en_US/elasticloadbalancing.html\">Elastic Load Balancing</a> zone apex support and security group integration, Oracle for Amazon RDS instances and resource metadata support. In addition, we have created <a href=\"https://forums.aws.amazon.com/ann.jspa?annID=1048\" target=\"_blank\">CloudFormer</a>, a prototype tool that enables you to create templates from the existing AWS resources in your account.<br>\n</p>\n","contentType":"Launch Announcement","headline":"AWS CloudFormation announces new features"}
{"id":"whats-new#about-aws-whats-new-2011-07-07-announcing-aws-importexport-for-amazon-ebs","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/07/07/announcing-aws-importexport-for-amazon-ebs/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:06+0000","dateUpdated":"2020-12-30T21:00:51+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2019-10-06T04:47:28Z","headlineUrl":"/about-aws/whats-new/2011/07/07/announcing-aws-importexport-for-amazon-ebs/","postDateTime":"2011-07-07T20:00:00Z","postSummary":"<p>We’re excited to announce support for importing data into Amazon Elastic Block Store (EBS) using AWS Import/Export.  AWS Import/Export accelerates moving large amounts of data into and out of AWS using portable storage devices for transport.  Amazon EBS provides storage volumes for use with Amazon EC2 instances.  With Import to Amazon EBS in the US East (Virginia) and US West (Northern California) regions, you can now quickly transfer data into Amazon EBS by shipping storage devices to AWS.</p>\n<p> \nAWS Import/Export transfers your data off of storage devices into AWS by using Amazon’s high-speed internal network and bypassing the Internet. If you have large amounts of data to load and an Internet connection with limited bandwidth, the time required to prepare and ship a portable storage device to AWS can be a small percentage of the time it would take to transfer your data over the internet. If loading your data over the Internet would take more than a few days, you should consider using AWS Import/Export.</p>\n<p>AWS Import/Export now supports importing data directly into Amazon EBS snapshots off of eSATA and USB storage devices, as well as internal SATA hard drives.  Once loaded into an Amazon EBS snapshot, you can create a volume based on that snapshot and attach it to an Amazon EC2 instance, or you can share that snapshot with others.</p>\n<p>Get started using AWS Import/Export today at <a href=\"/content/aws.amazon.com/live/en_US/importexport.html\">http://aws.amazon.com/importexport</a>.</p>","contentType":"Launch Announcement","headline":"Announcing AWS Import/Export for Amazon EBS"}
{"id":"whats-new#about-aws-whats-new-2011-06-30-aws-announces-new-data-transfer-pricing","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/06/30/aws-announces-new-data-transfer-pricing/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:38+0000","dateUpdated":"2020-12-30T21:07:49+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2019-10-06T04:47:23Z","headlineUrl":"/about-aws/whats-new/2011/06/30/aws-announces-new-data-transfer-pricing/","postDateTime":"2011-06-30T20:00:00Z","postSummary":"<p>We're pleased to announce that we're lowering our pricing for AWS data transfer, effective July 1, 2011.  We've often told you that one of our goals is to drive down costs continuously and to pass those savings on.  We've reduced prices on over a dozen occasions over the last four years. We’re happy to be able to once again pass along savings to you. We will no longer charge a separate fee for internet data transfer in. For internet data transfer out, we’ve added three new tiers -- at 1 PB, 5 PB and greater than 5 PB -- for our high volume users. Finally, in the US and Europe, we’ve reduced price for internet data transfer out at every existing usage tier of usage.</p>\n<p>We’re also pleased to announce that for our Content Delivery Network, Amazon CloudFront, we’re also lowering prices effective July 1, 2011. We’ve added new usage tiers in every region, and in the US and Europe we’ve reduced data transfer pricing in every existing tier. </p>\n<p>For more information on the new data transfer prices effective July 1, 2011, please visit the <a href=\"http://aws.amazon.com/pricing_effective_july_2011\">AWS Data Transfer Pricing Update</a> detail page. </p>","contentType":"Launch Announcement","headline":"AWS Announces New Data Transfer Pricing"}
{"id":"whats-new#about-aws-whats-new-2011-06-30-aws-elastic-beanstalk-announces-configuration-persistence-and-support-for-url-swapping","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/06/30/aws-elastic-beanstalk-announces-configuration-persistence-and-support-for-url-swapping/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:57+0000","dateUpdated":"2020-12-30T21:01:48+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2019-10-06T04:47:23Z","headlineUrl":"/about-aws/whats-new/2011/06/30/aws-elastic-beanstalk-announces-configuration-persistence-and-support-for-url-swapping/","postDateTime":"2011-06-30T20:00:00Z","postSummary":"<p>We are excited to announce 2 new capabilities of AWS Elastic Beanstalk. AWS Elastic Beanstalk provides developers and system administrators a quick way to deploy and manage applications in the AWS cloud.\n</p>\n<p>\nUsing the <a href=\"https://console.aws.amazon.com/elasticbeanstalk/home\">AWS Management Console</a>, you can now save an environment’s configuration, launch a new environment with a saved configuration, and apply a saved configuration to an existing environment. This allows you to seamlessly launch multiple environments with your preferred settings. For more details, go to the <a href=\"http://docs.amazonwebservices.com/elasticbeanstalk/latest/dg/index.html?using-features.managing.html\">Managing Your Application Environments</a> section in the <i>AWS Elastic Beanstalk Developer Guide</i>.\n</p>\n<p>\nAWS Elastic Beanstalk now gives you the ability to swap URLs between environments.  By using the URL swapping functionality, end users of your web application should not experience downtime when you deploy a new application version. You can stage your new application version on a test environment and swap the URLs with the production environment. For more details about this functionality and how to integrate it into your build process, visit the <a href=\"http://docs.amazonwebservices.com/elasticbeanstalk/latest/dg/index.html?using-features.CNAMESwap.html\">Deploying New Versions with Zero Downtime</a> in the <i>AWS Elastic Beanstalk Developer Guide</i>.\n</p>\n<p>\nFor more information about this release, check out the <a href=\"http://aws.amazon.com/releasenotes/AWS-Elastic-Beanstalk\">AWS Elastic Beanstalk Release Notes</a>.\n</p>","contentType":"Launch Announcement","headline":"AWS Elastic Beanstalk Announces Configuration Persistence and Support for URL Swapping"}
{"id":"whats-new#about-aws-whats-new-2011-06-23-new-edge-location-stockholm","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/06/23/new-edge-location-stockholm/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:51:44+0000","dateUpdated":"2020-12-30T21:01:56+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2019-10-06T04:47:23Z","headlineUrl":"/about-aws/whats-new/2011/06/23/new-edge-location-stockholm/","postDateTime":"2011-06-23T20:00:00Z","postSummary":"<p>We're excited to announce that we've added a new edge location in Stockholm to help improve performance for end users of Amazon CloudFront and Amazon Route 53. Both CloudFront and Route 53 utilize a global network of locations to provide your end users with low latency and high performance in accessing your content. With this addition, the number of locations utilized by CloudFront and Route 53 in Europe has increased to 6, and the number of global locations to 19. We plan to continue to add new locations worldwide for each service throughout 2011. To learn more about <a href=\"/content/aws.amazon.com/live/en_US/cloudfront.html\">CloudFront</a> and <a href=\"/content/aws.amazon.com/live/en_US/route53.html\">Route 53</a>, visit their respective product detail pages on our website.</p>","contentType":"Launch Announcement","headline":"New Edge Location for Amazon CloudFront and Amazon Route 53"}
{"id":"whats-new#about-aws-whats-new-2011-06-20-announcing-on-demand-support-for-rhel-on-amazon-ec2","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/06/20/announcing-on-demand-support-for-rhel-on-amazon-ec2/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:12+0000","dateUpdated":"2020-12-30T20:57:54+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2019-10-06T04:47:24Z","headlineUrl":"/about-aws/whats-new/2011/06/20/announcing-on-demand-support-for-rhel-on-amazon-ec2/","postDateTime":"2011-06-20T20:00:00Z","postSummary":"<p>We are excited to announce that customers can now purchase supported instances of Red Hat Enterprise Linux 5 and 6 in Amazon’s Elastic Compute Cloud (Amazon EC2) in an on-demand, pay-as-you-go basis. By running Red Hat Enterprise Linux on Amazon EC2, customers can leverage the cost effectiveness, scalability and flexibility of running on Amazon’s infrastructure together with the reliability, superior up time and support from Red Hat.</p>\n<p>Customers who run Amazon EC2 wit Red Hat Enterprise Linux will have the option of running several versions of the software, and will be supported by via Amazon Web Services Premium Support with back line support from Red Hat. The offering will be extended to all regions, availability zones, and instance types supported by Amazon. Red Hat Enterprise Linux instances will integrate seamlessly with all existing features in Amazon EC2, including Amazon Elastic Block Store (EBS), Amazon CloudWatch, Elastic IPs and Elastic Load Balancing.</p>\n<p>For more information, please visit the <a href=\"/content/aws.amazon.com/live/en_US/rhel.html\">Red Hat Enterprise Linux detail page</a>.</p>","contentType":"Launch Announcement","headline":"Announcing on-demand support for Red Hat Enterprise Linux on Amazon EC2"}
{"id":"whats-new#about-aws-whats-new-2011-05-31-aws-cloudformation-new-version-may-2011","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/05/31/aws-cloudformation-new-version-may-2011/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:34+0000","dateUpdated":"2020-06-04T04:39:25+0000","whats-new_year":"2011","GLOBAL_content-type":"Launch Announcement","modifiedDate":"2020-05-28T09:50:39Z","headlineUrl":"/about-aws/whats-new/2011/05/31/aws-cloudformation-new-version-may-2011/","postDateTime":"2011-05-31T20:00:00Z","postSummary":"<p>We are excited to announce a set of new capabilities for <a href=\"http://aws.amazon.com/cloudformation\">AWS CloudFormation</a>; validation for template parameters, resource deletion policies and the ability to block stack creation until your application is ready.</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>Some applications need time after an <a href=\"http://aws.amazon.com/ec2/\">Amazon EC2</a> instance is launched, before the application is considered ready to take traffic or perform operations. AWS CloudFormation templates now provide a <i>WaitCondition</i> resource that acts as a barrier, blocking the creation of other resources until a completion signal is received from an external source such as your application, or management system. Also, when a resource is deleted, you now have options to keep any of the stack resources around or to snapshot <a href=\"http://aws.amazon.com/ebs/\">Amazon EBS</a> volumes and <a href=\"http://aws.amazon.com/rds/\">Amazon RDS</a> database instances before they are deleted.</p>\n<p>&nbsp;</p>\n<p>We provide <a href=\"http://aws.amazon.com/cloudformation/aws-cloudformation-templates/\">example templates</a> that illustrate each of these new features and let you get started with only a few clicks in the <a href=\"http://aws.amazon.com/console\">AWS Management Console</a>. The sample application templates have been updated to include parameter validation, making it easier for you to create stacks quickly.</p>\n<p>&nbsp;</p>\n<p>For more details see the <a href=\"http://aws.amazon.com/releasenotes/AWS-CloudFormation\">AWS CloudFormation release notes.</a></p>\n","contentType":"Launch Announcement","headline":"AWS CloudFormation announces parameter validation, resource deletion policies and application barriers "}
{"id":"whats-new#about-aws-whats-new-2011-05-26-improved-pricing-control-for-spot-instances-coming-july-1st","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/05/26/improved-pricing-control-for-spot-instances-coming-july-1st/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:07+0000","dateUpdated":"2020-12-30T20:57:16+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2019-10-06T04:47:24Z","headlineUrl":"/about-aws/whats-new/2011/05/26/improved-pricing-control-for-spot-instances-coming-july-1st/","postDateTime":"2011-05-26T20:00:00Z","postSummary":"<p>We are excited to announce a new feature that will significantly increase your control over pricing for your Amazon EC2 Spot instances. With this change, we will introduce a Spot Instance price per Availability Zone rather than a Spot Instance price for an entire Region (covering all Availability Zones within the region). This improved pricing granularity will enable you to determine the price required to launch a Spot Instance into a specific Availability Zone.</p>\n<p>With this announcement, we will now set the Spot price based on the supply and demand for a specific Availability Zone rather than Region, enabling you to determine the price required to launch a Spot instance into a particular Availability Zone. If you do not target your bids, you will have your instances automatically launched into the lowest priced Availability Zone available when the bid is fulfilled. </p>\n<p>Given that this change may affect customer’s bidding strategies and how the DescribePriceHistory API works, we are providing lead time to modify your application. The API changes and supporting documentation are immediately available at <a href=\"http://aws.amazon.com/releasenotes/Amazon-EC2\">http://aws.amazon.com/releasenotes/Amazon-EC2</a>. Each Availability Zone’s Spot price will start to change independently based on supply and demand starting on July 1, 2011.</p>\n<p>For more information about Amazon EC2 Spot Instances and experiences from customers using it, please visit the <a href=\"/content/aws.amazon.com/live/en_US/ec2/spot-instances.html\">Amazon EC2 Spot Instance Web Page</a>. </p>","contentType":"Launch Announcement","headline":"Improved Pricing Control for Spot Instances Coming July 1st"}
{"id":"whats-new#about-aws-whats-new-2011-05-24-amazon-route53-elb-integration-wrr-ga","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/05/24/amazon-route53-elb-integration-wrr-ga/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:21+0000","dateUpdated":"2020-12-30T21:01:52+0000","whats-new_year":"2011","GLOBAL_content-type":"Launch Announcement","modifiedDate":"2019-10-06T04:47:25Z","headlineUrl":"/about-aws/whats-new/2011/05/24/amazon-route53-elb-integration-wrr-ga/","postDateTime":"2011-05-24T20:00:00Z","postSummary":"<p>We're excited to make three announcements today regarding Amazon Route 53, AWS’s highly available and scalable Domain Name System (DNS) service.</p>\n<p>First, Amazon Route 53 has integrated with Elastic Load Balancing (ELB) in order to easily let you map your root domain, or \"zone apex\" (e.g. mydomain.com without the 'www') directly to your Elastic Load Balancer. We’re excited that by integrating Elastic Load Balancing and Amazon Route 53, we’re offering our customers a solution that can be implemented in minutes while maintaining the high level of reliability that customers expect from Amazon Web Services.</p>\n<p>Second, Amazon Route 53 now offers Weighted Round Robin (WRR) functionality, allowing developers to specify the frequency (“weights”) with which different DNS responses are returned to end users. You can use WRR to bring servers into production, perform A/B testing, or balance your traffic across regions or data centers of varying sizes. Since we launched Amazon Route 53, this has been one of the most frequently requested features, so we’re happy to make this feature available today.</p>\n<p>Lastly, Amazon Route 53 has announced General Availability along with a 100% <a href=\"http://aws.amazon.com/route53/sla/\">Service Level Agreement </a>(SLA), backing up the service’s reliability with service credits in case of downtime. \n</p>","contentType":"Launch Announcement","headline":"Amazon Route 53 Announces ELB integration, Weighted Round Robin, and General Availability"}
{"id":"whats-new#about-aws-whats-new-2011-05-24-elb-ipv6-zoneapex-securitygroups","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/05/24/elb-ipv6-zoneapex-securitygroups/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:54+0000","dateUpdated":"2020-12-30T21:03:52+0000","whats-new_year":"2011","GLOBAL_content-type":"Launch Announcement","modifiedDate":"2019-10-06T04:47:24Z","headlineUrl":"/about-aws/whats-new/2011/05/24/elb-ipv6-zoneapex-securitygroups/","postDateTime":"2011-05-24T20:00:00Z","postSummary":"<p>We are excited to announce the immediate availability of three new features for Elastic Load Balancing including IPv6 support, zone apex support, and security group integration.</p>\n<p>Starting today, all Elastic Load Balancers in the Amazon EC2 US-East (Northern Virginia) Region and the Amazon EC2 EU (Ireland) Region are capable of supporting IPv6. Each Elastic Load Balancer now supports three DNS names - an IPv4 DNS name providing a single IPv4 address, an IPv6 DNS name providing a single IPv6 address, and a \"dualstack\" DNS name which provides both an IPv4 address and an IPv6 address.  Traffic between the Elastic Load Balancer and your EC2 instances will still use IPv4 which means you don't need to modify your applications in order to start using IPv6 today.  ELB support for IPv6 in other Regions will be available shortly.</p>\n<p>Also released today, Elastic Load Balancing, in coordination with Amazon Route53, lets you map your root domain, or \"zone apex\" directly to your Load Balancer.  This allows you create friendly DNS entries for your load balanced websites like \"mydomain.com\" in addition to \"www.mydomain.com\".</p>\n<p>Lastly, you can now configure security groups for your EC2 instances so they'll only accept traffic from the Elastic Load Balancer.</p>\n<p>For more information about Elastic Load Balancing, please visit the <a href=\"http://aws.amazon.com/elasticloadbalancing/\">Elastic Load Balancing web page.</a> </p>","contentType":"Launch Announcement","headline":"Elastic Load Balancing Announces Support for IPv6, Zone Apex Support and Security Group Integration"}
{"id":"whats-new#about-aws-whats-new-2011-05-23-amazon-rds-for-oracle-database","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/05/23/amazon-rds-for-oracle-database/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:08+0000","dateUpdated":"2020-12-30T21:02:59+0000","whats-new_year":"2011","GLOBAL_content-type":"Launch Announcement","modifiedDate":"2019-10-06T04:47:25Z","headlineUrl":"/about-aws/whats-new/2011/05/23/amazon-rds-for-oracle-database/","postDateTime":"2011-05-23T20:00:00Z","postSummary":"<p>We are excited to announce the immediate availability of Amazon RDS for Oracle Database. Amazon RDS already makes it easier to set up, operate, and scale MySQL databases in the cloud.  You can now also run multiple editions of Oracle Database (11g Release 2) on Amazon RDS, simplifying database provisioning and setup, and offloading common administration tasks such as backups for point-in-time restore, software patching, and hardware scaling.   You can take advantage of Amazon RDS to run Oracle Database 11g under two different licensing models – “License Included” and “Bring-Your-Own-License (BYOL)\". In the \"License Included\" service model, you do not need separately purchased Oracle licenses; the Oracle Database software has been licensed by AWS. \"License Included\" pricing starts at $0.16 per hour, inclusive of software, underlying hardware resources, and Amazon RDS management capabilities. If you already own Oracle Database licenses, you can use the \"BYOL\" model to run Oracle deployments on Amazon RDS, with rates starting at $0.11 per hour.</p>\n<p>You can visit the <a href=\"http://aws.amazon.com/rds/oracle\">Amazon RDS for Oracle Database page</a> to learn more, learn more about the benefits of Amazon RDS for Oracle, and launch a pre-configured Oracle deployment in minutes.</p>","contentType":"Launch Announcement","headline":"Amazon RDS for Oracle Database"}
{"id":"whats-new#about-aws-whats-new-2011-05-18-announcing-aws-ec2-support-for-sap-rapid-deployment-solutions-and-sap-businessobjects-solutions","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/05/18/announcing-aws-ec2-support-for-sap-rapid-deployment-solutions-and-sap-businessobjects-solutions/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:07+0000","dateUpdated":"2021-09-14T17:11:47+0000","whats-new_year":"2011","GLOBAL_content-type":"Launch Announcement","postBody":"<p style=\"text-align: center;\"><sub>Modified 9/14/2021 – In an effort to ensure a great experience, expired links in this post have been updated or removed from the original post.</sub></p>\r\n","modifiedDate":"2021-09-14T17:10:53Z","headlineUrl":"/about-aws/whats-new/2011/05/18/announcing-aws-ec2-support-for-sap-rapid-deployment-solutions-and-sap-businessobjects-solutions/","postDateTime":"2011-05-18T20:00:00Z","postSummary":"<p>We are excited to announce that customers can now deploy their&nbsp;SAP® Rapid Deployment solutions&nbsp;and&nbsp;SAP® BusinessObjects™&nbsp;solutions on various Amazon EC2 instance types in both production and non-production environments. For a detailed guide to operating SAP solutions on AWS, visit the <a href=\"http://aws.amazon.com/solutions/global-solution-providers/sap/\">AWS SAP page</a></p>\r\n","contentType":"Launch Announcement","headline":"Announcing AWS EC2 Support for SAP® Rapid Deployment solutions and SAP® BusinessObjects™ solutions"}
{"id":"whats-new#about-aws-whats-new-2011-05-10-amazon-cloudwatch-announces-custom-metrics-lower-prices-for-amazon-ec2-monitoring","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/05/10/amazon-cloudwatch-announces-custom-metrics-lower-prices-for-amazon-ec2-monitoring/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:49:58+0000","dateUpdated":"2020-12-30T20:57:53+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2019-10-06T04:47:25Z","headlineUrl":"/about-aws/whats-new/2011/05/10/amazon-cloudwatch-announces-custom-metrics-lower-prices-for-amazon-ec2-monitoring/","postDateTime":"2011-05-10T20:00:00Z","postSummary":"<p>We’re excited to announce that you can now use Amazon CloudWatch to monitor your own custom application metrics.  In addition, we are lowering the price of Detailed Monitoring for Amazon EC2 instances.</p>\n<p>\nPrior to today, Amazon CloudWatch provided monitoring for AWS cloud resources such as Amazon EC2 instances, Amazon EBS volumes, Elastic Load Balancers, and Amazon RDS DB instances. Starting today, you can also use Amazon CloudWatch to monitor your custom application metrics for $0.50 per metric per month. With Amazon CloudWatch, there’s no need to set up, maintain, or scale your own monitoring infrastructure. Using a simple API call, you can now provide any metrics that are important to your business, such as application performance, system health, or customer usage. Within moments, you will be able to retrieve statistics, view graphs, or set alarms on your metrics. All this functionality is available immediately via API, the AWS Management Console, and the AWS SDKs.</p>\n<p>\nFor Amazon EC2, Free Basic Monitoring provides metric data at five-minute frequency. You can also choose to enable Detailed Monitoring for Amazon EC2 instances, which provides metric data at one-minute frequency for $3.50 per instance per month. This new pricing is effective June 1, 2011, and represents a 68% decrease from the current price of $0.015 per instance-hour.</p>\n<p>\nMetric data for Amazon EBS volumes, RDS DB instances, and Elastic Load Balancers remain free of charge. Alarms are available for $0.10 per alarm per month. As part of the AWS Free Tier, you also receive ten metrics and ten alarms per month, free of charge. To learn more, visit: <a href=\"/content/aws.amazon.com/live/en_US/cloudwatch.html\">aws.amazon.com/cloudwatch</a>.</p>","contentType":"Launch Announcement","headline":"Amazon CloudWatch Announces Custom Metrics, Lower Prices for Amazon EC2 Monitoring"}
{"id":"whats-new#about-aws-whats-new-2011-05-05-announcing-aws-elastic-beanstalk-support-for-tomcat-7","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/05/05/announcing-aws-elastic-beanstalk-support-for-tomcat-7/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:21+0000","dateUpdated":"2020-12-30T21:01:02+0000","whats-new_year":"2011","GLOBAL_content-type":"Launch Announcement","modifiedDate":"2019-10-06T04:47:25Z","headlineUrl":"/about-aws/whats-new/2011/05/05/announcing-aws-elastic-beanstalk-support-for-tomcat-7/","postDateTime":"2011-05-05T20:00:00Z","postSummary":"<p>We are excited to announce that AWS Elastic Beanstalk supports Tomcat 7. Starting today, you can launch Tomcat 7 environments and deploy applications that use the latest Servlet 3.0 specifications, JSP 2.2 and JSP-EL 2.2. Click <a href=\"http://aws.amazon.com/elasticbeanstalk/\">here</a> to learn about AWS Elastic Beanstalk.\n</p>\n<p>\nThe AWS Toolkit for Eclipse also supports a new server type called \"AWS Elastic Beanstalk for Tomcat 7\". Click <a href=\"http://aws.amazon.com/eclipse/\">here</a> for more information on using the AWS Toolkit for Eclipse with Elastic Beanstalk.\n</p>\n<p>\nTomcat 7 is now the default for new environments. Since this is a major revision of Tomcat, your existing environments will not be changed and you may continue to choose Tomcat 6 for new environments. To launch a new Tomcat 7 environment, simply complete the following steps:\n</p>\n\n<ol>\n<li>In the <a href=\"https://console.aws.amazon.com/elasticbeanstalk/\">AWS Management Console</a>, make sure the application you’d like to migrate is selected.</li>\n<li>Click on <strong>Launch New Environment</strong> in the top right corner.</li>\n<li>From the <strong>Select an existing application version</strong> drop down, choose the application version that you’d like to run on Tomcat 7.</li>\n<li>From the <strong>Container Type</strong> drop-down, select the Tomcat 7 container that best fits your application and complete the rest of the wizard with the settings that work for your application.</li>\n</ol>\n\n<p>\nFor a detailed getting started guide, visit the <a href=\"http://aws.amazon.com/documentation/elasticbeanstalk/\">AWS Elastic Beanstalk documentation</a> page.\n</p>","contentType":"Launch Announcement","headline":"Announcing AWS Elastic Beanstalk Support for Tomcat 7"}
{"id":"whats-new#about-aws-whats-new-2011-05-03-announcing-iam","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/05/03/announcing-IAM/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:51:49+0000","dateUpdated":"2020-12-30T20:57:19+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2019-10-06T04:47:25Z","headlineUrl":"/about-aws/whats-new/2011/05/03/announcing-IAM/","postDateTime":"2011-05-03T20:00:00Z","postSummary":"<p>We are excited to announce the availability of AWS Identity and Access Management (IAM) in the AWS Management Console. You can now add users to your AWS Account, set groups and permissions for these users, and enable users to call AWS Service APIs, all from a simple point-and-click browser interface.</p>\n<p>To learn more about the IAM console, please visit the <a href=\"http://docs.amazonwebservices.com/IAM/latest/UserGuide\">Using IAM guide</a> or open the <a href=\"https://console.aws.amazon.com/iam/home\">IAM console</a>. </p>\n<p>We are also pleased to announce the General Availability of IAM. With the release of <a href=\"http://docs.amazonwebservices.com/IAM/latest/UserGuide/Using_AWSManagementConsole.html\">IAM User Login</a> and the IAM console we believe that IAM provides AWS customers greater security, flexibility, and control when using AWS.</p>\n<p><b>About AWS Identity and Access Management</b></p>\n<p>AWS Identity and Access Management (IAM) is a web service that enables easy management of access to AWS services and resources. With IAM, you can create users for each individual in your organization, assign users to groups, and set permissions controlling what actions users can perform with AWS services and applications such as Amazon S3, Amazon EC2, Amazon RDS, and the AWS Management Console. To get started with IAM, visit <a href=\"http://aws.amazon.com/iam\">http://aws.amazon.com/iam</a>. \n</p>","contentType":"Launch Announcement","headline":"AWS Identity and Access Management (IAM) Announces General Availability and Support in the AWS Management Console"}
{"id":"whats-new#about-aws-whats-new-2011-04-19-aws-management-console-adds-support-for-amazon-cloudfront-2","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/04/19/aws-management-console-adds-support-for-amazon-cloudfront-2/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:05+0000","dateUpdated":"2020-12-30T21:01:05+0000","whats-new_year":"2011","GLOBAL_content-type":"Launch Announcement","modifiedDate":"2019-10-06T04:47:26Z","headlineUrl":"/about-aws/whats-new/2011/04/19/aws-management-console-adds-support-for-amazon-cloudfront-2/","postDateTime":"2011-04-19T20:00:00Z","postSummary":"<p>The AWS SDK for Android and AWS SDK for iOS now support for 5 new services:</p>\n<ul>\n<li><a href=\"http://aws.amazon.com/cloudwatch/\">Amazon CloudWatch</a></li>\n<li><a adhocenable=\"false\" href=\"/content/aws.amazon.com/live/en_US/ec2.html\">Amazon EC2</a></li>\n<li><a href=\"http://aws.amazon.com/ses/\" title=\"Amazon SES\">Amazon Simple Email Service (SES)</a></li>\n<li><a href=\"http://aws.amazon.com/simpledb/\">Amazon SimpleDB</a></li>\n<li><a href=\"http://aws.amazon.com/elasticloadbalancing/\">Elastic Load Balancing</a></li>\n<li><a href=\"http://aws.amazon.com/autoscaling/\">Auto Scaling</a></li>\n</ul>\n<p>With these new services, developers can now add the following infrastructure to their mobile applications:</p>\n<ul>\n<li><b>Messaging</b>—Send bulk and transactional email to customers using Amazon SES.</li>\n<li><b>Compute</b>—Launch and manage Amazon EC2 instances with a number of features for building scalable, failure resilient, and enterprise class applications.</li>\n<li><b>Monitoring</b>—Monitor your Amazon EC2 instances, Amazon EBS volumes, Elastic Load Balancers, and Amazon RDS database instances in real-time with Amazon CloudWatch.</li>\n</ul>\n<p>Download the AWS SDK for Android from <a href=\"http://aws.amazon.com/sdkforandroid\">http://aws.amazon.com/sdkforandroid</a>.<br>\nDownload the AWS SDK for iOS from <a href=\"http://aws.amazon.com/sdkforios\">http://aws.amazon.com/sdkforios</a>.</p>\n","contentType":"Launch Announcement","headline":"AWS Mobile SDKs Add Support for 5 New Services"}
{"id":"whats-new#about-aws-whats-new-2011-04-19-announcing-live-streaming-amazon-cloudfront","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/04/19/announcing-live-streaming-amazon-cloudfront/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:14+0000","dateUpdated":"2020-12-30T21:02:06+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2019-10-06T04:47:26Z","headlineUrl":"/about-aws/whats-new/2011/04/19/announcing-live-streaming-amazon-cloudfront/","postDateTime":"2011-04-19T20:00:00Z","postSummary":"<p>We're excited to announce the launch of live HTTP streaming for Amazon CloudFront. Using Amazon CloudFront with Amazon EC2 running Adobe's Flash® Media Server and Amazon Route 53 (AWS's DNS service), you can now easily and cost-effectively deliver your live video via AWS. And, we've made it simple to get started by creating an AWS CloudFormation template that handles all of the provisioning and sequencing for all the AWS resources you need for this live streaming stack. You only pay for the AWS resources you consume, and you have full control over your live streaming origin server (Adobe's Flash Media Server running on Amazon EC2) -- so you can configure it to best work with the specific nature of your event.</p>\n<p>The best way to get started is to follow the instructions in our <a href=\"http://docs.amazonwebservices.com/AmazonCloudFront/latest/DeveloperGuide/LiveStreamingAdobeFMS4.5.html\">live streaming tutorial</a>. This tutorial walks you through, step by step, how to launch your live streaming event. It'll ask you to select the live streaming template, enter a few parameters about your live event in the AWS Management Console, and let CloudFormation automatically create your live streaming stack and launch your AWS resources to stream your live event.</p>","contentType":"Launch Announcement","headline":"Announcing Live Streaming for Amazon CloudFront"}
{"id":"whats-new#about-aws-whats-new-2011-04-14-amazon-elastic-mapreduce-now-available-in-asia-pacific-regions","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/04/14/amazon-elastic-mapreduce-now-available-in-asia-pacific-regions/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:06+0000","dateUpdated":"2020-06-04T04:39:28+0000","whats-new_year":"2011","GLOBAL_content-type":"Launch Announcement","modifiedDate":"2020-04-26T22:01:25Z","headlineUrl":"/about-aws/whats-new/2011/04/14/amazon-elastic-mapreduce-now-available-in-asia-pacific-regions/","postDateTime":"2011-04-14T20:00:00Z","postSummary":"<p>We are pleased to announce today that Amazon Elastic MapReduce is available in our Asia Pacific (Tokyo) and Asia Pacific (Singapore) Regions. Customers can now easily and cost-effectively analyze vast amounts of data stored in any of the five AWS Regions. Please visit our <a href=\"http://aws.amazon.com/elasticmapreduce/\">detail page</a> for updated information, including pricing for the Asia Pacific Regions. You can also view the Japanese version of our <a href=\"https://docs.aws.amazon.com/ja_jp/emr/latest/ManagementGuide/emr-gs.html\" target=\"_blank\">Getting Started Guide</a>.</p>\n","contentType":"Launch Announcement","headline":"Amazon Elastic MapReduce Now Available in Asia Pacific Regions"}
{"id":"whats-new#about-aws-whats-new-2011-04-07-announcing-amazon-ec2-spot-integration-with-hpc-instances","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/04/07/announcing-amazon-ec2-spot-integration-with-hpc-instances/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:51:49+0000","dateUpdated":"2020-12-30T21:02:02+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2019-10-06T04:47:26Z","headlineUrl":"/about-aws/whats-new/2011/04/07/announcing-amazon-ec2-spot-integration-with-hpc-instances/","postDateTime":"2011-04-07T20:00:00Z","postSummary":"<p>We are excited to announce the availability of Amazon EC2 Cluster Compute and Cluster GPU Spot Instances in the Northern Virginia Region. Using High Performance Computing (HPC) Clusters with Amazon EC2 Spot Instances enables you to leverage the same high compute and network performance provided by custom-built infrastructure while benefiting from the elasticity, flexibility and cost advantages of Amazon EC2 Spot Instances. This new feature is well suited for complex computational workloads that have the flexibility to handle interruption, but are sensitive to network performance or need substantial processing power. Examples of these workloads include batch processing, grid computing, MPI, financial modeling, video rendering or transcoding, or Hadoop-based workloads. </p>\n<p>To get started using Amazon EC2 Cluster Compute and Cluster GPU Spot Instances, simply complete the following steps:</p>\n<ol>\n<li>Log into the <a href=\"https://console.aws.amazon.com/ec2/\">AWS Management Console</a>.</li>\n<li>Click on the Amazon EC2 Tab.</li>\n<li>Select the \"Spot Requests\" navigation option.</li>\n<li>Click the \"Request Spot Instances\" button.</li>\n<li>Complete the launch wizard. Please be sure to select the Cluster Instances Amazon Linux AMI.</li>\n</ol>\n\n<p>For more information on this new offering, please visit the <a href=\"/content/aws.amazon.com/live/en_US/ec2/spot-instances.html\">Amazon EC2 Spot Instances</a> and <a href=\"/content/aws.amazon.com/live/en_US/ec2/hpc-applications.html\">High Performance Computing</a> web pages.</p>","contentType":"Launch Announcement","headline":"Announcing Amazon EC2 Spot Integration with HPC Instances"}
{"id":"whats-new#about-aws-whats-new-2011-03-28-announcing-asia-pacific-tokyo-region-2","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/03/28/announcing-asia-pacific-tokyo-region-2/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:30+0000","dateUpdated":"2020-12-30T21:08:22+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2019-10-06T04:47:26Z","headlineUrl":"/about-aws/whats-new/2011/03/28/announcing-asia-pacific-tokyo-region-2/","postDateTime":"2011-03-28T20:00:00Z","postSummary":"<p>We are pleased today to launch a second Availability Zone in the AWS Tokyo Region. AWS <a href=\"http://aws.typepad.com/aws/2011/03/now-open-aws-region-in-tokyo.html\">launched our Tokyo Region</a> with a single Availability Zone (\"AZ\") about a month ago. At that time we said we would be launching a second Tokyo AZ soon. After a very thorough review of our primary and backup power supplies, we have decided to open up that second Availability Zone, effective today.</p>\n<p>A number of our customers who are already up and running in Tokyo have encouraged us to open up the second AZ so that they can add fault tolerance by running in more than one location. For example, with the opening of the second AZ developers can use the Amazon Relational Database Service (RDS) in Multi-AZ mode, or load balance between web servers running Amazon EC2 in both AZ's.</p>\n<p>We continue to monitor the power situation closely. The <a href=\"http://status.aws.amazon.com/\">AWS Service Health Dashboard</a> is the best place to go for information on any possible service issues.</p>","contentType":"Launch Announcement","headline":"Announcing Second Availability Zone in Tokyo Region"}
{"id":"whats-new#about-aws-whats-new-2011-03-27-amazon-vpc-adds-dedicated-instances","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/03/27/amazon-vpc-adds-dedicated-instances/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:27+0000","dateUpdated":"2020-12-30T21:01:49+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2019-10-06T04:47:26Z","headlineUrl":"/about-aws/whats-new/2011/03/27/amazon-vpc-adds-dedicated-instances/","postDateTime":"2011-03-27T20:00:00Z","postSummary":"<p>We are excited to announce a new <a href=\"/content/aws.amazon.com/live/en_US/vpc.html\">Amazon Virtual Private Cloud</a> (Amazon VPC) concept — the Dedicated Instance. Dedicated Instances are Amazon EC2 instances launched within your VPC that run hardware dedicated to a single customer. Dedicated Instances let you take full advantage of the benefits of Amazon VPC and the AWS cloud – on-demand elastic provisioning, pay only for what you use, and a private, isolated virtual network, all while ensuring that your Amazon EC2 compute instances will be isolated at the hardware level.</p>\n<p>You can easily create a VPC that contains dedicated instances only, providing physical isolation for all Amazon EC2 compute instances launched into that VPC, or you can choose to mix both dedicated instances and non-dedicated instances within the same VPC based on application-specific requirements. <a href=\"/content/aws.amazon.com/live/en_US/dedicated-instances.html\">Click here</a> for more information on launching Dedicated Instances.</p>","contentType":"Launch Announcement","headline":"Amazon VPC Adds Dedicated Instances"}
{"id":"whats-new#about-aws-whats-new-2011-03-16-introducing-support-for-windows-server-2008-r2-on-amazon-ec2","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/03/16/introducing-support-for-windows-server-2008-r2-on-amazon-ec2/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:18+0000","dateUpdated":"2020-12-30T21:00:59+0000","whats-new_general-products":"ec2-windows","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2019-10-06T04:47:26Z","headlineUrl":"/about-aws/whats-new/2011/03/16/introducing-support-for-windows-server-2008-r2-on-amazon-ec2/","postDateTime":"2011-03-16T20:00:00Z","postSummary":"<p>We are pleased to announce that we have added support for Windows Server 2008 R2 and SQL Server Standard 2008 R2. Windows Server 2008 R2 includes many exciting new features, such as support for IIS 7.5, additional Active Directory features, new management tools, and performance improvements when deployed on Amazon EC2. Customers can now also purchase both 1 year and 3 year Reserved Instances from Amazon EC2 with Windows and SQL Server as well. A few details about this release:</p>\n<ul>\n<li>You can now launch instances of Windows Server 2008 R2 in four different flavors: Core, Base, IIS and SQL Server Express, and SQL Server Standard.</li>\n<li>Windows Server 2008 R2 is supported in every region and in most 64-bit instance types, excluding t1.micro and HPC families.</li>\n<li>Running Windows Server 2008 R2 within Amazon VPC will not be supported at launch, but support will be added shortly.</li>\n<li>Windows Server 2008 R2 has regional language support.</li>\n<li>Pricing for Windows Server 2008 R2 remains the same as that of using previous versions of Windows on Amazon EC2.</li>\n<li>Reserved Instances and Spot Instances are available for running Windows 2008 R2.</li>\n<li>Additional AMIs and content can be found in the <a href=\"/content/aws.amazon.com/live/en_US/amis.html\">AMI Catalog</a>, the <a href=\"/content/aws.amazon.com/live/en_US/net.html\">Windows .NET Development Center</a>, and the <a href=\"/content/aws.amazon.com/live/en_US/solutions/global-solution-providers/microsoft.html\">Microsoft Solution Provider Page</a>.</li>\n</ul>\n<p>For more information and to get started, please go to <a href=\"/content/aws.amazon.com/live/en_US/windows.html\">http://aws.amazon.com/windows/</a>.</p>\n","contentType":"Launch Announcement","headline":"Introducing support for Windows Server 2008 R2 on Amazon EC2"}
{"id":"whats-new#about-aws-whats-new-2011-03-15-announcing-vpc-internet-gateway","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/03/15/Announcing-VPC-Internet-Gateway/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:28+0000","dateUpdated":"2020-12-30T21:05:29+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2019-10-06T04:47:26Z","headlineUrl":"/about-aws/whats-new/2011/03/15/Announcing-VPC-Internet-Gateway/","postDateTime":"2011-03-15T20:00:00Z","postSummary":"<p>\nWe are excited to announce greatly expanded functionality of Amazon Virtual Private Cloud (Amazon VPC) that opens up the virtual networking capabilities of Amazon VPC to a much broader set of use cases. Before today, you could provision a private, isolated section of the AWS cloud and launch AWS resources into that VPC that were only accessible via an IPsec Virtual Private Network (VPN) connection to your corporate datacenter.  With today’s announcement, you no longer need a VPN or existing infrastructure resources in order to leverage Amazon VPC, but can also connect to your VPC directly through the Internet – you define the virtual network that you wish to use.\n</p>\n<p>\nWith Amazon VPC, you can define a virtual network topology that closely resembles a traditional network that you might operate in your own datacenter.  You have complete control over your virtual networking environment, including selection of your own IP address range, creation of subnets, and configuration of route tables and network gateways.  You can easily customize the network configuration for your Amazon VPC.  For example, you can create a public-facing subnet for your webservers that have access to the Internet, and place your backend systems such as databases or application servers in a private-facing subnet with no Internet access. \n</p>\n<p>\nTo learn more about Amazon Virtual Private Cloud, visit the  <a href=\"/content/aws.amazon.com/live/en_US/vpc.html\">Amazon VPC web page</a>.\n</p>","contentType":"Launch Announcement","headline":"Amazon VPC Adds Virtual Networking and Internet Access Capabilities"}
{"id":"whats-new#about-aws-whats-new-2011-03-11-iam-support-cloudfront","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/03/11/iam-support-cloudfront/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:51:52+0000","dateUpdated":"2020-12-30T21:01:08+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2019-10-06T04:47:26Z","headlineUrl":"/about-aws/whats-new/2011/03/11/iam-support-cloudfront/","postDateTime":"2011-03-11T20:00:00Z","postSummary":"<p>We are excited to announce the availability of AWS Identity and Access Management (IAM) support for Amazon CloudFront. IAM enables you to manage permissions for multiple Users within your AWS Account. With IAM, you can specify which CloudFront actions a User or a group of Users can perform. The IAM policies you set also govern permissions for User actions in the AWS Management Console for creating and managing CloudFront distributions.</p>\n<p>With IAM, each User has unique security credentials eliminating the need to share passwords or access keys, making it easy to enable or disable a User's access as appropriate. IAM offers you greater flexibility, control and security when using CloudFront. To learn more about using IAM with CloudFront, please visit the IAM <a href=\"/content/aws.amazon.com/live/en_US/iam.html\">detail page</a> and refer to the CloudFront <a href=\"http://docs.amazonwebservices.com/AmazonCloudFront/latest/DeveloperGuide/\">developer guide</a>.</p>","contentType":"Launch Announcement","headline":"Announcing AWS Identity & Access Management Support for CloudFront"}
{"id":"whats-new#about-aws-whats-new-2011-03-04-announcing-vmimport-connector","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/03/04/Announcing-VMImport-Connector/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:52+0000","dateUpdated":"2020-12-30T21:02:50+0000","whats-new_year":"2011","GLOBAL_content-type":"Launch Announcement","modifiedDate":"2019-10-06T04:47:27Z","headlineUrl":"/about-aws/whats-new/2011/03/04/Announcing-VMImport-Connector/","postDateTime":"2011-03-04T20:00:00Z","postSummary":"<p>\nWe're excited to announce the availability of the Amazon EC2 VM Import Connector vApp for VMware vCenter. The Connector is a virtual appliance that works with VMware vCenter making it easier to import your preexisting virtual machines (VMs) to Amazon EC2. Amazon EC2 customers can use a familiar graphical user interface to select a virtual machine (VM) and specify the AWS Region, Availability Zone, operating system, instance size, security group, and VPC details (if desired) into which the VM should be imported. Once the VM has been imported, you can launch it as an instance from the AWS Management Console.\n</p>\n<p>\nFor more information about using the VM Import Connector for VMware vCenter, please see the <a href=\"http://docs.amazonwebservices.com/AWSEC2/latest/UserGuide/index.html?UsingVirtualMachinesinAmazonEC2.html\">Amazon EC2 User Guide</a>. For more information about Amazon EC2 VM Import, please see the <a href=\"/content/aws.amazon.com/live/en_US/ec2/vmimport.html\">VM Import web page</a>. \n</p>","contentType":"Launch Announcement","headline":"Amazon EC2 VM Import adds Connector for VMware vCenter"}
{"id":"whats-new#about-aws-whats-new-2011-03-02-announcing-asia-pacific-tokyo-region","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/03/02/announcing-asia-pacific-tokyo-region/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:15+0000","dateUpdated":"2020-06-04T04:37:51+0000","whats-new_year":"2011","GLOBAL_content-type":"Launch Announcement","modifiedDate":"2020-05-28T09:50:00Z","headlineUrl":"/about-aws/whats-new/2011/03/02/announcing-asia-pacific-tokyo-region/","postDateTime":"2011-03-02T20:00:00Z","postSummary":"<p>AWS is excited to announce the immediate availability of its new Asia Pacific (Tokyo) Region. Starting today, Japan-based businesses and global companies with customers in Japan can run their applications and workloads in the Tokyo Region to reduce latency to end-users, keep their data entirely in Japan, and avoid the undifferentiated heavy lifting associated with maintaining and operating their own infrastructure. In most cases, end users in Japan can now experience single digit millisecond latencies from AWS’s new Tokyo Region. Tokyo joins Singapore as AWS’s second Asia Pacific location and as AWS’s fifth infrastructure location worldwide.</p>\n<p>The new Tokyo Region is currently available for multiple services, including: Amazon Elastic Compute Cloud (Amazon EC2), Amazon Simple Storage Service (Amazon S3), and Amazon Relational Database Service (Amazon RDS). Amazon Basic and Premium Support are also now available in Japanese for the first time. In addition, in the coming months AWS plans to provide options for billing in Japanese Yen.</p>\n<p>The newly launched Tokyo Region is now available for any business or software developer to sign up and get started today at <a href=\"http://aws.amazon.com/\">http://aws.amazon.com</a> and <a href=\"http://aws.amazon.com/jp\">http://aws.amazon.com/jp</a></p>\n","contentType":"Launch Announcement","headline":"Announcing the AWS Asia Pacific (Tokyo) Region"}
{"id":"whats-new#about-aws-whats-new-2011-03-02-announcing-aws-support-in-japanese","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/03/02/announcing-aws-support-in-japanese/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:36+0000","dateUpdated":"2020-12-30T20:57:54+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2019-10-06T04:47:27Z","headlineUrl":"/about-aws/whats-new/2011/03/02/announcing-aws-support-in-japanese/","postDateTime":"2011-03-02T20:00:00Z","postSummary":"<p>AWS is excited to announce the availability of Basic and Premium Support in Japanese.  AWS Premium Support customers can now receive one-on-one, fast-response support from AWS engineers that are fluent in Japanese and staffed to assist 24x7x365. AWS Premium Support provides a highly personalized level of service for customers seeking technical help with AWS products and features. With convenient pay-by-the-month pricing and unlimited support cases, customers are freed from long-term commitments. Customers with operational issues or technical questions about any AWS service can contact our team of Japanese-speaking support engineers and receive predictable response times and personalized support. AWS Basic Support offers all AWS customers access to our Resource Center, Product FAQs, and Discussion Forums – at no additional charge.</p>\n<p>Learn more at <a href=\"http://aws.amazon.com/premiumsupport/\">http://aws.amazon.com/premiumsupport</a></p>","contentType":"Launch Announcement","headline":"Announcing AWS Support in Japanese"}
{"id":"whats-new#about-aws-whats-new-2011-02-25-introducing-aws-cloudformation","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/02/25/introducing-aws-cloudformation/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:37+0000","dateUpdated":"2020-12-30T21:02:04+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2019-10-06T04:47:27Z","headlineUrl":"/about-aws/whats-new/2011/02/25/introducing-aws-cloudformation/","postDateTime":"2011-02-25T20:00:00Z","postSummary":"<p>\nWe're excited to introduce AWS CloudFormation, a new service that gives developers and businesses an easy way to create a collection of AWS resources and provision them in an orderly and predictable fashion. You simply describe the AWS resources you need to run your application in a simple text file called a template and AWS CloudFormation takes care of provisioning those resources in the right sequence and taking into account any dependencies between resources. Once provisioned, you can see all of the AWS resources you need to run your application in a single view.\n</p>\n<p>\nTo get started, AWS CloudFormation comes with ready-to-run sample templates to deploy some common open source applications that illustrate how easy it is to get the infrastructure for an application up and running quickly. These include WordPress (blog), Tracks (project tracking), Gollum (wiki) plus a wide range of sample templates to cut and paste from to create your own templates. There’s a good chance that a ready-made template exists to cover what you want to do.\n</p>\n<p>\nThere is no additional charge for AWS CloudFormation. You pay only for the AWS resources needed to run your application. Please see the <a href=\"/content/aws.amazon.com/live/en_US/cloudformation.html\">AWS CloudFormation detail page</a> to learn more and <a href=\"http://docs.amazonwebservices.com/AWSCloudFormation/latest/GettingStartedGuide/\">get started</a> today. \n</p>","contentType":"Launch Announcement","headline":"Introducing AWS CloudFormation"}
{"id":"whats-new#about-aws-whats-new-2011-02-17-amazon-s3-website-features","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/02/17/Amazon-S3-Website-Features/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:04+0000","dateUpdated":"2020-06-04T04:36:19+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2020-05-28T09:52:35Z","headlineUrl":"/about-aws/whats-new/2011/02/17/Amazon-S3-Website-Features/","postDateTime":"2011-02-17T20:00:00Z","postSummary":"<p>We’re excited to announce new features that make it easy to host static websites on Amazon S3. Customers already use Amazon S3 to host images, video, and other content for their website, but until now they haven’t been able to effectively host their entire website on Amazon S3. That’s because even though customers can configure an Amazon S3 bucket as a website, users accessing the root of the website (e.g. http://www.mywebsite.com/) would see the list of objects in the Amazon S3 bucket instead of the website’s home page. Also, if an error occurred, users would see an Amazon S3 error message instead of a website specific error message. In response to customer requests, we’ve added support for root and custom error documents to address these issues.</p>\n<p>&nbsp;</p>\n<p>With root and custom error document support, Amazon S3 now provides a simple and inexpensive way to host your website in one place. For more information on hosting your static website on Amazon S3, review the <a href=\"http://docs.amazonwebservices.com/AmazonS3/latest/dev/WebsiteHosting.html\">Amazon S3 Developer Guide</a>.</p>\n","contentType":"Launch Announcement","headline":"Amazon S3 adds new features for hosting static websites"}
{"id":"whats-new#about-aws-whats-new-2011-02-14-aws-identity-and-access-management-iam-users-can-now-sign-in-to-the-aws-management-console","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/02/14/aws-identity-and-access-management-iam-users-can-now-sign-in-to-the-aws-management-console/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:36+0000","dateUpdated":"2020-12-30T20:58:01+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2019-10-06T04:47:27Z","headlineUrl":"/about-aws/whats-new/2011/02/14/aws-identity-and-access-management-iam-users-can-now-sign-in-to-the-aws-management-console/","postDateTime":"2011-02-14T20:00:00Z","postSummary":"\n    We are pleased to announce that the AWS Management Console now supports Users created via AWS Identity and Access Management (IAM). IAM Users can now sign in to the console and manage services and resources under your AWS Account. IAM Users can be assigned individual <a href=\"http://aws.amazon.com/mfa/\">Multi-Factor Authentication (MFA)</a> devices to provide additional security for their access to the console. IAM can also be used to grant permissions to services and APIs an IAM User can access. For more information about IAM User sign in, see <a href=\"http://docs.amazonwebservices.com/IAM/latest/UserGuide/Using_AWSManagementConsole.html\">Using the AWS Management Console</a> in the Using IAM guide. Learn more about the AWS Identity and Access Management (IAM) at: <a href=\"http://aws.amazon.com/iam\">http://aws.amazon.com/iam</a>\n\n  ","contentType":"Launch Announcement","headline":"AWS Identity and Access Management (IAM) Users can now sign in to the AWS Management Console"}
{"id":"whats-new#about-aws-whats-new-2011-02-08-new-edge-location-paris","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/02/08/new-edge-location-paris/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:34+0000","dateUpdated":"2020-12-30T21:02:50+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2019-10-06T04:47:27Z","headlineUrl":"/about-aws/whats-new/2011/02/08/new-edge-location-paris/","postDateTime":"2011-02-08T20:00:00Z","postSummary":"<p>We’re excited to announce that we’ve added a new edge location in Paris to help improve performance for end users of Amazon CloudFront and Amazon Route 53. Both CloudFront and Route 53 utilize a global network of locations to provide your end users with low latency and high performance in accessing your content. With this addition, the number of locations utilized by CloudFront and Route 53 in Europe has increased to 5, and the number of global locations to 18. We plan to continue to add new locations worldwide for each service throughout 2011. To learn more about <a href=\"/content/aws.amazon.com/live/en_US/cloudfront.html\">CloudFront</a> and <a href=\"/content/aws.amazon.com/live/en_US/route53.html\">Route 53</a>, visit their respective product detail pages on our website.</p>\n<p>We’re also hosting a free interactive online Q&amp;A session about CloudFront on Feb 9, 2011 from 9 am – 10 am PST (5 pm – 6 pm UTC/GMT). If you have questions about the service, register for this session at <a href=\"/content/aws.amazon.com/live/en_US/officehours.html\">http://aws.amazon.com/officehours</a>.</p>","contentType":"Launch Announcement","headline":"New Edge Location for Amazon CloudFront and Amazon Route 53"}
{"id":"whats-new#about-aws-whats-new-2011-02-01-oracle-database-11g-coming-to-amazon-rds","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/02/01/oracle-database-11g-coming-to-amazon-rds/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:30+0000","dateUpdated":"2020-12-30T21:02:05+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2019-10-06T04:47:27Z","headlineUrl":"/about-aws/whats-new/2011/02/01/oracle-database-11g-coming-to-amazon-rds/","postDateTime":"2011-02-01T20:00:00Z","postSummary":"<p>We are excited to announce our plans to make Oracle Database 11g available via the <a href=\"http://aws.amazon.com/rds/\">Amazon Relational Database Service</a> during the second quarter of 2011.   Amazon RDS already makes it easier to set up, operate, and scale MySQL databases in the cloud.  In the coming months you will also be able to run Oracle Databases via Amazon RDS, simplifying database provisioning and offloading common administration tasks like backups and software patching.   If you have existing Oracle Database licenses, you will be able to apply them to run Oracle Databases on Amazon RDS with no additional software licensing or support charges.  If you don’t, you can take advantage of pay-by-the-hour licensing with no upfront fees or long-term commitments.</p>\n<p>Click <a href=\"http://aws.amazon.com/rds/oracle\">here</a> to learn more, sign up to be notified when the service is available, or to request a briefing from an AWS associate.   Visit the Amazon RDS <a href=\"http://aws.amazon.com/rds/\">detail page</a> to learn more about the benefits of Amazon RDS and deploy a managed MySQL database today.</p>","contentType":"Launch Announcement","headline":"Oracle Database 11g coming to Amazon RDS "}
{"id":"whats-new#about-aws-whats-new-2011-01-25-aws-management-console-support-for-amazon-cloudwatch","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/01/25/aws-management-console-support-for-amazon-cloudwatch/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:16+0000","dateUpdated":"2020-12-30T21:01:54+0000","whats-new_year":"2011","GLOBAL_content-type":"Launch Announcement","modifiedDate":"2019-10-06T04:47:28Z","headlineUrl":"/about-aws/whats-new/2011/01/25/aws-management-console-support-for-amazon-cloudwatch/","postDateTime":"2011-01-25T20:00:00Z","postSummary":"<p>We’re excited to announce that we’ve added AWS Management Console support for Amazon CloudWatch, a web service that helps you monitor your AWS resources by automatically collecting operational and performance metrics. With a simple point-and-click interface, you can now search and browse your AWS resource metrics, view graphs to troubleshoot issues and discover trends, create and edit alarms to be notified of problems, and get at-a-glance performance overviews of your AWS resources, all from your browser. Amazon CloudWatch automatically monitors your Amazon EC2 instances, EBS volumes, RDS DB instances, and Elastic Load Balancers.  Access to the AWS management console is provided free of charge at: <a href=\"/content/aws.amazon.com/live/en_US/console.html\">aws.amazon.com/console</a>.</p>","contentType":"Launch Announcement","headline":"AWS Management Console Adds Enhanced Support for Amazon CloudWatch"}
{"id":"whats-new#about-aws-whats-new-2011-01-25-introducing-amazon-simple-email-service-beta","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/01/25/introducing-amazon-simple-email-service-beta/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:17+0000","dateUpdated":"2020-12-30T21:02:54+0000","GLOBAL_content-type":"Launch Announcement","whats-new_year":"2011","modifiedDate":"2019-10-06T04:47:27Z","headlineUrl":"/about-aws/whats-new/2011/01/25/introducing-amazon-simple-email-service-beta/","postDateTime":"2011-01-25T20:00:00Z","postSummary":"<p>We’re excited to announce the beta release of Amazon Simple Email Service (Amazon SES), a highly scalable and cost-effective bulk and transactional email-sending service for businesses and developers.  Amazon SES eliminates the complexity and expense of building an in-house email solution or licensing, installing, and operating a third-party email service.  The service integrates with other AWS services, making it easy to send emails from applications being hosted on services such as Amazon EC2. With Amazon SES there is no long-term commitment, minimum spend or negotiation required – businesses can utilize a free usage tier, and after that, enjoy low fees for the number of emails sent plus data transfer.  To get started using Amazon SES, visit <a href=\"/content/aws.amazon.com/live/en_US/ses.html\">http://aws.amazon.com/ses/</a>.</p>\n<p>Building large-scale email solutions to send marketing and transactional messages is often a complex and costly challenge for businesses. To increase the percentage of emails that are successfully delivered, businesses must deal with hassles such as email server management, network configuration, and meeting rigorous Internet Service Provider (ISP) standards for email content. Additionally, many third-party email solutions require contract and price negotiations, as well as significant up-front costs.</p>\n<p>Amazon SES eliminates these challenges and enables businesses to benefit from the years of experience and sophisticated email infrastructure Amazon.com has built to serve its own large-scale customer base. Through a simple API call, businesses can now access a high-quality, scalable email infrastructure to efficiently and inexpensively communicate to their customers.  For high email deliverability, Amazon SES uses content filtering technologies to scan a business’s outgoing email messages to help ensure that the content meets ISP standards. The email message is then either queued for sending or routed back to the sender for corrective action.  To help businesses further improve the quality of email communications with their customers, Amazon SES provides a built-in feedback loop, which includes notifications of bounce backs, failed and successful delivery attempts, and spam complaints.</p>\n<p>Start sending email in minutes through Amazon SES using the AWS software development kits for Java and .NET, or code directly to our HTTPS interface using your favorite programming language.</p>\n<p>Learn more about Amazon SES at: <a href=\"/content/aws.amazon.com/live/en_US/ses.html\">http://aws.amazon.com/ses</a></p>","contentType":"Launch Announcement","headline":"Introducing Amazon Simple Email Service (Beta)"}
{"id":"whats-new#about-aws-whats-new-2011-01-19-introducing-aws-elastic-beanstalk-beta","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/01/19/introducing-aws-elastic-beanstalk-beta/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:50:15+0000","dateUpdated":"2020-12-30T21:07:00+0000","whats-new_year":"2011","GLOBAL_content-type":"Launch Announcement","modifiedDate":"2019-10-06T04:47:28Z","headlineUrl":"/about-aws/whats-new/2011/01/19/introducing-aws-elastic-beanstalk-beta/","postDateTime":"2011-01-19T20:00:00Z","postSummary":"<p>We are excited to announce <a href=\"/content/aws.amazon.com/live/en_US/elasticbeanstalk.html\">AWS Elastic Beanstalk</a>, an even easier way for developers to quickly deploy and manage applications in the AWS cloud.  Easy to begin and impossible to outgrow, developers simply upload their application and Elastic Beanstalk automatically handles the deployment details of capacity provisioning, load balancing, auto-scaling, and application health monitoring.  At the same time, Elastic Beanstalk developers retain full control over the AWS resources powering their application and can access the underlying resources at any time.  While the initial release of Elastic Beanstalk supports Java web application developers using the familiar Apache Tomcat software stack, Elastic Beanstalk is designed so that it can be extended to support multiple development stacks and programming languages in the future.  AWS is actively working with solution providers on the APIs and capabilities needed to create additional Elastic Beanstalk offerings.</p>\n<p>There is no additional charge for Elastic Beanstalk – customers pay only for the AWS resources needed to run their applications.  Please see the <a href=\"/content/aws.amazon.com/live/en_US/elasticbeanstalk.html\">AWS Elastic Beanstalk detail page</a> to learn more and <a href=\"/content/aws.amazon.com/live/en_US/elasticbeanstalk/gsg.html\">get started</a> today.</p>","contentType":"Launch Announcement","headline":"Introducing AWS Elastic Beanstalk (Beta)"}
{"id":"whats-new#about-aws-whats-new-2011-01-06-aws-introduces-new-premium-support-plans-lowers-usage-prices-by-50-on-existing-plans","locale":"en_US","directoryId":"whats-new","name":"/about-aws/whats-new/2011/01/06/aws-introduces-new-premium-support-plans-lowers-usage-prices-by-50-on-existing-plans/","author":"aws","createdBy":"aws","lastUpdatedBy":"aws","numImpressions":0,"score":0,"dateCreated":"2019-05-03T05:51:06+0000","dateUpdated":"2020-12-30T21:04:04+0000","whats-new_year":"2011","GLOBAL_content-type":"Launch Announcement","modifiedDate":"2020-10-28T19:41:41Z","headlineUrl":"/about-aws/whats-new/2011/01/06/aws-introduces-new-premium-support-plans-lowers-usage-prices-by-50-on-existing-plans/","postDateTime":"2011-01-06T20:00:00Z","postSummary":"<p>We are excited to announce that we have lowered usage pricing on existing Premium Support offerings by 50% and added two new support plans to meet the needs of developers and businesses of all sizes and technical ability.  In addition to existing Silver and Gold support plans – which provide fast, predictable response times, an unlimited number of support cases, and personalized support from AWS developer support engineers – AWS will now offer a Bronze support plan which offers a low-priced option for developers at $49 per month, and a Platinum support plan which provides 15 minute response times and dedicated Technical Account Managers to meet the needs of larger enterprises and more complex projects.  All AWS customers can continue to take advantage of AWS Basic Support which provides free access to a Resource Center, Service Health Dashboard, Technical FAQ’s and Developer Forums. To learn more about the range of AWS support options, visit <a href=\"/content/aws.amazon.com/live/en_US/premiumsupport.html\">http://aws.amazon.com/premiumsupport/</a>.</p>","contentType":"Launch Announcement","headline":"AWS Introduces New Premium Support Plans, Lowers Usage Prices by 50% on Existing Plans"}
